/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {

pub const SPEC_TAG_SEPARATOR_STR: &[u8; 10] = b"SEPARATOR\0";
pub const SPEC_TAG_CASE_SENSITIVE_STR: &[u8; 14] = b"CASESENSITIVE\0";
pub const SPEC_MULTITYPE_STR: &[u8; 10] = b"MULTITYPE\0";
pub const SPEC_ASYNC_STR: &[u8; 6] = b"ASYNC\0";
pub const SPEC_SKIPINITIALSCAN_STR: &[u8; 16] = b"SKIPINITIALSCAN\0";
pub const SPEC_WITHSUFFIXTRIE_STR: &[u8; 15] = b"WITHSUFFIXTRIE\0";
pub const SPEC_INDEXEMPTY_STR: &[u8; 11] = b"INDEXEMPTY\0";
pub const SPEC_INDEXMISSING_STR: &[u8; 13] = b"INDEXMISSING\0";
pub const SPEC_INDEXALL_STR: &[u8; 9] = b"INDEXALL\0";
pub const SPEC_GEOMETRY_FLAT_STR: &[u8; 5] = b"FLAT\0";
pub const SPEC_GEOMETRY_SPHERE_STR: &[u8; 10] = b"SPHERICAL\0";
pub const DEFAULT_SCORE: f64 = 1.0;
pub const INDEX_SPEC_KEY_PREFIX: &[u8; 5] = b"idx:\0";
pub const INDEX_SPEC_KEY_FMT: &[u8; 7] = b"idx:%s\0";
pub const SPEC_MAX_FIELDS: u32 = 1024;
pub const SPEC_WIDEFIELD_THRESHOLD: u32 = 32;
pub const MIN_DIALECT_VERSION: u32 = 1;
pub const MAX_DIALECT_VERSION: u32 = 4;
pub const INDEX_CURRENT_VERSION: u32 = 26;
pub const INDEX_DISK_VERSION: u32 = 26;
pub const INDEX_VECSIM_SVS_VAMANA_VERSION: u32 = 25;
pub const INDEX_INDEXALL_VERSION: u32 = 24;
pub const INDEX_GEOMETRY_VERSION: u32 = 23;
pub const INDEX_VECSIM_TIERED_VERSION: u32 = 22;
pub const INDEX_VECSIM_MULTI_VERSION: u32 = 21;
pub const INDEX_VECSIM_2_VERSION: u32 = 20;
pub const INDEX_VECSIM_VERSION: u32 = 19;
pub const INDEX_JSON_VERSION: u32 = 18;
pub const INDEX_MIN_COMPAT_VERSION: u32 = 17;
pub const LEGACY_INDEX_MAX_VERSION: u32 = 16;
pub const LEGACY_INDEX_MIN_VERSION: u32 = 2;
pub const INDEX_MIN_WITH_SYNONYMS_INT_GROUP_ID: u32 = 16;
pub const INDEX_MIN_COMPACTED_DOCTABLE_VERSION: u32 = 12;
pub const INDEX_MIN_NOFREQ_VERSION: u32 = 6;
pub const INDEX_MIN_WIDESCHEMA_VERSION: u32 = 7;
pub const INDEX_MIN_TAGFIELD_VERSION: u32 = 8;
pub const INDEX_MIN_DOCLEN_VERSION: u32 = 9;
pub const INDEX_MIN_BINKEYS_VERSION: u32 = 10;
pub const INDEX_MIN_EXPIRE_VERSION: u32 = 13;
pub const INDEX_MIN_MULTITYPE_VERSION: u32 = 14;
pub const INDEX_MIN_ALIAS_VERSION: u32 = 15;
pub const IDXFLD_LEGACY_FULLTEXT: u32 = 0;
pub const IDXFLD_LEGACY_NUMERIC: u32 = 1;
pub const IDXFLD_LEGACY_GEO: u32 = 2;
pub const IDXFLD_LEGACY_TAG: u32 = 3;
pub const IDXFLD_LEGACY_MAX: u32 = 3;
pub const APIVERSION_RETURN_MULTI_CMP_FIRST: u32 = 3;
pub const FREQ_QUANTIZE_FACTOR: u32 = 65535;
pub const DEFAULT_RECORDLIST_SIZE: u32 = 4;
pub const MAX_OBFUSCATED_INDEX_NAME: u32 = 47;
pub const DONT_CREATE_INDEX: u32 = 0;
pub const CREATE_INDEX: u32 = 1;
pub const SORTASCMAP_INIT: i32 = -1;
pub const SORTASCMAP_MAXFIELDS: u32 = 8;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_time_t = ::std::os::raw::c_long;
pub type __darwin_off_t = __int64_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlock_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 192usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_rwlock_t"]
        [::std::mem::size_of::<_opaque_pthread_rwlock_t>() - 200usize];
    ["Alignment of _opaque_pthread_rwlock_t"]
        [::std::mem::align_of::<_opaque_pthread_rwlock_t>() - 8usize];
    ["Offset of field: _opaque_pthread_rwlock_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_rwlock_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_rwlock_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_rwlock_t, __opaque) - 8usize];
};
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type uint_least8_t = u8;
pub type pthread_rwlock_t = __darwin_pthread_rwlock_t;
pub type va_list = __darwin_va_list;
pub type fpos_t = __darwin_off_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut ::std::os::raw::c_uchar,
    pub _size: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sbuf"][::std::mem::size_of::<__sbuf>() - 16usize];
    ["Alignment of __sbuf"][::std::mem::align_of::<__sbuf>() - 8usize];
    ["Offset of field: __sbuf::_base"][::std::mem::offset_of!(__sbuf, _base) - 0usize];
    ["Offset of field: __sbuf::_size"][::std::mem::offset_of!(__sbuf, _size) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILEX {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut ::std::os::raw::c_uchar,
    pub _r: ::std::os::raw::c_int,
    pub _w: ::std::os::raw::c_int,
    pub _flags: ::std::os::raw::c_short,
    pub _file: ::std::os::raw::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: ::std::os::raw::c_int,
    pub _cookie: *mut ::std::os::raw::c_void,
    pub _close: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
    >,
    pub _read: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut ::std::os::raw::c_char,
            arg3: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _seek: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: fpos_t,
            arg3: ::std::os::raw::c_int,
        ) -> fpos_t,
    >,
    pub _write: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_char,
            arg3: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _ub: __sbuf,
    pub _extra: *mut __sFILEX,
    pub _ur: ::std::os::raw::c_int,
    pub _ubuf: [::std::os::raw::c_uchar; 3usize],
    pub _nbuf: [::std::os::raw::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: ::std::os::raw::c_int,
    pub _offset: fpos_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sFILE"][::std::mem::size_of::<__sFILE>() - 152usize];
    ["Alignment of __sFILE"][::std::mem::align_of::<__sFILE>() - 8usize];
    ["Offset of field: __sFILE::_p"][::std::mem::offset_of!(__sFILE, _p) - 0usize];
    ["Offset of field: __sFILE::_r"][::std::mem::offset_of!(__sFILE, _r) - 8usize];
    ["Offset of field: __sFILE::_w"][::std::mem::offset_of!(__sFILE, _w) - 12usize];
    ["Offset of field: __sFILE::_flags"][::std::mem::offset_of!(__sFILE, _flags) - 16usize];
    ["Offset of field: __sFILE::_file"][::std::mem::offset_of!(__sFILE, _file) - 18usize];
    ["Offset of field: __sFILE::_bf"][::std::mem::offset_of!(__sFILE, _bf) - 24usize];
    ["Offset of field: __sFILE::_lbfsize"][::std::mem::offset_of!(__sFILE, _lbfsize) - 40usize];
    ["Offset of field: __sFILE::_cookie"][::std::mem::offset_of!(__sFILE, _cookie) - 48usize];
    ["Offset of field: __sFILE::_close"][::std::mem::offset_of!(__sFILE, _close) - 56usize];
    ["Offset of field: __sFILE::_read"][::std::mem::offset_of!(__sFILE, _read) - 64usize];
    ["Offset of field: __sFILE::_seek"][::std::mem::offset_of!(__sFILE, _seek) - 72usize];
    ["Offset of field: __sFILE::_write"][::std::mem::offset_of!(__sFILE, _write) - 80usize];
    ["Offset of field: __sFILE::_ub"][::std::mem::offset_of!(__sFILE, _ub) - 88usize];
    ["Offset of field: __sFILE::_extra"][::std::mem::offset_of!(__sFILE, _extra) - 104usize];
    ["Offset of field: __sFILE::_ur"][::std::mem::offset_of!(__sFILE, _ur) - 112usize];
    ["Offset of field: __sFILE::_ubuf"][::std::mem::offset_of!(__sFILE, _ubuf) - 116usize];
    ["Offset of field: __sFILE::_nbuf"][::std::mem::offset_of!(__sFILE, _nbuf) - 119usize];
    ["Offset of field: __sFILE::_lb"][::std::mem::offset_of!(__sFILE, _lb) - 120usize];
    ["Offset of field: __sFILE::_blksize"][::std::mem::offset_of!(__sFILE, _blksize) - 136usize];
    ["Offset of field: __sFILE::_offset"][::std::mem::offset_of!(__sFILE, _offset) - 144usize];
};
pub type FILE = __sFILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleString {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleKey {
    _unused: [u8; 0],
}
pub type RedisModuleKeyMetaClassId = ::std::os::raw::c_int;
pub type mstime_t = ::std::os::raw::c_longlong;
pub type ustime_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleStreamID {
    pub ms: u64,
    pub seq: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleStreamID"][::std::mem::size_of::<RedisModuleStreamID>() - 16usize];
    ["Alignment of RedisModuleStreamID"][::std::mem::align_of::<RedisModuleStreamID>() - 8usize];
    ["Offset of field: RedisModuleStreamID::ms"]
        [::std::mem::offset_of!(RedisModuleStreamID, ms) - 0usize];
    ["Offset of field: RedisModuleStreamID::seq"]
        [::std::mem::offset_of!(RedisModuleStreamID, seq) - 8usize];
};
pub const RedisModuleLoadType_REDISMODULE_LOADING_RDB: RedisModuleLoadType = 0;
pub const RedisModuleLoadType_REDISMODULE_LOADING_AOF: RedisModuleLoadType = 1;
pub type RedisModuleLoadType = ::std::os::raw::c_uint;
pub type RedisModuleTimerID = u64;
pub const RedisModuleCommandArgType_REDISMODULE_ARG_TYPE_STRING: RedisModuleCommandArgType = 0;
pub const RedisModuleCommandArgType_REDISMODULE_ARG_TYPE_INTEGER: RedisModuleCommandArgType = 1;
pub const RedisModuleCommandArgType_REDISMODULE_ARG_TYPE_DOUBLE: RedisModuleCommandArgType = 2;
pub const RedisModuleCommandArgType_REDISMODULE_ARG_TYPE_KEY: RedisModuleCommandArgType = 3;
pub const RedisModuleCommandArgType_REDISMODULE_ARG_TYPE_PATTERN: RedisModuleCommandArgType = 4;
pub const RedisModuleCommandArgType_REDISMODULE_ARG_TYPE_UNIX_TIME: RedisModuleCommandArgType = 5;
pub const RedisModuleCommandArgType_REDISMODULE_ARG_TYPE_PURE_TOKEN: RedisModuleCommandArgType = 6;
pub const RedisModuleCommandArgType_REDISMODULE_ARG_TYPE_ONEOF: RedisModuleCommandArgType = 7;
pub const RedisModuleCommandArgType_REDISMODULE_ARG_TYPE_BLOCK: RedisModuleCommandArgType = 8;
pub type RedisModuleCommandArgType = ::std::os::raw::c_uint;
pub const RedisModuleKeySpecBeginSearchType_REDISMODULE_KSPEC_BS_INVALID:
    RedisModuleKeySpecBeginSearchType = 0;
pub const RedisModuleKeySpecBeginSearchType_REDISMODULE_KSPEC_BS_UNKNOWN:
    RedisModuleKeySpecBeginSearchType = 1;
pub const RedisModuleKeySpecBeginSearchType_REDISMODULE_KSPEC_BS_INDEX:
    RedisModuleKeySpecBeginSearchType = 2;
pub const RedisModuleKeySpecBeginSearchType_REDISMODULE_KSPEC_BS_KEYWORD:
    RedisModuleKeySpecBeginSearchType = 3;
pub type RedisModuleKeySpecBeginSearchType = ::std::os::raw::c_uint;
pub const RedisModuleKeySpecFindKeysType_REDISMODULE_KSPEC_FK_OMITTED:
    RedisModuleKeySpecFindKeysType = 0;
pub const RedisModuleKeySpecFindKeysType_REDISMODULE_KSPEC_FK_UNKNOWN:
    RedisModuleKeySpecFindKeysType = 1;
pub const RedisModuleKeySpecFindKeysType_REDISMODULE_KSPEC_FK_RANGE:
    RedisModuleKeySpecFindKeysType = 2;
pub const RedisModuleKeySpecFindKeysType_REDISMODULE_KSPEC_FK_KEYNUM:
    RedisModuleKeySpecFindKeysType = 3;
pub type RedisModuleKeySpecFindKeysType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCommandArg {
    pub name: *const ::std::os::raw::c_char,
    pub type_: RedisModuleCommandArgType,
    pub key_spec_index: ::std::os::raw::c_int,
    pub token: *const ::std::os::raw::c_char,
    pub summary: *const ::std::os::raw::c_char,
    pub since: *const ::std::os::raw::c_char,
    pub flags: ::std::os::raw::c_int,
    pub deprecated_since: *const ::std::os::raw::c_char,
    pub subargs: *mut RedisModuleCommandArg,
    pub display_text: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleCommandArg"][::std::mem::size_of::<RedisModuleCommandArg>() - 72usize];
    ["Alignment of RedisModuleCommandArg"]
        [::std::mem::align_of::<RedisModuleCommandArg>() - 8usize];
    ["Offset of field: RedisModuleCommandArg::name"]
        [::std::mem::offset_of!(RedisModuleCommandArg, name) - 0usize];
    ["Offset of field: RedisModuleCommandArg::type_"]
        [::std::mem::offset_of!(RedisModuleCommandArg, type_) - 8usize];
    ["Offset of field: RedisModuleCommandArg::key_spec_index"]
        [::std::mem::offset_of!(RedisModuleCommandArg, key_spec_index) - 12usize];
    ["Offset of field: RedisModuleCommandArg::token"]
        [::std::mem::offset_of!(RedisModuleCommandArg, token) - 16usize];
    ["Offset of field: RedisModuleCommandArg::summary"]
        [::std::mem::offset_of!(RedisModuleCommandArg, summary) - 24usize];
    ["Offset of field: RedisModuleCommandArg::since"]
        [::std::mem::offset_of!(RedisModuleCommandArg, since) - 32usize];
    ["Offset of field: RedisModuleCommandArg::flags"]
        [::std::mem::offset_of!(RedisModuleCommandArg, flags) - 40usize];
    ["Offset of field: RedisModuleCommandArg::deprecated_since"]
        [::std::mem::offset_of!(RedisModuleCommandArg, deprecated_since) - 48usize];
    ["Offset of field: RedisModuleCommandArg::subargs"]
        [::std::mem::offset_of!(RedisModuleCommandArg, subargs) - 56usize];
    ["Offset of field: RedisModuleCommandArg::display_text"]
        [::std::mem::offset_of!(RedisModuleCommandArg, display_text) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCommandHistoryEntry {
    pub since: *const ::std::os::raw::c_char,
    pub changes: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleCommandHistoryEntry"]
        [::std::mem::size_of::<RedisModuleCommandHistoryEntry>() - 16usize];
    ["Alignment of RedisModuleCommandHistoryEntry"]
        [::std::mem::align_of::<RedisModuleCommandHistoryEntry>() - 8usize];
    ["Offset of field: RedisModuleCommandHistoryEntry::since"]
        [::std::mem::offset_of!(RedisModuleCommandHistoryEntry, since) - 0usize];
    ["Offset of field: RedisModuleCommandHistoryEntry::changes"]
        [::std::mem::offset_of!(RedisModuleCommandHistoryEntry, changes) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct RedisModuleCommandKeySpec {
    pub notes: *const ::std::os::raw::c_char,
    pub flags: u64,
    pub begin_search_type: RedisModuleKeySpecBeginSearchType,
    pub bs: RedisModuleCommandKeySpec__bindgen_ty_1,
    pub find_keys_type: RedisModuleKeySpecFindKeysType,
    pub fk: RedisModuleCommandKeySpec__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union RedisModuleCommandKeySpec__bindgen_ty_1 {
    pub index: RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_1,
    pub keyword: RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_1 {
    pub pos: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Alignment of RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_1::pos"][::std::mem::offset_of!(
        RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_1,
        pos
    ) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_2 {
    pub keyword: *const ::std::os::raw::c_char,
    pub startfrom: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_2>() - 16usize];
    ["Alignment of RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_2::keyword"][::std::mem::offset_of!(
        RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_2,
        keyword
    ) - 0usize];
    ["Offset of field: RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_2::startfrom"][::std::mem::offset_of!(
        RedisModuleCommandKeySpec__bindgen_ty_1__bindgen_ty_2,
        startfrom
    )
        - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleCommandKeySpec__bindgen_ty_1"]
        [::std::mem::size_of::<RedisModuleCommandKeySpec__bindgen_ty_1>() - 16usize];
    ["Alignment of RedisModuleCommandKeySpec__bindgen_ty_1"]
        [::std::mem::align_of::<RedisModuleCommandKeySpec__bindgen_ty_1>() - 8usize];
    ["Offset of field: RedisModuleCommandKeySpec__bindgen_ty_1::index"]
        [::std::mem::offset_of!(RedisModuleCommandKeySpec__bindgen_ty_1, index) - 0usize];
    ["Offset of field: RedisModuleCommandKeySpec__bindgen_ty_1::keyword"]
        [::std::mem::offset_of!(RedisModuleCommandKeySpec__bindgen_ty_1, keyword) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union RedisModuleCommandKeySpec__bindgen_ty_2 {
    pub range: RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_1,
    pub keynum: RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_1 {
    pub lastkey: ::std::os::raw::c_int,
    pub keystep: ::std::os::raw::c_int,
    pub limit: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_1"]
        [::std::mem::size_of::<RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_1>() - 12usize];
    ["Alignment of RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_1"]
        [::std::mem::align_of::<RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_1>() - 4usize];
    ["Offset of field: RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_1::lastkey"][::std::mem::offset_of!(
        RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_1,
        lastkey
    ) - 0usize];
    ["Offset of field: RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_1::keystep"][::std::mem::offset_of!(
        RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_1,
        keystep
    ) - 4usize];
    ["Offset of field: RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_1::limit"][::std::mem::offset_of!(
        RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_1,
        limit
    ) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_2 {
    pub keynumidx: ::std::os::raw::c_int,
    pub firstkey: ::std::os::raw::c_int,
    pub keystep: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_2"]
        [::std::mem::size_of::<RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_2>() - 12usize];
    ["Alignment of RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_2"]
        [::std::mem::align_of::<RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_2>() - 4usize];
    ["Offset of field: RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_2::keynumidx"][::std::mem::offset_of!(
        RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_2,
        keynumidx
    )
        - 0usize];
    ["Offset of field: RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_2::firstkey"][::std::mem::offset_of!(
        RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_2,
        firstkey
    )
        - 4usize];
    ["Offset of field: RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_2::keystep"][::std::mem::offset_of!(
        RedisModuleCommandKeySpec__bindgen_ty_2__bindgen_ty_2,
        keystep
    ) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleCommandKeySpec__bindgen_ty_2"]
        [::std::mem::size_of::<RedisModuleCommandKeySpec__bindgen_ty_2>() - 12usize];
    ["Alignment of RedisModuleCommandKeySpec__bindgen_ty_2"]
        [::std::mem::align_of::<RedisModuleCommandKeySpec__bindgen_ty_2>() - 4usize];
    ["Offset of field: RedisModuleCommandKeySpec__bindgen_ty_2::range"]
        [::std::mem::offset_of!(RedisModuleCommandKeySpec__bindgen_ty_2, range) - 0usize];
    ["Offset of field: RedisModuleCommandKeySpec__bindgen_ty_2::keynum"]
        [::std::mem::offset_of!(RedisModuleCommandKeySpec__bindgen_ty_2, keynum) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleCommandKeySpec"]
        [::std::mem::size_of::<RedisModuleCommandKeySpec>() - 56usize];
    ["Alignment of RedisModuleCommandKeySpec"]
        [::std::mem::align_of::<RedisModuleCommandKeySpec>() - 8usize];
    ["Offset of field: RedisModuleCommandKeySpec::notes"]
        [::std::mem::offset_of!(RedisModuleCommandKeySpec, notes) - 0usize];
    ["Offset of field: RedisModuleCommandKeySpec::flags"]
        [::std::mem::offset_of!(RedisModuleCommandKeySpec, flags) - 8usize];
    ["Offset of field: RedisModuleCommandKeySpec::begin_search_type"]
        [::std::mem::offset_of!(RedisModuleCommandKeySpec, begin_search_type) - 16usize];
    ["Offset of field: RedisModuleCommandKeySpec::bs"]
        [::std::mem::offset_of!(RedisModuleCommandKeySpec, bs) - 24usize];
    ["Offset of field: RedisModuleCommandKeySpec::find_keys_type"]
        [::std::mem::offset_of!(RedisModuleCommandKeySpec, find_keys_type) - 40usize];
    ["Offset of field: RedisModuleCommandKeySpec::fk"]
        [::std::mem::offset_of!(RedisModuleCommandKeySpec, fk) - 44usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCommandInfoVersion {
    pub version: ::std::os::raw::c_int,
    pub sizeof_historyentry: usize,
    pub sizeof_keyspec: usize,
    pub sizeof_arg: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleCommandInfoVersion"]
        [::std::mem::size_of::<RedisModuleCommandInfoVersion>() - 32usize];
    ["Alignment of RedisModuleCommandInfoVersion"]
        [::std::mem::align_of::<RedisModuleCommandInfoVersion>() - 8usize];
    ["Offset of field: RedisModuleCommandInfoVersion::version"]
        [::std::mem::offset_of!(RedisModuleCommandInfoVersion, version) - 0usize];
    ["Offset of field: RedisModuleCommandInfoVersion::sizeof_historyentry"]
        [::std::mem::offset_of!(RedisModuleCommandInfoVersion, sizeof_historyentry) - 8usize];
    ["Offset of field: RedisModuleCommandInfoVersion::sizeof_keyspec"]
        [::std::mem::offset_of!(RedisModuleCommandInfoVersion, sizeof_keyspec) - 16usize];
    ["Offset of field: RedisModuleCommandInfoVersion::sizeof_arg"]
        [::std::mem::offset_of!(RedisModuleCommandInfoVersion, sizeof_arg) - 24usize];
};
unsafe extern "C" {
    pub static RedisModule_CurrentCommandInfoVersion: RedisModuleCommandInfoVersion;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCommandInfo {
    pub version: *const RedisModuleCommandInfoVersion,
    pub summary: *const ::std::os::raw::c_char,
    pub complexity: *const ::std::os::raw::c_char,
    pub since: *const ::std::os::raw::c_char,
    pub history: *mut RedisModuleCommandHistoryEntry,
    pub tips: *const ::std::os::raw::c_char,
    pub arity: ::std::os::raw::c_int,
    pub key_specs: *mut RedisModuleCommandKeySpec,
    pub args: *mut RedisModuleCommandArg,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleCommandInfo"][::std::mem::size_of::<RedisModuleCommandInfo>() - 72usize];
    ["Alignment of RedisModuleCommandInfo"]
        [::std::mem::align_of::<RedisModuleCommandInfo>() - 8usize];
    ["Offset of field: RedisModuleCommandInfo::version"]
        [::std::mem::offset_of!(RedisModuleCommandInfo, version) - 0usize];
    ["Offset of field: RedisModuleCommandInfo::summary"]
        [::std::mem::offset_of!(RedisModuleCommandInfo, summary) - 8usize];
    ["Offset of field: RedisModuleCommandInfo::complexity"]
        [::std::mem::offset_of!(RedisModuleCommandInfo, complexity) - 16usize];
    ["Offset of field: RedisModuleCommandInfo::since"]
        [::std::mem::offset_of!(RedisModuleCommandInfo, since) - 24usize];
    ["Offset of field: RedisModuleCommandInfo::history"]
        [::std::mem::offset_of!(RedisModuleCommandInfo, history) - 32usize];
    ["Offset of field: RedisModuleCommandInfo::tips"]
        [::std::mem::offset_of!(RedisModuleCommandInfo, tips) - 40usize];
    ["Offset of field: RedisModuleCommandInfo::arity"]
        [::std::mem::offset_of!(RedisModuleCommandInfo, arity) - 48usize];
    ["Offset of field: RedisModuleCommandInfo::key_specs"]
        [::std::mem::offset_of!(RedisModuleCommandInfo, key_specs) - 56usize];
    ["Offset of field: RedisModuleCommandInfo::args"]
        [::std::mem::offset_of!(RedisModuleCommandInfo, args) - 64usize];
};
pub type RedisModuleEventLoopFunc = ::std::option::Option<
    unsafe extern "C" fn(
        fd: ::std::os::raw::c_int,
        user_data: *mut ::std::os::raw::c_void,
        mask: ::std::os::raw::c_int,
    ),
>;
pub type RedisModuleEventLoopOneShotFunc =
    ::std::option::Option<unsafe extern "C" fn(user_data: *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleEvent {
    pub id: u64,
    pub dataver: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleEvent"][::std::mem::size_of::<RedisModuleEvent>() - 16usize];
    ["Alignment of RedisModuleEvent"][::std::mem::align_of::<RedisModuleEvent>() - 8usize];
    ["Offset of field: RedisModuleEvent::id"]
        [::std::mem::offset_of!(RedisModuleEvent, id) - 0usize];
    ["Offset of field: RedisModuleEvent::dataver"]
        [::std::mem::offset_of!(RedisModuleEvent, dataver) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCtx {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleDefragCtx {
    _unused: [u8; 0],
}
pub type RedisModuleEventCallback = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        eid: RedisModuleEvent,
        subevent: u64,
        data: *mut ::std::os::raw::c_void,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleBigCallbacks {
    pub version: u64,
    pub getDiskUsage: ::std::option::Option<unsafe extern "C" fn() -> usize>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleBigCallbacks"][::std::mem::size_of::<RedisModuleBigCallbacks>() - 16usize];
    ["Alignment of RedisModuleBigCallbacks"]
        [::std::mem::align_of::<RedisModuleBigCallbacks>() - 8usize];
    ["Offset of field: RedisModuleBigCallbacks::version"]
        [::std::mem::offset_of!(RedisModuleBigCallbacks, version) - 0usize];
    ["Offset of field: RedisModuleBigCallbacks::getDiskUsage"]
        [::std::mem::offset_of!(RedisModuleBigCallbacks, getDiskUsage) - 8usize];
};
pub type RedisModuleBigCallbacksV1 = RedisModuleBigCallbacks;
unsafe extern "C" {
    pub static RedisModuleEvent_ReplicationRoleChanged: RedisModuleEvent;
}
unsafe extern "C" {
    pub static RedisModuleEvent_Persistence: RedisModuleEvent;
}
unsafe extern "C" {
    pub static RedisModuleEvent_FlushDB: RedisModuleEvent;
}
unsafe extern "C" {
    pub static RedisModuleEvent_Loading: RedisModuleEvent;
}
unsafe extern "C" {
    pub static RedisModuleEvent_ClientChange: RedisModuleEvent;
}
unsafe extern "C" {
    pub static RedisModuleEvent_Shutdown: RedisModuleEvent;
}
unsafe extern "C" {
    pub static RedisModuleEvent_ReplicaChange: RedisModuleEvent;
}
unsafe extern "C" {
    pub static RedisModuleEvent_CronLoop: RedisModuleEvent;
}
unsafe extern "C" {
    pub static RedisModuleEvent_MasterLinkChange: RedisModuleEvent;
}
unsafe extern "C" {
    pub static RedisModuleEvent_ModuleChange: RedisModuleEvent;
}
unsafe extern "C" {
    pub static RedisModuleEvent_LoadingProgress: RedisModuleEvent;
}
unsafe extern "C" {
    pub static RedisModuleEvent_SwapDB: RedisModuleEvent;
}
unsafe extern "C" {
    pub static RedisModuleEvent_Sharding: RedisModuleEvent;
}
unsafe extern "C" {
    pub static RedisModuleEvent_ReplBackup: RedisModuleEvent;
}
unsafe extern "C" {
    pub static RedisModuleEvent_ReplAsyncLoad: RedisModuleEvent;
}
unsafe extern "C" {
    pub static RedisModuleEvent_ForkChild: RedisModuleEvent;
}
unsafe extern "C" {
    pub static RedisModuleEvent_EventLoop: RedisModuleEvent;
}
unsafe extern "C" {
    pub static RedisModuleEvent_Config: RedisModuleEvent;
}
unsafe extern "C" {
    pub static RedisModuleEvent_Key: RedisModuleEvent;
}
unsafe extern "C" {
    pub static RedisModuleEvent_ClusterSlotMigration: RedisModuleEvent;
}
unsafe extern "C" {
    pub static RedisModuleEvent_ClusterSlotMigrationTrim: RedisModuleEvent;
}
unsafe extern "C" {
    pub static RedisModuleEvent_SSTReplication: RedisModuleEvent;
}
unsafe extern "C" {
    pub static RedisModuleEvent_ServerReady: RedisModuleEvent;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleClientInfo {
    pub version: u64,
    pub flags: u64,
    pub id: u64,
    pub addr: [::std::os::raw::c_char; 46usize],
    pub port: u16,
    pub db: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleClientInfo"][::std::mem::size_of::<RedisModuleClientInfo>() - 80usize];
    ["Alignment of RedisModuleClientInfo"]
        [::std::mem::align_of::<RedisModuleClientInfo>() - 8usize];
    ["Offset of field: RedisModuleClientInfo::version"]
        [::std::mem::offset_of!(RedisModuleClientInfo, version) - 0usize];
    ["Offset of field: RedisModuleClientInfo::flags"]
        [::std::mem::offset_of!(RedisModuleClientInfo, flags) - 8usize];
    ["Offset of field: RedisModuleClientInfo::id"]
        [::std::mem::offset_of!(RedisModuleClientInfo, id) - 16usize];
    ["Offset of field: RedisModuleClientInfo::addr"]
        [::std::mem::offset_of!(RedisModuleClientInfo, addr) - 24usize];
    ["Offset of field: RedisModuleClientInfo::port"]
        [::std::mem::offset_of!(RedisModuleClientInfo, port) - 70usize];
    ["Offset of field: RedisModuleClientInfo::db"]
        [::std::mem::offset_of!(RedisModuleClientInfo, db) - 72usize];
};
pub type RedisModuleClientInfoV1 = RedisModuleClientInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleReplicationInfo {
    pub version: u64,
    pub master: ::std::os::raw::c_int,
    pub masterhost: *mut ::std::os::raw::c_char,
    pub masterport: ::std::os::raw::c_int,
    pub replid1: *mut ::std::os::raw::c_char,
    pub replid2: *mut ::std::os::raw::c_char,
    pub repl1_offset: u64,
    pub repl2_offset: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleReplicationInfo"]
        [::std::mem::size_of::<RedisModuleReplicationInfo>() - 64usize];
    ["Alignment of RedisModuleReplicationInfo"]
        [::std::mem::align_of::<RedisModuleReplicationInfo>() - 8usize];
    ["Offset of field: RedisModuleReplicationInfo::version"]
        [::std::mem::offset_of!(RedisModuleReplicationInfo, version) - 0usize];
    ["Offset of field: RedisModuleReplicationInfo::master"]
        [::std::mem::offset_of!(RedisModuleReplicationInfo, master) - 8usize];
    ["Offset of field: RedisModuleReplicationInfo::masterhost"]
        [::std::mem::offset_of!(RedisModuleReplicationInfo, masterhost) - 16usize];
    ["Offset of field: RedisModuleReplicationInfo::masterport"]
        [::std::mem::offset_of!(RedisModuleReplicationInfo, masterport) - 24usize];
    ["Offset of field: RedisModuleReplicationInfo::replid1"]
        [::std::mem::offset_of!(RedisModuleReplicationInfo, replid1) - 32usize];
    ["Offset of field: RedisModuleReplicationInfo::replid2"]
        [::std::mem::offset_of!(RedisModuleReplicationInfo, replid2) - 40usize];
    ["Offset of field: RedisModuleReplicationInfo::repl1_offset"]
        [::std::mem::offset_of!(RedisModuleReplicationInfo, repl1_offset) - 48usize];
    ["Offset of field: RedisModuleReplicationInfo::repl2_offset"]
        [::std::mem::offset_of!(RedisModuleReplicationInfo, repl2_offset) - 56usize];
};
pub type RedisModuleReplicationInfoV1 = RedisModuleReplicationInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleFlushInfo {
    pub version: u64,
    pub sync: i32,
    pub dbnum: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleFlushInfo"][::std::mem::size_of::<RedisModuleFlushInfo>() - 16usize];
    ["Alignment of RedisModuleFlushInfo"][::std::mem::align_of::<RedisModuleFlushInfo>() - 8usize];
    ["Offset of field: RedisModuleFlushInfo::version"]
        [::std::mem::offset_of!(RedisModuleFlushInfo, version) - 0usize];
    ["Offset of field: RedisModuleFlushInfo::sync"]
        [::std::mem::offset_of!(RedisModuleFlushInfo, sync) - 8usize];
    ["Offset of field: RedisModuleFlushInfo::dbnum"]
        [::std::mem::offset_of!(RedisModuleFlushInfo, dbnum) - 12usize];
};
pub type RedisModuleFlushInfoV1 = RedisModuleFlushInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleModuleChange {
    pub version: u64,
    pub module_name: *const ::std::os::raw::c_char,
    pub module_version: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleModuleChange"][::std::mem::size_of::<RedisModuleModuleChange>() - 24usize];
    ["Alignment of RedisModuleModuleChange"]
        [::std::mem::align_of::<RedisModuleModuleChange>() - 8usize];
    ["Offset of field: RedisModuleModuleChange::version"]
        [::std::mem::offset_of!(RedisModuleModuleChange, version) - 0usize];
    ["Offset of field: RedisModuleModuleChange::module_name"]
        [::std::mem::offset_of!(RedisModuleModuleChange, module_name) - 8usize];
    ["Offset of field: RedisModuleModuleChange::module_version"]
        [::std::mem::offset_of!(RedisModuleModuleChange, module_version) - 16usize];
};
pub type RedisModuleModuleChangeV1 = RedisModuleModuleChange;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleConfigChange {
    pub version: u64,
    pub num_changes: u32,
    pub config_names: *mut *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleConfigChange"][::std::mem::size_of::<RedisModuleConfigChange>() - 24usize];
    ["Alignment of RedisModuleConfigChange"]
        [::std::mem::align_of::<RedisModuleConfigChange>() - 8usize];
    ["Offset of field: RedisModuleConfigChange::version"]
        [::std::mem::offset_of!(RedisModuleConfigChange, version) - 0usize];
    ["Offset of field: RedisModuleConfigChange::num_changes"]
        [::std::mem::offset_of!(RedisModuleConfigChange, num_changes) - 8usize];
    ["Offset of field: RedisModuleConfigChange::config_names"]
        [::std::mem::offset_of!(RedisModuleConfigChange, config_names) - 16usize];
};
pub type RedisModuleConfigChangeV1 = RedisModuleConfigChange;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCronLoopInfo {
    pub version: u64,
    pub hz: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleCronLoopInfo"][::std::mem::size_of::<RedisModuleCronLoopInfo>() - 16usize];
    ["Alignment of RedisModuleCronLoopInfo"]
        [::std::mem::align_of::<RedisModuleCronLoopInfo>() - 8usize];
    ["Offset of field: RedisModuleCronLoopInfo::version"]
        [::std::mem::offset_of!(RedisModuleCronLoopInfo, version) - 0usize];
    ["Offset of field: RedisModuleCronLoopInfo::hz"]
        [::std::mem::offset_of!(RedisModuleCronLoopInfo, hz) - 8usize];
};
pub type RedisModuleCronLoopV1 = RedisModuleCronLoopInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleLoadingProgressInfo {
    pub version: u64,
    pub hz: i32,
    pub progress: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleLoadingProgressInfo"]
        [::std::mem::size_of::<RedisModuleLoadingProgressInfo>() - 16usize];
    ["Alignment of RedisModuleLoadingProgressInfo"]
        [::std::mem::align_of::<RedisModuleLoadingProgressInfo>() - 8usize];
    ["Offset of field: RedisModuleLoadingProgressInfo::version"]
        [::std::mem::offset_of!(RedisModuleLoadingProgressInfo, version) - 0usize];
    ["Offset of field: RedisModuleLoadingProgressInfo::hz"]
        [::std::mem::offset_of!(RedisModuleLoadingProgressInfo, hz) - 8usize];
    ["Offset of field: RedisModuleLoadingProgressInfo::progress"]
        [::std::mem::offset_of!(RedisModuleLoadingProgressInfo, progress) - 12usize];
};
pub type RedisModuleLoadingProgressV1 = RedisModuleLoadingProgressInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleSwapDbInfo {
    pub version: u64,
    pub dbnum_first: i32,
    pub dbnum_second: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleSwapDbInfo"][::std::mem::size_of::<RedisModuleSwapDbInfo>() - 16usize];
    ["Alignment of RedisModuleSwapDbInfo"]
        [::std::mem::align_of::<RedisModuleSwapDbInfo>() - 8usize];
    ["Offset of field: RedisModuleSwapDbInfo::version"]
        [::std::mem::offset_of!(RedisModuleSwapDbInfo, version) - 0usize];
    ["Offset of field: RedisModuleSwapDbInfo::dbnum_first"]
        [::std::mem::offset_of!(RedisModuleSwapDbInfo, dbnum_first) - 8usize];
    ["Offset of field: RedisModuleSwapDbInfo::dbnum_second"]
        [::std::mem::offset_of!(RedisModuleSwapDbInfo, dbnum_second) - 12usize];
};
pub type RedisModuleSwapDbInfoV1 = RedisModuleSwapDbInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleKeyInfo {
    pub version: u64,
    pub key: *mut RedisModuleKey,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleKeyInfo"][::std::mem::size_of::<RedisModuleKeyInfo>() - 16usize];
    ["Alignment of RedisModuleKeyInfo"][::std::mem::align_of::<RedisModuleKeyInfo>() - 8usize];
    ["Offset of field: RedisModuleKeyInfo::version"]
        [::std::mem::offset_of!(RedisModuleKeyInfo, version) - 0usize];
    ["Offset of field: RedisModuleKeyInfo::key"]
        [::std::mem::offset_of!(RedisModuleKeyInfo, key) - 8usize];
};
pub type RedisModuleKeyInfoV1 = RedisModuleKeyInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleSlotRange {
    pub start: u16,
    pub end: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleSlotRange"][::std::mem::size_of::<RedisModuleSlotRange>() - 4usize];
    ["Alignment of RedisModuleSlotRange"][::std::mem::align_of::<RedisModuleSlotRange>() - 2usize];
    ["Offset of field: RedisModuleSlotRange::start"]
        [::std::mem::offset_of!(RedisModuleSlotRange, start) - 0usize];
    ["Offset of field: RedisModuleSlotRange::end"]
        [::std::mem::offset_of!(RedisModuleSlotRange, end) - 2usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct RedisModuleSlotRangeArray {
    pub num_ranges: i32,
    pub ranges: __IncompleteArrayField<RedisModuleSlotRange>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleSlotRangeArray"]
        [::std::mem::size_of::<RedisModuleSlotRangeArray>() - 4usize];
    ["Alignment of RedisModuleSlotRangeArray"]
        [::std::mem::align_of::<RedisModuleSlotRangeArray>() - 4usize];
    ["Offset of field: RedisModuleSlotRangeArray::num_ranges"]
        [::std::mem::offset_of!(RedisModuleSlotRangeArray, num_ranges) - 0usize];
    ["Offset of field: RedisModuleSlotRangeArray::ranges"]
        [::std::mem::offset_of!(RedisModuleSlotRangeArray, ranges) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleClusterSlotMigrationInfo {
    pub version: u64,
    pub source_node_id: [::std::os::raw::c_char; 41usize],
    pub destination_node_id: [::std::os::raw::c_char; 41usize],
    pub task_id: *const ::std::os::raw::c_char,
    pub slots: *mut RedisModuleSlotRangeArray,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleClusterSlotMigrationInfo"]
        [::std::mem::size_of::<RedisModuleClusterSlotMigrationInfo>() - 112usize];
    ["Alignment of RedisModuleClusterSlotMigrationInfo"]
        [::std::mem::align_of::<RedisModuleClusterSlotMigrationInfo>() - 8usize];
    ["Offset of field: RedisModuleClusterSlotMigrationInfo::version"]
        [::std::mem::offset_of!(RedisModuleClusterSlotMigrationInfo, version) - 0usize];
    ["Offset of field: RedisModuleClusterSlotMigrationInfo::source_node_id"]
        [::std::mem::offset_of!(RedisModuleClusterSlotMigrationInfo, source_node_id) - 8usize];
    ["Offset of field: RedisModuleClusterSlotMigrationInfo::destination_node_id"][::std::mem::offset_of!(
        RedisModuleClusterSlotMigrationInfo,
        destination_node_id
    ) - 49usize];
    ["Offset of field: RedisModuleClusterSlotMigrationInfo::task_id"]
        [::std::mem::offset_of!(RedisModuleClusterSlotMigrationInfo, task_id) - 96usize];
    ["Offset of field: RedisModuleClusterSlotMigrationInfo::slots"]
        [::std::mem::offset_of!(RedisModuleClusterSlotMigrationInfo, slots) - 104usize];
};
pub type RedisModuleClusterSlotMigrationInfoV1 = RedisModuleClusterSlotMigrationInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleClusterSlotMigrationTrimInfo {
    pub version: u64,
    pub slots: *mut RedisModuleSlotRangeArray,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleClusterSlotMigrationTrimInfo"]
        [::std::mem::size_of::<RedisModuleClusterSlotMigrationTrimInfo>() - 16usize];
    ["Alignment of RedisModuleClusterSlotMigrationTrimInfo"]
        [::std::mem::align_of::<RedisModuleClusterSlotMigrationTrimInfo>() - 8usize];
    ["Offset of field: RedisModuleClusterSlotMigrationTrimInfo::version"]
        [::std::mem::offset_of!(RedisModuleClusterSlotMigrationTrimInfo, version) - 0usize];
    ["Offset of field: RedisModuleClusterSlotMigrationTrimInfo::slots"]
        [::std::mem::offset_of!(RedisModuleClusterSlotMigrationTrimInfo, slots) - 8usize];
};
pub type RedisModuleClusterSlotMigrationTrimInfoV1 = RedisModuleClusterSlotMigrationTrimInfo;
pub const RedisModuleACLLogEntryReason_REDISMODULE_ACL_LOG_AUTH: RedisModuleACLLogEntryReason = 0;
pub const RedisModuleACLLogEntryReason_REDISMODULE_ACL_LOG_CMD: RedisModuleACLLogEntryReason = 1;
pub const RedisModuleACLLogEntryReason_REDISMODULE_ACL_LOG_KEY: RedisModuleACLLogEntryReason = 2;
pub const RedisModuleACLLogEntryReason_REDISMODULE_ACL_LOG_CHANNEL: RedisModuleACLLogEntryReason =
    3;
pub type RedisModuleACLLogEntryReason = ::std::os::raw::c_uint;
pub const RedisModuleConfigType_REDISMODULE_CONFIG_TYPE_STRING: RedisModuleConfigType = 0;
pub const RedisModuleConfigType_REDISMODULE_CONFIG_TYPE_ENUM: RedisModuleConfigType = 1;
pub const RedisModuleConfigType_REDISMODULE_CONFIG_TYPE_NUMERIC: RedisModuleConfigType = 2;
pub const RedisModuleConfigType_REDISMODULE_CONFIG_TYPE_BOOL: RedisModuleConfigType = 3;
pub type RedisModuleConfigType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleIO {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleDigest {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleInfoCtx {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union RedisModuleHookArg {
    pub cron: RedisModuleHookArg__bindgen_ty_1,
    pub cron_loading: RedisModuleHookArg__bindgen_ty_2,
    pub rdb_aux_save: RedisModuleHookArg__bindgen_ty_3,
    pub rdb_aux_load: RedisModuleHookArg__bindgen_ty_4,
    pub empty_db: RedisModuleHookArg__bindgen_ty_5,
    pub pre_load: RedisModuleHookArg__bindgen_ty_6,
    pub post_load: RedisModuleHookArg__bindgen_ty_7,
    pub del_swap_key: RedisModuleHookArg__bindgen_ty_8,
    pub load_swap_key: RedisModuleHookArg__bindgen_ty_9,
    pub master_mode: RedisModuleHookArg__bindgen_ty_10,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleHookArg__bindgen_ty_1 {
    pub hz: ::std::os::raw::c_int,
    pub cronloops: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleHookArg__bindgen_ty_1"]
        [::std::mem::size_of::<RedisModuleHookArg__bindgen_ty_1>() - 8usize];
    ["Alignment of RedisModuleHookArg__bindgen_ty_1"]
        [::std::mem::align_of::<RedisModuleHookArg__bindgen_ty_1>() - 4usize];
    ["Offset of field: RedisModuleHookArg__bindgen_ty_1::hz"]
        [::std::mem::offset_of!(RedisModuleHookArg__bindgen_ty_1, hz) - 0usize];
    ["Offset of field: RedisModuleHookArg__bindgen_ty_1::cronloops"]
        [::std::mem::offset_of!(RedisModuleHookArg__bindgen_ty_1, cronloops) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleHookArg__bindgen_ty_2 {
    pub hz: ::std::os::raw::c_int,
    pub type_: RedisModuleLoadType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleHookArg__bindgen_ty_2"]
        [::std::mem::size_of::<RedisModuleHookArg__bindgen_ty_2>() - 8usize];
    ["Alignment of RedisModuleHookArg__bindgen_ty_2"]
        [::std::mem::align_of::<RedisModuleHookArg__bindgen_ty_2>() - 4usize];
    ["Offset of field: RedisModuleHookArg__bindgen_ty_2::hz"]
        [::std::mem::offset_of!(RedisModuleHookArg__bindgen_ty_2, hz) - 0usize];
    ["Offset of field: RedisModuleHookArg__bindgen_ty_2::type_"]
        [::std::mem::offset_of!(RedisModuleHookArg__bindgen_ty_2, type_) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleHookArg__bindgen_ty_3 {
    pub io: *mut RedisModuleIO,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleHookArg__bindgen_ty_3"]
        [::std::mem::size_of::<RedisModuleHookArg__bindgen_ty_3>() - 8usize];
    ["Alignment of RedisModuleHookArg__bindgen_ty_3"]
        [::std::mem::align_of::<RedisModuleHookArg__bindgen_ty_3>() - 8usize];
    ["Offset of field: RedisModuleHookArg__bindgen_ty_3::io"]
        [::std::mem::offset_of!(RedisModuleHookArg__bindgen_ty_3, io) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleHookArg__bindgen_ty_4 {
    pub key: *const RedisModuleString,
    pub value: *const RedisModuleString,
    pub error: *mut ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleHookArg__bindgen_ty_4"]
        [::std::mem::size_of::<RedisModuleHookArg__bindgen_ty_4>() - 24usize];
    ["Alignment of RedisModuleHookArg__bindgen_ty_4"]
        [::std::mem::align_of::<RedisModuleHookArg__bindgen_ty_4>() - 8usize];
    ["Offset of field: RedisModuleHookArg__bindgen_ty_4::key"]
        [::std::mem::offset_of!(RedisModuleHookArg__bindgen_ty_4, key) - 0usize];
    ["Offset of field: RedisModuleHookArg__bindgen_ty_4::value"]
        [::std::mem::offset_of!(RedisModuleHookArg__bindgen_ty_4, value) - 8usize];
    ["Offset of field: RedisModuleHookArg__bindgen_ty_4::error"]
        [::std::mem::offset_of!(RedisModuleHookArg__bindgen_ty_4, error) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleHookArg__bindgen_ty_5 {
    pub dbnum: ::std::os::raw::c_int,
    pub async_: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleHookArg__bindgen_ty_5"]
        [::std::mem::size_of::<RedisModuleHookArg__bindgen_ty_5>() - 8usize];
    ["Alignment of RedisModuleHookArg__bindgen_ty_5"]
        [::std::mem::align_of::<RedisModuleHookArg__bindgen_ty_5>() - 4usize];
    ["Offset of field: RedisModuleHookArg__bindgen_ty_5::dbnum"]
        [::std::mem::offset_of!(RedisModuleHookArg__bindgen_ty_5, dbnum) - 0usize];
    ["Offset of field: RedisModuleHookArg__bindgen_ty_5::async_"]
        [::std::mem::offset_of!(RedisModuleHookArg__bindgen_ty_5, async_) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleHookArg__bindgen_ty_6 {
    pub type_: RedisModuleLoadType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleHookArg__bindgen_ty_6"]
        [::std::mem::size_of::<RedisModuleHookArg__bindgen_ty_6>() - 4usize];
    ["Alignment of RedisModuleHookArg__bindgen_ty_6"]
        [::std::mem::align_of::<RedisModuleHookArg__bindgen_ty_6>() - 4usize];
    ["Offset of field: RedisModuleHookArg__bindgen_ty_6::type_"]
        [::std::mem::offset_of!(RedisModuleHookArg__bindgen_ty_6, type_) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleHookArg__bindgen_ty_7 {
    pub type_: RedisModuleLoadType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleHookArg__bindgen_ty_7"]
        [::std::mem::size_of::<RedisModuleHookArg__bindgen_ty_7>() - 4usize];
    ["Alignment of RedisModuleHookArg__bindgen_ty_7"]
        [::std::mem::align_of::<RedisModuleHookArg__bindgen_ty_7>() - 4usize];
    ["Offset of field: RedisModuleHookArg__bindgen_ty_7::type_"]
        [::std::mem::offset_of!(RedisModuleHookArg__bindgen_ty_7, type_) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleHookArg__bindgen_ty_8 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub key: *mut RedisModuleString,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleHookArg__bindgen_ty_8"]
        [::std::mem::size_of::<RedisModuleHookArg__bindgen_ty_8>() - 16usize];
    ["Alignment of RedisModuleHookArg__bindgen_ty_8"]
        [::std::mem::align_of::<RedisModuleHookArg__bindgen_ty_8>() - 8usize];
    ["Offset of field: RedisModuleHookArg__bindgen_ty_8::key"]
        [::std::mem::offset_of!(RedisModuleHookArg__bindgen_ty_8, key) - 8usize];
};
impl RedisModuleHookArg__bindgen_ty_8 {
    #[inline]
    pub fn dbid(&self) -> ::std::os::raw::c_int {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_dbid(&mut self, val: ::std::os::raw::c_int) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn dbid_raw(this: *const Self) -> ::std::os::raw::c_int {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_dbid_raw(this: *mut Self, val: ::std::os::raw::c_int) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn also_in_ram(&self) -> ::std::os::raw::c_int {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_also_in_ram(&mut self, val: ::std::os::raw::c_int) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn also_in_ram_raw(this: *const Self) -> ::std::os::raw::c_int {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_also_in_ram_raw(this: *mut Self, val: ::std::os::raw::c_int) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        dbid: ::std::os::raw::c_int,
        also_in_ram: ::std::os::raw::c_int,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let dbid: u32 = unsafe { ::std::mem::transmute(dbid) };
            dbid as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let also_in_ram: u32 = unsafe { ::std::mem::transmute(also_in_ram) };
            also_in_ram as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleHookArg__bindgen_ty_9 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub key: *mut RedisModuleString,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleHookArg__bindgen_ty_9"]
        [::std::mem::size_of::<RedisModuleHookArg__bindgen_ty_9>() - 16usize];
    ["Alignment of RedisModuleHookArg__bindgen_ty_9"]
        [::std::mem::align_of::<RedisModuleHookArg__bindgen_ty_9>() - 8usize];
    ["Offset of field: RedisModuleHookArg__bindgen_ty_9::key"]
        [::std::mem::offset_of!(RedisModuleHookArg__bindgen_ty_9, key) - 8usize];
};
impl RedisModuleHookArg__bindgen_ty_9 {
    #[inline]
    pub fn dbid(&self) -> ::std::os::raw::c_int {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_dbid(&mut self, val: ::std::os::raw::c_int) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn dbid_raw(this: *const Self) -> ::std::os::raw::c_int {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_dbid_raw(this: *mut Self, val: ::std::os::raw::c_int) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(dbid: ::std::os::raw::c_int) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let dbid: u32 = unsafe { ::std::mem::transmute(dbid) };
            dbid as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleHookArg__bindgen_ty_10 {
    pub enabled: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleHookArg__bindgen_ty_10"]
        [::std::mem::size_of::<RedisModuleHookArg__bindgen_ty_10>() - 4usize];
    ["Alignment of RedisModuleHookArg__bindgen_ty_10"]
        [::std::mem::align_of::<RedisModuleHookArg__bindgen_ty_10>() - 4usize];
    ["Offset of field: RedisModuleHookArg__bindgen_ty_10::enabled"]
        [::std::mem::offset_of!(RedisModuleHookArg__bindgen_ty_10, enabled) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleHookArg"][::std::mem::size_of::<RedisModuleHookArg>() - 24usize];
    ["Alignment of RedisModuleHookArg"][::std::mem::align_of::<RedisModuleHookArg>() - 8usize];
    ["Offset of field: RedisModuleHookArg::cron"]
        [::std::mem::offset_of!(RedisModuleHookArg, cron) - 0usize];
    ["Offset of field: RedisModuleHookArg::cron_loading"]
        [::std::mem::offset_of!(RedisModuleHookArg, cron_loading) - 0usize];
    ["Offset of field: RedisModuleHookArg::rdb_aux_save"]
        [::std::mem::offset_of!(RedisModuleHookArg, rdb_aux_save) - 0usize];
    ["Offset of field: RedisModuleHookArg::rdb_aux_load"]
        [::std::mem::offset_of!(RedisModuleHookArg, rdb_aux_load) - 0usize];
    ["Offset of field: RedisModuleHookArg::empty_db"]
        [::std::mem::offset_of!(RedisModuleHookArg, empty_db) - 0usize];
    ["Offset of field: RedisModuleHookArg::pre_load"]
        [::std::mem::offset_of!(RedisModuleHookArg, pre_load) - 0usize];
    ["Offset of field: RedisModuleHookArg::post_load"]
        [::std::mem::offset_of!(RedisModuleHookArg, post_load) - 0usize];
    ["Offset of field: RedisModuleHookArg::del_swap_key"]
        [::std::mem::offset_of!(RedisModuleHookArg, del_swap_key) - 0usize];
    ["Offset of field: RedisModuleHookArg::load_swap_key"]
        [::std::mem::offset_of!(RedisModuleHookArg, load_swap_key) - 0usize];
    ["Offset of field: RedisModuleHookArg::master_mode"]
        [::std::mem::offset_of!(RedisModuleHookArg, master_mode) - 0usize];
};
pub type RedisModuleInfoFunc = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut RedisModuleInfoCtx, for_crash_report: ::std::os::raw::c_int),
>;
pub type RedisModuleDefragFunc =
    ::std::option::Option<unsafe extern "C" fn(ctx: *mut RedisModuleDefragCtx)>;
pub type RedisModuleDefragFunc2 = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut RedisModuleDefragCtx) -> ::std::os::raw::c_int,
>;
pub type RedisModuleUserChangedFunc = ::std::option::Option<
    unsafe extern "C" fn(client_id: u64, privdata: *mut ::std::os::raw::c_void),
>;
pub type RedisModuleHookFunc = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        arg: *mut RedisModuleHookArg,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModulePreCommandFunc = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        argv: *mut *mut RedisModuleString,
        argc: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type RedisModulePostCommandFunc = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        argv: *mut *mut RedisModuleString,
        argc: ::std::os::raw::c_int,
        privdata: *mut ::std::os::raw::c_void,
    ),
>;
pub type RedisModuleDefragDictValueCallback = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleDefragCtx,
        data: *mut ::std::os::raw::c_void,
        key: *mut ::std::os::raw::c_uchar,
        keylen: usize,
        newptr: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCommand {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCallReply {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleType {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleBlockedClient {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleClusterInfo {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleDict {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleDictIter {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCommandFilterCtx {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleCommandFilter {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleServerInfoData {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleScanCursor {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleUser {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleKeyOptCtx {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleRdbStream {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleConfigIterator {
    _unused: [u8; 0],
}
pub type RedisModuleCmdFunc = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        argv: *mut *mut RedisModuleString,
        argc: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleDisconnectFunc = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut RedisModuleCtx, bc: *mut RedisModuleBlockedClient),
>;
pub type RedisModuleNotificationFunc = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        type_: ::std::os::raw::c_int,
        event: *const ::std::os::raw::c_char,
        key: *mut RedisModuleString,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModulePostNotificationJobFunc = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut RedisModuleCtx, pd: *mut ::std::os::raw::c_void),
>;
pub type RedisModuleTypeLoadFunc = ::std::option::Option<
    unsafe extern "C" fn(
        rdb: *mut RedisModuleIO,
        encver: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type RedisModuleTypeSaveFunc = ::std::option::Option<
    unsafe extern "C" fn(rdb: *mut RedisModuleIO, value: *mut ::std::os::raw::c_void),
>;
pub type RedisModuleTypeAuxLoadFunc = ::std::option::Option<
    unsafe extern "C" fn(
        rdb: *mut RedisModuleIO,
        encver: ::std::os::raw::c_int,
        when: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleTypeAuxSaveFunc = ::std::option::Option<
    unsafe extern "C" fn(rdb: *mut RedisModuleIO, when: ::std::os::raw::c_int),
>;
pub type RedisModuleTypeRewriteFunc = ::std::option::Option<
    unsafe extern "C" fn(
        aof: *mut RedisModuleIO,
        key: *mut RedisModuleString,
        value: *mut ::std::os::raw::c_void,
    ),
>;
pub type RedisModuleTypeMemUsageFunc =
    ::std::option::Option<unsafe extern "C" fn(value: *const ::std::os::raw::c_void) -> usize>;
pub type RedisModuleTypeMemUsageFunc2 = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleKeyOptCtx,
        value: *const ::std::os::raw::c_void,
        sample_size: usize,
    ) -> usize,
>;
pub type RedisModuleTypeDigestFunc = ::std::option::Option<
    unsafe extern "C" fn(digest: *mut RedisModuleDigest, value: *mut ::std::os::raw::c_void),
>;
pub type RedisModuleTypeFreeFunc =
    ::std::option::Option<unsafe extern "C" fn(value: *mut ::std::os::raw::c_void)>;
pub type RedisModuleTypeFreeEffortFunc = ::std::option::Option<
    unsafe extern "C" fn(
        key: *mut RedisModuleString,
        value: *const ::std::os::raw::c_void,
    ) -> usize,
>;
pub type RedisModuleTypeFreeEffortFunc2 = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleKeyOptCtx,
        value: *const ::std::os::raw::c_void,
    ) -> usize,
>;
pub type RedisModuleTypeUnlinkFunc = ::std::option::Option<
    unsafe extern "C" fn(key: *mut RedisModuleString, value: *const ::std::os::raw::c_void),
>;
pub type RedisModuleTypeUnlinkFunc2 = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut RedisModuleKeyOptCtx, value: *const ::std::os::raw::c_void),
>;
pub type RedisModuleTypeCopyFunc = ::std::option::Option<
    unsafe extern "C" fn(
        fromkey: *mut RedisModuleString,
        tokey: *mut RedisModuleString,
        value: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type RedisModuleTypeCopyFunc2 = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleKeyOptCtx,
        value: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type RedisModuleTypeDefragFunc = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleDefragCtx,
        key: *mut RedisModuleString,
        value: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleClusterMessageReceiver = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        sender_id: *const ::std::os::raw::c_char,
        type_: u8,
        payload: *const ::std::os::raw::c_uchar,
        len: u32,
    ),
>;
pub type RedisModuleTimerProc = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut RedisModuleCtx, data: *mut ::std::os::raw::c_void),
>;
pub type RedisModuleCommandFilterFunc =
    ::std::option::Option<unsafe extern "C" fn(filter: *mut RedisModuleCommandFilterCtx)>;
pub type RedisModuleAppendOnlySyncCallback = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        privdata: *mut ::std::os::raw::c_void,
        aborted: ::std::os::raw::c_int,
    ),
>;
pub type RedisModuleForkDoneHandler = ::std::option::Option<
    unsafe extern "C" fn(
        exitcode: ::std::os::raw::c_int,
        bysignal: ::std::os::raw::c_int,
        user_data: *mut ::std::os::raw::c_void,
    ),
>;
pub type RedisModuleScanCB = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        keyname: *mut RedisModuleString,
        key: *mut RedisModuleKey,
        privdata: *mut ::std::os::raw::c_void,
    ),
>;
pub type RedisModuleScanKeyCB = ::std::option::Option<
    unsafe extern "C" fn(
        key: *mut RedisModuleKey,
        field: *mut RedisModuleString,
        value: *mut RedisModuleString,
        privdata: *mut ::std::os::raw::c_void,
    ),
>;
pub type RedisModuleConfigGetStringFunc = ::std::option::Option<
    unsafe extern "C" fn(
        name: *const ::std::os::raw::c_char,
        privdata: *mut ::std::os::raw::c_void,
    ) -> *mut RedisModuleString,
>;
pub type RedisModuleConfigGetNumericFunc = ::std::option::Option<
    unsafe extern "C" fn(
        name: *const ::std::os::raw::c_char,
        privdata: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_longlong,
>;
pub type RedisModuleConfigGetBoolFunc = ::std::option::Option<
    unsafe extern "C" fn(
        name: *const ::std::os::raw::c_char,
        privdata: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleConfigGetEnumFunc = ::std::option::Option<
    unsafe extern "C" fn(
        name: *const ::std::os::raw::c_char,
        privdata: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleConfigSetStringFunc = ::std::option::Option<
    unsafe extern "C" fn(
        name: *const ::std::os::raw::c_char,
        val: *mut RedisModuleString,
        privdata: *mut ::std::os::raw::c_void,
        err: *mut *mut RedisModuleString,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleConfigSetNumericFunc = ::std::option::Option<
    unsafe extern "C" fn(
        name: *const ::std::os::raw::c_char,
        val: ::std::os::raw::c_longlong,
        privdata: *mut ::std::os::raw::c_void,
        err: *mut *mut RedisModuleString,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleConfigSetBoolFunc = ::std::option::Option<
    unsafe extern "C" fn(
        name: *const ::std::os::raw::c_char,
        val: ::std::os::raw::c_int,
        privdata: *mut ::std::os::raw::c_void,
        err: *mut *mut RedisModuleString,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleConfigSetEnumFunc = ::std::option::Option<
    unsafe extern "C" fn(
        name: *const ::std::os::raw::c_char,
        val: ::std::os::raw::c_int,
        privdata: *mut ::std::os::raw::c_void,
        err: *mut *mut RedisModuleString,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleConfigApplyFunc = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        privdata: *mut ::std::os::raw::c_void,
        err: *mut *mut RedisModuleString,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleOnUnblocked = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        reply: *mut RedisModuleCallReply,
        private_data: *mut ::std::os::raw::c_void,
    ),
>;
pub type RedisModuleAuthCallback = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        username: *mut RedisModuleString,
        password: *mut RedisModuleString,
        err: *mut *mut RedisModuleString,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleKeyMetaLoadFunc = ::std::option::Option<
    unsafe extern "C" fn(
        rdb: *mut RedisModuleIO,
        meta: *mut u64,
        encver: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleKeyMetaSaveFunc = ::std::option::Option<
    unsafe extern "C" fn(
        rdb: *mut RedisModuleIO,
        value: *mut ::std::os::raw::c_void,
        meta: *mut u64,
    ),
>;
pub type RedisModuleKeyMetaAOFRewriteFunc = ::std::option::Option<
    unsafe extern "C" fn(aof: *mut RedisModuleIO, value: *mut ::std::os::raw::c_void, meta: u64),
>;
pub type RedisModuleKeyMetaFreeFunc =
    ::std::option::Option<unsafe extern "C" fn(keyname: *const ::std::os::raw::c_char, meta: u64)>;
pub type RedisModuleKeyMetaCopyFunc = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut RedisModuleKeyOptCtx, meta: *mut u64) -> ::std::os::raw::c_int,
>;
pub type RedisModuleKeyMetaRenameFunc = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut RedisModuleKeyOptCtx, meta: *mut u64) -> ::std::os::raw::c_int,
>;
pub type RedisModuleKeyMetaDefragFunc = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleDefragCtx,
        keyname: *mut RedisModuleString,
        meta: u64,
    ) -> ::std::os::raw::c_int,
>;
pub type RedisModuleKeyMetaMemUsageFunc = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut RedisModuleKeyOptCtx, sample_size: usize, meta: u64) -> usize,
>;
pub type RedisModuleKeyMetaFreeEffortFunc =
    ::std::option::Option<unsafe extern "C" fn(ctx: *mut RedisModuleKeyOptCtx, meta: u64) -> usize>;
pub type RedisModuleKeyMetaUnlinkFunc =
    ::std::option::Option<unsafe extern "C" fn(ctx: *mut RedisModuleKeyOptCtx, meta: *mut u64)>;
pub type RedisModuleKeyMetaMoveFunc = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut RedisModuleKeyOptCtx, meta: *mut u64) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleTypeMethods {
    pub version: u64,
    pub rdb_load: RedisModuleTypeLoadFunc,
    pub rdb_save: RedisModuleTypeSaveFunc,
    pub aof_rewrite: RedisModuleTypeRewriteFunc,
    pub mem_usage: RedisModuleTypeMemUsageFunc,
    pub digest: RedisModuleTypeDigestFunc,
    pub free: RedisModuleTypeFreeFunc,
    pub aux_load: RedisModuleTypeAuxLoadFunc,
    pub aux_save: RedisModuleTypeAuxSaveFunc,
    pub aux_save_triggers: ::std::os::raw::c_int,
    pub free_effort: RedisModuleTypeFreeEffortFunc,
    pub unlink: RedisModuleTypeUnlinkFunc,
    pub copy: RedisModuleTypeCopyFunc,
    pub defrag: RedisModuleTypeDefragFunc,
    pub mem_usage2: RedisModuleTypeMemUsageFunc2,
    pub free_effort2: RedisModuleTypeFreeEffortFunc2,
    pub unlink2: RedisModuleTypeUnlinkFunc2,
    pub copy2: RedisModuleTypeCopyFunc2,
    pub aux_save2: RedisModuleTypeAuxSaveFunc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleTypeMethods"][::std::mem::size_of::<RedisModuleTypeMethods>() - 152usize];
    ["Alignment of RedisModuleTypeMethods"]
        [::std::mem::align_of::<RedisModuleTypeMethods>() - 8usize];
    ["Offset of field: RedisModuleTypeMethods::version"]
        [::std::mem::offset_of!(RedisModuleTypeMethods, version) - 0usize];
    ["Offset of field: RedisModuleTypeMethods::rdb_load"]
        [::std::mem::offset_of!(RedisModuleTypeMethods, rdb_load) - 8usize];
    ["Offset of field: RedisModuleTypeMethods::rdb_save"]
        [::std::mem::offset_of!(RedisModuleTypeMethods, rdb_save) - 16usize];
    ["Offset of field: RedisModuleTypeMethods::aof_rewrite"]
        [::std::mem::offset_of!(RedisModuleTypeMethods, aof_rewrite) - 24usize];
    ["Offset of field: RedisModuleTypeMethods::mem_usage"]
        [::std::mem::offset_of!(RedisModuleTypeMethods, mem_usage) - 32usize];
    ["Offset of field: RedisModuleTypeMethods::digest"]
        [::std::mem::offset_of!(RedisModuleTypeMethods, digest) - 40usize];
    ["Offset of field: RedisModuleTypeMethods::free"]
        [::std::mem::offset_of!(RedisModuleTypeMethods, free) - 48usize];
    ["Offset of field: RedisModuleTypeMethods::aux_load"]
        [::std::mem::offset_of!(RedisModuleTypeMethods, aux_load) - 56usize];
    ["Offset of field: RedisModuleTypeMethods::aux_save"]
        [::std::mem::offset_of!(RedisModuleTypeMethods, aux_save) - 64usize];
    ["Offset of field: RedisModuleTypeMethods::aux_save_triggers"]
        [::std::mem::offset_of!(RedisModuleTypeMethods, aux_save_triggers) - 72usize];
    ["Offset of field: RedisModuleTypeMethods::free_effort"]
        [::std::mem::offset_of!(RedisModuleTypeMethods, free_effort) - 80usize];
    ["Offset of field: RedisModuleTypeMethods::unlink"]
        [::std::mem::offset_of!(RedisModuleTypeMethods, unlink) - 88usize];
    ["Offset of field: RedisModuleTypeMethods::copy"]
        [::std::mem::offset_of!(RedisModuleTypeMethods, copy) - 96usize];
    ["Offset of field: RedisModuleTypeMethods::defrag"]
        [::std::mem::offset_of!(RedisModuleTypeMethods, defrag) - 104usize];
    ["Offset of field: RedisModuleTypeMethods::mem_usage2"]
        [::std::mem::offset_of!(RedisModuleTypeMethods, mem_usage2) - 112usize];
    ["Offset of field: RedisModuleTypeMethods::free_effort2"]
        [::std::mem::offset_of!(RedisModuleTypeMethods, free_effort2) - 120usize];
    ["Offset of field: RedisModuleTypeMethods::unlink2"]
        [::std::mem::offset_of!(RedisModuleTypeMethods, unlink2) - 128usize];
    ["Offset of field: RedisModuleTypeMethods::copy2"]
        [::std::mem::offset_of!(RedisModuleTypeMethods, copy2) - 136usize];
    ["Offset of field: RedisModuleTypeMethods::aux_save2"]
        [::std::mem::offset_of!(RedisModuleTypeMethods, aux_save2) - 144usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleKeyMetaClassConfig {
    pub version: u64,
    pub flags: u64,
    pub reset_value: u64,
    pub copy: RedisModuleKeyMetaCopyFunc,
    pub rename: RedisModuleKeyMetaRenameFunc,
    pub move_: RedisModuleKeyMetaMoveFunc,
    pub unlink: RedisModuleKeyMetaUnlinkFunc,
    pub free: RedisModuleKeyMetaFreeFunc,
    pub rdb_load: RedisModuleKeyMetaLoadFunc,
    pub rdb_save: RedisModuleKeyMetaSaveFunc,
    pub aof_rewrite: RedisModuleKeyMetaAOFRewriteFunc,
    pub defrag: RedisModuleKeyMetaDefragFunc,
    pub mem_usage: RedisModuleKeyMetaMemUsageFunc,
    pub free_effort: RedisModuleKeyMetaFreeEffortFunc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleKeyMetaClassConfig"]
        [::std::mem::size_of::<RedisModuleKeyMetaClassConfig>() - 112usize];
    ["Alignment of RedisModuleKeyMetaClassConfig"]
        [::std::mem::align_of::<RedisModuleKeyMetaClassConfig>() - 8usize];
    ["Offset of field: RedisModuleKeyMetaClassConfig::version"]
        [::std::mem::offset_of!(RedisModuleKeyMetaClassConfig, version) - 0usize];
    ["Offset of field: RedisModuleKeyMetaClassConfig::flags"]
        [::std::mem::offset_of!(RedisModuleKeyMetaClassConfig, flags) - 8usize];
    ["Offset of field: RedisModuleKeyMetaClassConfig::reset_value"]
        [::std::mem::offset_of!(RedisModuleKeyMetaClassConfig, reset_value) - 16usize];
    ["Offset of field: RedisModuleKeyMetaClassConfig::copy"]
        [::std::mem::offset_of!(RedisModuleKeyMetaClassConfig, copy) - 24usize];
    ["Offset of field: RedisModuleKeyMetaClassConfig::rename"]
        [::std::mem::offset_of!(RedisModuleKeyMetaClassConfig, rename) - 32usize];
    ["Offset of field: RedisModuleKeyMetaClassConfig::move_"]
        [::std::mem::offset_of!(RedisModuleKeyMetaClassConfig, move_) - 40usize];
    ["Offset of field: RedisModuleKeyMetaClassConfig::unlink"]
        [::std::mem::offset_of!(RedisModuleKeyMetaClassConfig, unlink) - 48usize];
    ["Offset of field: RedisModuleKeyMetaClassConfig::free"]
        [::std::mem::offset_of!(RedisModuleKeyMetaClassConfig, free) - 56usize];
    ["Offset of field: RedisModuleKeyMetaClassConfig::rdb_load"]
        [::std::mem::offset_of!(RedisModuleKeyMetaClassConfig, rdb_load) - 64usize];
    ["Offset of field: RedisModuleKeyMetaClassConfig::rdb_save"]
        [::std::mem::offset_of!(RedisModuleKeyMetaClassConfig, rdb_save) - 72usize];
    ["Offset of field: RedisModuleKeyMetaClassConfig::aof_rewrite"]
        [::std::mem::offset_of!(RedisModuleKeyMetaClassConfig, aof_rewrite) - 80usize];
    ["Offset of field: RedisModuleKeyMetaClassConfig::defrag"]
        [::std::mem::offset_of!(RedisModuleKeyMetaClassConfig, defrag) - 88usize];
    ["Offset of field: RedisModuleKeyMetaClassConfig::mem_usage"]
        [::std::mem::offset_of!(RedisModuleKeyMetaClassConfig, mem_usage) - 96usize];
    ["Offset of field: RedisModuleKeyMetaClassConfig::free_effort"]
        [::std::mem::offset_of!(RedisModuleKeyMetaClassConfig, free_effort) - 104usize];
};
unsafe extern "C" {
    pub static mut RedisModule_Alloc:
        ::std::option::Option<unsafe extern "C" fn(bytes: usize) -> *mut ::std::os::raw::c_void>;
}
unsafe extern "C" {
    pub static mut RedisModule_TryAlloc:
        ::std::option::Option<unsafe extern "C" fn(bytes: usize) -> *mut ::std::os::raw::c_void>;
}
unsafe extern "C" {
    pub static mut RedisModule_Realloc: ::std::option::Option<
        unsafe extern "C" fn(
            ptr: *mut ::std::os::raw::c_void,
            bytes: usize,
        ) -> *mut ::std::os::raw::c_void,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_TryRealloc: ::std::option::Option<
        unsafe extern "C" fn(
            ptr: *mut ::std::os::raw::c_void,
            bytes: usize,
        ) -> *mut ::std::os::raw::c_void,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_Free:
        ::std::option::Option<unsafe extern "C" fn(ptr: *mut ::std::os::raw::c_void)>;
}
unsafe extern "C" {
    pub static mut RedisModule_Calloc: ::std::option::Option<
        unsafe extern "C" fn(nmemb: usize, size: usize) -> *mut ::std::os::raw::c_void,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_TryCalloc: ::std::option::Option<
        unsafe extern "C" fn(nmemb: usize, size: usize) -> *mut ::std::os::raw::c_void,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_Strdup: ::std::option::Option<
        unsafe extern "C" fn(str_: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetApi: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::std::os::raw::c_char,
            arg2: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CreateCommand: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            name: *const ::std::os::raw::c_char,
            cmdfunc: RedisModuleCmdFunc,
            strflags: *const ::std::os::raw::c_char,
            firstkey: ::std::os::raw::c_int,
            lastkey: ::std::os::raw::c_int,
            keystep: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetCommand: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            name: *const ::std::os::raw::c_char,
        ) -> *mut RedisModuleCommand,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CreateSubcommand: ::std::option::Option<
        unsafe extern "C" fn(
            parent: *mut RedisModuleCommand,
            name: *const ::std::os::raw::c_char,
            cmdfunc: RedisModuleCmdFunc,
            strflags: *const ::std::os::raw::c_char,
            firstkey: ::std::os::raw::c_int,
            lastkey: ::std::os::raw::c_int,
            keystep: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_SetCommandInfo: ::std::option::Option<
        unsafe extern "C" fn(
            command: *mut RedisModuleCommand,
            info: *const RedisModuleCommandInfo,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_SetCommandACLCategories: ::std::option::Option<
        unsafe extern "C" fn(
            command: *mut RedisModuleCommand,
            ctgrsflags: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_AddACLCategory: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            name: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_SetModuleAttribs: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            name: *const ::std::os::raw::c_char,
            ver: ::std::os::raw::c_int,
            apiver: ::std::os::raw::c_int,
        ),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_IsModuleNameBusy: ::std::option::Option<
        unsafe extern "C" fn(name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_WrongArity: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplyWithLongLong: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            ll: ::std::os::raw::c_longlong,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetSelectedDb: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_SelectDb: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            newid: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_KeyExists: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            keyname: *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_OpenKey: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            keyname: *mut RedisModuleString,
            mode: ::std::os::raw::c_int,
        ) -> *mut RedisModuleKey,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetOpenKeyModesAll:
        ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
}
unsafe extern "C" {
    pub static mut RedisModule_CloseKey:
        ::std::option::Option<unsafe extern "C" fn(kp: *mut RedisModuleKey)>;
}
unsafe extern "C" {
    pub static mut RedisModule_KeyType: ::std::option::Option<
        unsafe extern "C" fn(kp: *mut RedisModuleKey) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ValueLength:
        ::std::option::Option<unsafe extern "C" fn(kp: *mut RedisModuleKey) -> usize>;
}
unsafe extern "C" {
    pub static mut RedisModule_ListPush: ::std::option::Option<
        unsafe extern "C" fn(
            kp: *mut RedisModuleKey,
            where_: ::std::os::raw::c_int,
            ele: *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ListPop: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            where_: ::std::os::raw::c_int,
        ) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ListGet: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            index: ::std::os::raw::c_long,
        ) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ListSet: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            index: ::std::os::raw::c_long,
            value: *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ListInsert: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            index: ::std::os::raw::c_long,
            value: *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ListDelete: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            index: ::std::os::raw::c_long,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_Call: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            cmdname: *const ::std::os::raw::c_char,
            fmt: *const ::std::os::raw::c_char,
            ...
        ) -> *mut RedisModuleCallReply,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CallReplyProto: ::std::option::Option<
        unsafe extern "C" fn(
            reply: *mut RedisModuleCallReply,
            len: *mut usize,
        ) -> *const ::std::os::raw::c_char,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_FreeCallReply:
        ::std::option::Option<unsafe extern "C" fn(reply: *mut RedisModuleCallReply)>;
}
unsafe extern "C" {
    pub static mut RedisModule_CallReplyType: ::std::option::Option<
        unsafe extern "C" fn(reply: *mut RedisModuleCallReply) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CallReplyInteger: ::std::option::Option<
        unsafe extern "C" fn(reply: *mut RedisModuleCallReply) -> ::std::os::raw::c_longlong,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CallReplyDouble:
        ::std::option::Option<unsafe extern "C" fn(reply: *mut RedisModuleCallReply) -> f64>;
}
unsafe extern "C" {
    pub static mut RedisModule_CallReplyBool: ::std::option::Option<
        unsafe extern "C" fn(reply: *mut RedisModuleCallReply) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CallReplyBigNumber: ::std::option::Option<
        unsafe extern "C" fn(
            reply: *mut RedisModuleCallReply,
            len: *mut usize,
        ) -> *const ::std::os::raw::c_char,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CallReplyVerbatim: ::std::option::Option<
        unsafe extern "C" fn(
            reply: *mut RedisModuleCallReply,
            len: *mut usize,
            format: *mut *const ::std::os::raw::c_char,
        ) -> *const ::std::os::raw::c_char,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CallReplySetElement: ::std::option::Option<
        unsafe extern "C" fn(
            reply: *mut RedisModuleCallReply,
            idx: usize,
        ) -> *mut RedisModuleCallReply,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CallReplyMapElement: ::std::option::Option<
        unsafe extern "C" fn(
            reply: *mut RedisModuleCallReply,
            idx: usize,
            key: *mut *mut RedisModuleCallReply,
            val: *mut *mut RedisModuleCallReply,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CallReplyAttributeElement: ::std::option::Option<
        unsafe extern "C" fn(
            reply: *mut RedisModuleCallReply,
            idx: usize,
            key: *mut *mut RedisModuleCallReply,
            val: *mut *mut RedisModuleCallReply,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CallReplyPromiseSetUnblockHandler: ::std::option::Option<
        unsafe extern "C" fn(
            reply: *mut RedisModuleCallReply,
            on_unblock: RedisModuleOnUnblocked,
            private_data: *mut ::std::os::raw::c_void,
        ),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CallReplyPromiseAbort: ::std::option::Option<
        unsafe extern "C" fn(
            reply: *mut RedisModuleCallReply,
            private_data: *mut *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CallReplyAttribute: ::std::option::Option<
        unsafe extern "C" fn(reply: *mut RedisModuleCallReply) -> *mut RedisModuleCallReply,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CallReplyLength:
        ::std::option::Option<unsafe extern "C" fn(reply: *mut RedisModuleCallReply) -> usize>;
}
unsafe extern "C" {
    pub static mut RedisModule_CallReplyArrayElement: ::std::option::Option<
        unsafe extern "C" fn(
            reply: *mut RedisModuleCallReply,
            idx: usize,
        ) -> *mut RedisModuleCallReply,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CreateString: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            ptr: *const ::std::os::raw::c_char,
            len: usize,
        ) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CreateStringFromLongLong: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            ll: ::std::os::raw::c_longlong,
        ) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CreateStringFromULongLong: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            ull: ::std::os::raw::c_ulonglong,
        ) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CreateStringFromDouble: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, d: f64) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CreateStringFromLongDouble: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            ld: f64,
            humanfriendly: ::std::os::raw::c_int,
        ) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CreateStringFromString: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            str_: *const RedisModuleString,
        ) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CreateStringFromStreamID: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            id: *const RedisModuleStreamID,
        ) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CreateStringPrintf: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            fmt: *const ::std::os::raw::c_char,
            ...
        ) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_FreeString: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, str_: *mut RedisModuleString),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_StringPtrLen: ::std::option::Option<
        unsafe extern "C" fn(
            str_: *const RedisModuleString,
            len: *mut usize,
        ) -> *const ::std::os::raw::c_char,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplyWithError: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            err: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplyWithErrorFormat: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            fmt: *const ::std::os::raw::c_char,
            ...
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplyWithSimpleString: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            msg: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplyWithPostponedResponse: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplyWithArray: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            len: ::std::os::raw::c_long,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplyWithMap: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            len: ::std::os::raw::c_long,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplyWithSet: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            len: ::std::os::raw::c_long,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplyWithAttribute: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            len: ::std::os::raw::c_long,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplyWithNullArray: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplyWithEmptyArray: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplySetArrayLength: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, len: ::std::os::raw::c_long),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplySetPostponedResponseString: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, str_: *mut RedisModuleString),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplySetMapLength: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, len: ::std::os::raw::c_long),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplySetSetLength: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, len: ::std::os::raw::c_long),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplySetAttributeLength: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, len: ::std::os::raw::c_long),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplySetPushLength: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, len: ::std::os::raw::c_long),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplyWithStringBuffer: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            buf: *const ::std::os::raw::c_char,
            len: usize,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplyWithCString: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            buf: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplyWithString: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            str_: *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplyWithEmptyString: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplyWithVerbatimString: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            buf: *const ::std::os::raw::c_char,
            len: usize,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplyWithVerbatimStringType: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            buf: *const ::std::os::raw::c_char,
            len: usize,
            ext: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplyWithNull: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplyWithBool: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            b: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplyWithLongDouble: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, d: f64) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplyWithDouble: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, d: f64) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplyWithBigNumber: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            bignum: *const ::std::os::raw::c_char,
            len: usize,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplyWithCallReply: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            reply: *mut RedisModuleCallReply,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_StringToLongLong: ::std::option::Option<
        unsafe extern "C" fn(
            str_: *const RedisModuleString,
            ll: *mut ::std::os::raw::c_longlong,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_StringToULongLong: ::std::option::Option<
        unsafe extern "C" fn(
            str_: *const RedisModuleString,
            ull: *mut ::std::os::raw::c_ulonglong,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_StringToDouble: ::std::option::Option<
        unsafe extern "C" fn(str_: *const RedisModuleString, d: *mut f64) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_StringToLongDouble: ::std::option::Option<
        unsafe extern "C" fn(str_: *const RedisModuleString, d: *mut f64) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_StringToStreamID: ::std::option::Option<
        unsafe extern "C" fn(
            str_: *const RedisModuleString,
            id: *mut RedisModuleStreamID,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_AutoMemory:
        ::std::option::Option<unsafe extern "C" fn(ctx: *mut RedisModuleCtx)>;
}
unsafe extern "C" {
    pub static mut RedisModule_Replicate: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            cmdname: *const ::std::os::raw::c_char,
            fmt: *const ::std::os::raw::c_char,
            ...
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplicateVerbatim: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CallReplyStringPtr: ::std::option::Option<
        unsafe extern "C" fn(
            reply: *mut RedisModuleCallReply,
            len: *mut usize,
        ) -> *const ::std::os::raw::c_char,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CreateStringFromCallReply: ::std::option::Option<
        unsafe extern "C" fn(reply: *mut RedisModuleCallReply) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DeleteKey: ::std::option::Option<
        unsafe extern "C" fn(key: *mut RedisModuleKey) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_UnlinkKey: ::std::option::Option<
        unsafe extern "C" fn(key: *mut RedisModuleKey) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_StringSet: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            str_: *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_StringDMA: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            len: *mut usize,
            mode: ::std::os::raw::c_int,
        ) -> *mut ::std::os::raw::c_char,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_StringTruncate: ::std::option::Option<
        unsafe extern "C" fn(key: *mut RedisModuleKey, newlen: usize) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetExpire:
        ::std::option::Option<unsafe extern "C" fn(key: *mut RedisModuleKey) -> mstime_t>;
}
unsafe extern "C" {
    pub static mut RedisModule_SetExpire: ::std::option::Option<
        unsafe extern "C" fn(key: *mut RedisModuleKey, expire: mstime_t) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetAbsExpire:
        ::std::option::Option<unsafe extern "C" fn(key: *mut RedisModuleKey) -> mstime_t>;
}
unsafe extern "C" {
    pub static mut RedisModule_SetAbsExpire: ::std::option::Option<
        unsafe extern "C" fn(key: *mut RedisModuleKey, expire: mstime_t) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ResetDataset: ::std::option::Option<
        unsafe extern "C" fn(restart_aof: ::std::os::raw::c_int, async_: ::std::os::raw::c_int),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DbSize: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_ulonglong,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DbSizeById: ::std::option::Option<
        unsafe extern "C" fn(dbid: ::std::os::raw::c_int) -> ::std::os::raw::c_ulonglong,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_RandomKey: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ZsetAdd: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            score: f64,
            ele: *mut RedisModuleString,
            flagsptr: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ZsetIncrby: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            score: f64,
            ele: *mut RedisModuleString,
            flagsptr: *mut ::std::os::raw::c_int,
            newscore: *mut f64,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ZsetScore: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            ele: *mut RedisModuleString,
            score: *mut f64,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ZsetRem: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            ele: *mut RedisModuleString,
            deleted: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ZsetRangeStop:
        ::std::option::Option<unsafe extern "C" fn(key: *mut RedisModuleKey)>;
}
unsafe extern "C" {
    pub static mut RedisModule_ZsetFirstInScoreRange: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            min: f64,
            max: f64,
            minex: ::std::os::raw::c_int,
            maxex: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ZsetLastInScoreRange: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            min: f64,
            max: f64,
            minex: ::std::os::raw::c_int,
            maxex: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ZsetFirstInLexRange: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            min: *mut RedisModuleString,
            max: *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ZsetLastInLexRange: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            min: *mut RedisModuleString,
            max: *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ZsetRangeCurrentElement: ::std::option::Option<
        unsafe extern "C" fn(key: *mut RedisModuleKey, score: *mut f64) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ZsetRangeNext: ::std::option::Option<
        unsafe extern "C" fn(key: *mut RedisModuleKey) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ZsetRangePrev: ::std::option::Option<
        unsafe extern "C" fn(key: *mut RedisModuleKey) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ZsetRangeEndReached: ::std::option::Option<
        unsafe extern "C" fn(key: *mut RedisModuleKey) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_HashSet: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            flags: ::std::os::raw::c_int,
            ...
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_HashGet: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            flags: ::std::os::raw::c_int,
            ...
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_HashFieldMinExpire:
        ::std::option::Option<unsafe extern "C" fn(key: *mut RedisModuleKey) -> mstime_t>;
}
unsafe extern "C" {
    pub static mut RedisModule_StreamAdd: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            flags: ::std::os::raw::c_int,
            id: *mut RedisModuleStreamID,
            argv: *mut *mut RedisModuleString,
            numfields: i64,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_StreamDelete: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            id: *mut RedisModuleStreamID,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_StreamIteratorStart: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            flags: ::std::os::raw::c_int,
            startid: *mut RedisModuleStreamID,
            endid: *mut RedisModuleStreamID,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_StreamIteratorStop: ::std::option::Option<
        unsafe extern "C" fn(key: *mut RedisModuleKey) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_StreamIteratorNextID: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            id: *mut RedisModuleStreamID,
            numfields: *mut ::std::os::raw::c_long,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_StreamIteratorNextField: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            field_ptr: *mut *mut RedisModuleString,
            value_ptr: *mut *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_StreamIteratorDelete: ::std::option::Option<
        unsafe extern "C" fn(key: *mut RedisModuleKey) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_StreamTrimByLength: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            flags: ::std::os::raw::c_int,
            length: ::std::os::raw::c_longlong,
        ) -> ::std::os::raw::c_longlong,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_StreamTrimByID: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            flags: ::std::os::raw::c_int,
            id: *mut RedisModuleStreamID,
        ) -> ::std::os::raw::c_longlong,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_IsKeysPositionRequest: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_KeyAtPos: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, pos: ::std::os::raw::c_int),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_KeyAtPosWithFlags: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            pos: ::std::os::raw::c_int,
            flags: ::std::os::raw::c_int,
        ),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_IsChannelsPositionRequest: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ChannelAtPosWithFlags: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            pos: ::std::os::raw::c_int,
            flags: ::std::os::raw::c_int,
        ),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetClientId: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_ulonglong,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetClientUserNameById: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, id: u64) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetClientInfoById: ::std::option::Option<
        unsafe extern "C" fn(ci: *mut ::std::os::raw::c_void, id: u64) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetClientNameById: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, id: u64) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_SetClientNameById: ::std::option::Option<
        unsafe extern "C" fn(id: u64, name: *mut RedisModuleString) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_PublishMessage: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            channel: *mut RedisModuleString,
            message: *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_PublishMessageShard: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            channel: *mut RedisModuleString,
            message: *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetContextFlags: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_AvoidReplicaTraffic:
        ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
}
unsafe extern "C" {
    pub static mut RedisModule_EnablePostponeClients:
        ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
}
unsafe extern "C" {
    pub static mut RedisModule_DisablePostponeClients:
        ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
}
unsafe extern "C" {
    pub static mut RedisModule_PoolAlloc: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, bytes: usize) -> *mut ::std::os::raw::c_void,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CreateDataType: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            name: *const ::std::os::raw::c_char,
            encver: ::std::os::raw::c_int,
            typemethods: *mut RedisModuleTypeMethods,
        ) -> *mut RedisModuleType,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ModuleTypeSetValue: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            mt: *mut RedisModuleType,
            value: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ModuleTypeReplaceValue: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            mt: *mut RedisModuleType,
            new_value: *mut ::std::os::raw::c_void,
            old_value: *mut *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ModuleTypeGetType: ::std::option::Option<
        unsafe extern "C" fn(key: *mut RedisModuleKey) -> *mut RedisModuleType,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ModuleTypeGetValue: ::std::option::Option<
        unsafe extern "C" fn(key: *mut RedisModuleKey) -> *mut ::std::os::raw::c_void,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_IsIOError: ::std::option::Option<
        unsafe extern "C" fn(io: *mut RedisModuleIO) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_SetModuleOptions: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, options: ::std::os::raw::c_int),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetModuleOptions: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_SignalModifiedKey: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            keyname: *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_SaveUnsigned:
        ::std::option::Option<unsafe extern "C" fn(io: *mut RedisModuleIO, value: u64)>;
}
unsafe extern "C" {
    pub static mut RedisModule_LoadUnsigned:
        ::std::option::Option<unsafe extern "C" fn(io: *mut RedisModuleIO) -> u64>;
}
unsafe extern "C" {
    pub static mut RedisModule_SaveSigned:
        ::std::option::Option<unsafe extern "C" fn(io: *mut RedisModuleIO, value: i64)>;
}
unsafe extern "C" {
    pub static mut RedisModule_LoadSigned:
        ::std::option::Option<unsafe extern "C" fn(io: *mut RedisModuleIO) -> i64>;
}
unsafe extern "C" {
    pub static mut RedisModule_EmitAOF: ::std::option::Option<
        unsafe extern "C" fn(
            io: *mut RedisModuleIO,
            cmdname: *const ::std::os::raw::c_char,
            fmt: *const ::std::os::raw::c_char,
            ...
        ),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_SaveString: ::std::option::Option<
        unsafe extern "C" fn(io: *mut RedisModuleIO, s: *mut RedisModuleString),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_SaveStringBuffer: ::std::option::Option<
        unsafe extern "C" fn(
            io: *mut RedisModuleIO,
            str_: *const ::std::os::raw::c_char,
            len: usize,
        ),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_LoadString: ::std::option::Option<
        unsafe extern "C" fn(io: *mut RedisModuleIO) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_LoadStringBuffer: ::std::option::Option<
        unsafe extern "C" fn(
            io: *mut RedisModuleIO,
            lenptr: *mut usize,
        ) -> *mut ::std::os::raw::c_char,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_SaveDouble:
        ::std::option::Option<unsafe extern "C" fn(io: *mut RedisModuleIO, value: f64)>;
}
unsafe extern "C" {
    pub static mut RedisModule_LoadDouble:
        ::std::option::Option<unsafe extern "C" fn(io: *mut RedisModuleIO) -> f64>;
}
unsafe extern "C" {
    pub static mut RedisModule_SaveFloat:
        ::std::option::Option<unsafe extern "C" fn(io: *mut RedisModuleIO, value: f32)>;
}
unsafe extern "C" {
    pub static mut RedisModule_LoadFloat:
        ::std::option::Option<unsafe extern "C" fn(io: *mut RedisModuleIO) -> f32>;
}
unsafe extern "C" {
    pub static mut RedisModule_SaveLongDouble:
        ::std::option::Option<unsafe extern "C" fn(io: *mut RedisModuleIO, value: f64)>;
}
unsafe extern "C" {
    pub static mut RedisModule_LoadLongDouble:
        ::std::option::Option<unsafe extern "C" fn(io: *mut RedisModuleIO) -> f64>;
}
unsafe extern "C" {
    pub static mut RedisModule_LoadDataTypeFromString: ::std::option::Option<
        unsafe extern "C" fn(
            str_: *const RedisModuleString,
            mt: *const RedisModuleType,
        ) -> *mut ::std::os::raw::c_void,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_LoadDataTypeFromStringEncver: ::std::option::Option<
        unsafe extern "C" fn(
            str_: *const RedisModuleString,
            mt: *const RedisModuleType,
            encver: ::std::os::raw::c_int,
        ) -> *mut ::std::os::raw::c_void,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_SaveDataTypeToString: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            data: *mut ::std::os::raw::c_void,
            mt: *const RedisModuleType,
        ) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_Log: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            level: *const ::std::os::raw::c_char,
            fmt: *const ::std::os::raw::c_char,
            ...
        ),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_LogIOError: ::std::option::Option<
        unsafe extern "C" fn(
            io: *mut RedisModuleIO,
            levelstr: *const ::std::os::raw::c_char,
            fmt: *const ::std::os::raw::c_char,
            ...
        ),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule__Assert: ::std::option::Option<
        unsafe extern "C" fn(
            estr: *const ::std::os::raw::c_char,
            file: *const ::std::os::raw::c_char,
            line: ::std::os::raw::c_int,
        ),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_LatencyAddSample: ::std::option::Option<
        unsafe extern "C" fn(event: *const ::std::os::raw::c_char, latency: mstime_t),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_StringAppendBuffer: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            str_: *mut RedisModuleString,
            buf: *const ::std::os::raw::c_char,
            len: usize,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_TrimStringAllocation:
        ::std::option::Option<unsafe extern "C" fn(str_: *mut RedisModuleString)>;
}
unsafe extern "C" {
    pub static mut RedisModule_RetainString: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, str_: *mut RedisModuleString),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_HoldString: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            str_: *mut RedisModuleString,
        ) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_StringCompare: ::std::option::Option<
        unsafe extern "C" fn(
            a: *const RedisModuleString,
            b: *const RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetContextFromIO:
        ::std::option::Option<unsafe extern "C" fn(io: *mut RedisModuleIO) -> *mut RedisModuleCtx>;
}
unsafe extern "C" {
    pub static mut RedisModule_GetKeyNameFromIO: ::std::option::Option<
        unsafe extern "C" fn(io: *mut RedisModuleIO) -> *const RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetKeyNameFromModuleKey: ::std::option::Option<
        unsafe extern "C" fn(key: *mut RedisModuleKey) -> *const RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetDbIdFromModuleKey: ::std::option::Option<
        unsafe extern "C" fn(key: *mut RedisModuleKey) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetDbIdFromIO: ::std::option::Option<
        unsafe extern "C" fn(io: *mut RedisModuleIO) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetDbIdFromOptCtx: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleKeyOptCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetToDbIdFromOptCtx: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleKeyOptCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetKeyNameFromOptCtx: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleKeyOptCtx) -> *const RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetToKeyNameFromOptCtx: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleKeyOptCtx) -> *const RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_Milliseconds:
        ::std::option::Option<unsafe extern "C" fn() -> mstime_t>;
}
unsafe extern "C" {
    pub static mut RedisModule_MonotonicMicroseconds:
        ::std::option::Option<unsafe extern "C" fn() -> u64>;
}
unsafe extern "C" {
    pub static mut RedisModule_Microseconds:
        ::std::option::Option<unsafe extern "C" fn() -> ustime_t>;
}
unsafe extern "C" {
    pub static mut RedisModule_CachedMicroseconds:
        ::std::option::Option<unsafe extern "C" fn() -> ustime_t>;
}
unsafe extern "C" {
    pub static mut RedisModule_DigestAddStringBuffer: ::std::option::Option<
        unsafe extern "C" fn(
            md: *mut RedisModuleDigest,
            ele: *const ::std::os::raw::c_char,
            len: usize,
        ),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DigestAddLongLong: ::std::option::Option<
        unsafe extern "C" fn(md: *mut RedisModuleDigest, ele: ::std::os::raw::c_longlong),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DigestEndSequence:
        ::std::option::Option<unsafe extern "C" fn(md: *mut RedisModuleDigest)>;
}
unsafe extern "C" {
    pub static mut RedisModule_GetDbIdFromDigest: ::std::option::Option<
        unsafe extern "C" fn(dig: *mut RedisModuleDigest) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetKeyNameFromDigest: ::std::option::Option<
        unsafe extern "C" fn(dig: *mut RedisModuleDigest) -> *const RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CreateDict: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> *mut RedisModuleDict,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_FreeDict: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, d: *mut RedisModuleDict),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DictSize:
        ::std::option::Option<unsafe extern "C" fn(d: *mut RedisModuleDict) -> u64>;
}
unsafe extern "C" {
    pub static mut RedisModule_DictSetC: ::std::option::Option<
        unsafe extern "C" fn(
            d: *mut RedisModuleDict,
            key: *mut ::std::os::raw::c_void,
            keylen: usize,
            ptr: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DictReplaceC: ::std::option::Option<
        unsafe extern "C" fn(
            d: *mut RedisModuleDict,
            key: *mut ::std::os::raw::c_void,
            keylen: usize,
            ptr: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DictSet: ::std::option::Option<
        unsafe extern "C" fn(
            d: *mut RedisModuleDict,
            key: *mut RedisModuleString,
            ptr: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DictReplace: ::std::option::Option<
        unsafe extern "C" fn(
            d: *mut RedisModuleDict,
            key: *mut RedisModuleString,
            ptr: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DictGetC: ::std::option::Option<
        unsafe extern "C" fn(
            d: *mut RedisModuleDict,
            key: *mut ::std::os::raw::c_void,
            keylen: usize,
            nokey: *mut ::std::os::raw::c_int,
        ) -> *mut ::std::os::raw::c_void,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DictGet: ::std::option::Option<
        unsafe extern "C" fn(
            d: *mut RedisModuleDict,
            key: *mut RedisModuleString,
            nokey: *mut ::std::os::raw::c_int,
        ) -> *mut ::std::os::raw::c_void,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DictDelC: ::std::option::Option<
        unsafe extern "C" fn(
            d: *mut RedisModuleDict,
            key: *mut ::std::os::raw::c_void,
            keylen: usize,
            oldval: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DictDel: ::std::option::Option<
        unsafe extern "C" fn(
            d: *mut RedisModuleDict,
            key: *mut RedisModuleString,
            oldval: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DictIteratorStartC: ::std::option::Option<
        unsafe extern "C" fn(
            d: *mut RedisModuleDict,
            op: *const ::std::os::raw::c_char,
            key: *mut ::std::os::raw::c_void,
            keylen: usize,
        ) -> *mut RedisModuleDictIter,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DictIteratorStart: ::std::option::Option<
        unsafe extern "C" fn(
            d: *mut RedisModuleDict,
            op: *const ::std::os::raw::c_char,
            key: *mut RedisModuleString,
        ) -> *mut RedisModuleDictIter,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DictIteratorStop:
        ::std::option::Option<unsafe extern "C" fn(di: *mut RedisModuleDictIter)>;
}
unsafe extern "C" {
    pub static mut RedisModule_DictIteratorReseekC: ::std::option::Option<
        unsafe extern "C" fn(
            di: *mut RedisModuleDictIter,
            op: *const ::std::os::raw::c_char,
            key: *mut ::std::os::raw::c_void,
            keylen: usize,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DictIteratorReseek: ::std::option::Option<
        unsafe extern "C" fn(
            di: *mut RedisModuleDictIter,
            op: *const ::std::os::raw::c_char,
            key: *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DictNextC: ::std::option::Option<
        unsafe extern "C" fn(
            di: *mut RedisModuleDictIter,
            keylen: *mut usize,
            dataptr: *mut *mut ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DictPrevC: ::std::option::Option<
        unsafe extern "C" fn(
            di: *mut RedisModuleDictIter,
            keylen: *mut usize,
            dataptr: *mut *mut ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DictNext: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            di: *mut RedisModuleDictIter,
            dataptr: *mut *mut ::std::os::raw::c_void,
        ) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DictPrev: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            di: *mut RedisModuleDictIter,
            dataptr: *mut *mut ::std::os::raw::c_void,
        ) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DictCompareC: ::std::option::Option<
        unsafe extern "C" fn(
            di: *mut RedisModuleDictIter,
            op: *const ::std::os::raw::c_char,
            key: *mut ::std::os::raw::c_void,
            keylen: usize,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DictCompare: ::std::option::Option<
        unsafe extern "C" fn(
            di: *mut RedisModuleDictIter,
            op: *const ::std::os::raw::c_char,
            key: *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_RegisterPreCommandFunc: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            cb: RedisModulePreCommandFunc,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_RegisterPostCommandFunc: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            cb: RedisModulePostCommandFunc,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_RegisterInfoFunc: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            cb: RedisModuleInfoFunc,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_RegisterAuthCallback: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, cb: RedisModuleAuthCallback),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_InfoAddSection: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleInfoCtx,
            name: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_InfoBeginDictField: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleInfoCtx,
            name: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_InfoEndDictField: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleInfoCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_InfoAddFieldString: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleInfoCtx,
            field: *const ::std::os::raw::c_char,
            value: *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_InfoAddFieldCString: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleInfoCtx,
            field: *const ::std::os::raw::c_char,
            value: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_InfoAddFieldDouble: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleInfoCtx,
            field: *const ::std::os::raw::c_char,
            value: f64,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_InfoAddFieldLongLong: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleInfoCtx,
            field: *const ::std::os::raw::c_char,
            value: ::std::os::raw::c_longlong,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_InfoAddFieldULongLong: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleInfoCtx,
            field: *const ::std::os::raw::c_char,
            value: ::std::os::raw::c_ulonglong,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetServerInfo: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            section: *const ::std::os::raw::c_char,
        ) -> *mut RedisModuleServerInfoData,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_FreeServerInfo: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, data: *mut RedisModuleServerInfoData),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ServerInfoGetField: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            data: *mut RedisModuleServerInfoData,
            field: *const ::std::os::raw::c_char,
        ) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ServerInfoGetFieldC: ::std::option::Option<
        unsafe extern "C" fn(
            data: *mut RedisModuleServerInfoData,
            field: *const ::std::os::raw::c_char,
        ) -> *const ::std::os::raw::c_char,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ServerInfoGetFieldSigned: ::std::option::Option<
        unsafe extern "C" fn(
            data: *mut RedisModuleServerInfoData,
            field: *const ::std::os::raw::c_char,
            out_err: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_longlong,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ServerInfoGetFieldUnsigned: ::std::option::Option<
        unsafe extern "C" fn(
            data: *mut RedisModuleServerInfoData,
            field: *const ::std::os::raw::c_char,
            out_err: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_ulonglong,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ServerInfoGetFieldDouble: ::std::option::Option<
        unsafe extern "C" fn(
            data: *mut RedisModuleServerInfoData,
            field: *const ::std::os::raw::c_char,
            out_err: *mut ::std::os::raw::c_int,
        ) -> f64,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_SubscribeToServerEvent: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            event: RedisModuleEvent,
            callback: RedisModuleEventCallback,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_SetLRU: ::std::option::Option<
        unsafe extern "C" fn(key: *mut RedisModuleKey, lru_idle: mstime_t) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetLRU: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            lru_idle: *mut mstime_t,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_SetLFU: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            lfu_freq: ::std::os::raw::c_longlong,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetLFU: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            lfu_freq: *mut ::std::os::raw::c_longlong,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_BlockClientOnKeys: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            reply_callback: RedisModuleCmdFunc,
            timeout_callback: RedisModuleCmdFunc,
            free_privdata: ::std::option::Option<
                unsafe extern "C" fn(arg1: *mut RedisModuleCtx, arg2: *mut ::std::os::raw::c_void),
            >,
            timeout_ms: ::std::os::raw::c_longlong,
            keys: *mut *mut RedisModuleString,
            numkeys: ::std::os::raw::c_int,
            privdata: *mut ::std::os::raw::c_void,
        ) -> *mut RedisModuleBlockedClient,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_BlockClientOnKeysWithFlags: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            reply_callback: RedisModuleCmdFunc,
            timeout_callback: RedisModuleCmdFunc,
            free_privdata: ::std::option::Option<
                unsafe extern "C" fn(arg1: *mut RedisModuleCtx, arg2: *mut ::std::os::raw::c_void),
            >,
            timeout_ms: ::std::os::raw::c_longlong,
            keys: *mut *mut RedisModuleString,
            numkeys: ::std::os::raw::c_int,
            privdata: *mut ::std::os::raw::c_void,
            flags: ::std::os::raw::c_int,
        ) -> *mut RedisModuleBlockedClient,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_SignalKeyAsReady: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, key: *mut RedisModuleString),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetBlockedClientReadyKey: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ScanCursorCreate:
        ::std::option::Option<unsafe extern "C" fn() -> *mut RedisModuleScanCursor>;
}
unsafe extern "C" {
    pub static mut RedisModule_ScanCursorRestart:
        ::std::option::Option<unsafe extern "C" fn(cursor: *mut RedisModuleScanCursor)>;
}
unsafe extern "C" {
    pub static mut RedisModule_ScanCursorDestroy:
        ::std::option::Option<unsafe extern "C" fn(cursor: *mut RedisModuleScanCursor)>;
}
unsafe extern "C" {
    pub static mut RedisModule_Scan: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            cursor: *mut RedisModuleScanCursor,
            fn_: RedisModuleScanCB,
            privdata: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ScanKey: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut RedisModuleKey,
            cursor: *mut RedisModuleScanCursor,
            fn_: RedisModuleScanKeyCB,
            privdata: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetContextFlagsAll:
        ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
}
unsafe extern "C" {
    pub static mut RedisModule_GetModuleOptionsAll:
        ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
}
unsafe extern "C" {
    pub static mut RedisModule_GetKeyspaceNotificationFlagsAll:
        ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
}
unsafe extern "C" {
    pub static mut RedisModule_IsSubEventSupported: ::std::option::Option<
        unsafe extern "C" fn(event: RedisModuleEvent, subevent: u64) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetServerVersion:
        ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
}
unsafe extern "C" {
    pub static mut RedisModule_GetTypeMethodVersion:
        ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
}
unsafe extern "C" {
    pub static mut RedisModule_Yield: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            flags: ::std::os::raw::c_int,
            busy_reply: *const ::std::os::raw::c_char,
        ),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_BlockClient: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            reply_callback: RedisModuleCmdFunc,
            timeout_callback: RedisModuleCmdFunc,
            free_privdata: ::std::option::Option<
                unsafe extern "C" fn(arg1: *mut RedisModuleCtx, arg2: *mut ::std::os::raw::c_void),
            >,
            timeout_ms: ::std::os::raw::c_longlong,
        ) -> *mut RedisModuleBlockedClient,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_BlockClientGetPrivateData: ::std::option::Option<
        unsafe extern "C" fn(
            blocked_client: *mut RedisModuleBlockedClient,
        ) -> *mut ::std::os::raw::c_void,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_BlockClientSetPrivateData: ::std::option::Option<
        unsafe extern "C" fn(
            blocked_client: *mut RedisModuleBlockedClient,
            private_data: *mut ::std::os::raw::c_void,
        ),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_BlockClientOnAuth: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            reply_callback: RedisModuleAuthCallback,
            free_privdata: ::std::option::Option<
                unsafe extern "C" fn(arg1: *mut RedisModuleCtx, arg2: *mut ::std::os::raw::c_void),
            >,
        ) -> *mut RedisModuleBlockedClient,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_UnblockClient: ::std::option::Option<
        unsafe extern "C" fn(
            bc: *mut RedisModuleBlockedClient,
            privdata: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_IsBlockedReplyRequest: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_IsBlockedTimeoutRequest: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetBlockedClientPrivateData: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> *mut ::std::os::raw::c_void,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetBlockedClientHandle: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> *mut RedisModuleBlockedClient,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_AbortBlock: ::std::option::Option<
        unsafe extern "C" fn(bc: *mut RedisModuleBlockedClient) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_BlockedClientMeasureTimeStart: ::std::option::Option<
        unsafe extern "C" fn(bc: *mut RedisModuleBlockedClient) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_BlockedClientMeasureTimeEnd: ::std::option::Option<
        unsafe extern "C" fn(bc: *mut RedisModuleBlockedClient) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetThreadSafeContext: ::std::option::Option<
        unsafe extern "C" fn(bc: *mut RedisModuleBlockedClient) -> *mut RedisModuleCtx,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetDetachedThreadSafeContext: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> *mut RedisModuleCtx,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_FreeThreadSafeContext:
        ::std::option::Option<unsafe extern "C" fn(ctx: *mut RedisModuleCtx)>;
}
unsafe extern "C" {
    pub static mut RedisModule_ThreadSafeContextLock:
        ::std::option::Option<unsafe extern "C" fn(ctx: *mut RedisModuleCtx)>;
}
unsafe extern "C" {
    pub static mut RedisModule_ThreadSafeContextTryLock: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ThreadSafeContextUnlock:
        ::std::option::Option<unsafe extern "C" fn(ctx: *mut RedisModuleCtx)>;
}
unsafe extern "C" {
    pub static mut RedisModule_SubscribeToKeyspaceEvents: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            types: ::std::os::raw::c_int,
            cb: RedisModuleNotificationFunc,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_UnsubscribeFromKeyspaceEvents: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            types: ::std::os::raw::c_int,
            cb: RedisModuleNotificationFunc,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_AddPostNotificationJob: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            callback: RedisModulePostNotificationJobFunc,
            pd: *mut ::std::os::raw::c_void,
            free_pd: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_NotifyKeyspaceEvent: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            type_: ::std::os::raw::c_int,
            event: *const ::std::os::raw::c_char,
            key: *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetNotifyKeyspaceEvents:
        ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
}
unsafe extern "C" {
    pub static mut RedisModule_BlockedClientDisconnected: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_RegisterClusterMessageReceiver: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            type_: u8,
            callback: RedisModuleClusterMessageReceiver,
        ),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_SendClusterMessage: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            target_id: *const ::std::os::raw::c_char,
            type_: u8,
            msg: *const ::std::os::raw::c_char,
            len: u32,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetClusterNodeInfo: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            id: *const ::std::os::raw::c_char,
            ip: *mut ::std::os::raw::c_char,
            master_id: *mut ::std::os::raw::c_char,
            port: *mut ::std::os::raw::c_int,
            flags: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetClusterNodesList: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            numnodes: *mut usize,
        ) -> *mut *mut ::std::os::raw::c_char,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_FreeClusterNodesList:
        ::std::option::Option<unsafe extern "C" fn(ids: *mut *mut ::std::os::raw::c_char)>;
}
unsafe extern "C" {
    pub static mut RedisModule_CreateTimer: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            period: mstime_t,
            callback: RedisModuleTimerProc,
            data: *mut ::std::os::raw::c_void,
        ) -> RedisModuleTimerID,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_StopTimer: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            id: RedisModuleTimerID,
            data: *mut *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetTimerInfo: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            id: RedisModuleTimerID,
            remaining: *mut u64,
            data: *mut *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetMyClusterID:
        ::std::option::Option<unsafe extern "C" fn() -> *const ::std::os::raw::c_char>;
}
unsafe extern "C" {
    pub static mut RedisModule_GetClusterSize:
        ::std::option::Option<unsafe extern "C" fn() -> usize>;
}
unsafe extern "C" {
    pub static mut RedisModule_GetRandomBytes:
        ::std::option::Option<unsafe extern "C" fn(dst: *mut ::std::os::raw::c_uchar, len: usize)>;
}
unsafe extern "C" {
    pub static mut RedisModule_GetRandomHexChars:
        ::std::option::Option<unsafe extern "C" fn(dst: *mut ::std::os::raw::c_char, len: usize)>;
}
unsafe extern "C" {
    pub static mut RedisModule_SetDisconnectCallback: ::std::option::Option<
        unsafe extern "C" fn(
            bc: *mut RedisModuleBlockedClient,
            callback: RedisModuleDisconnectFunc,
        ),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_SetClusterFlags:
        ::std::option::Option<unsafe extern "C" fn(ctx: *mut RedisModuleCtx, flags: u64)>;
}
unsafe extern "C" {
    pub static mut RedisModule_ClusterDisableTrim: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ClusterEnableTrim: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ClusterKeySlot: ::std::option::Option<
        unsafe extern "C" fn(key: *mut RedisModuleString) -> ::std::os::raw::c_uint,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ClusterKeySlotC: ::std::option::Option<
        unsafe extern "C" fn(
            keystr: *const ::std::os::raw::c_char,
            keylen: usize,
        ) -> ::std::os::raw::c_uint,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ClusterCanonicalKeyNameInSlot: ::std::option::Option<
        unsafe extern "C" fn(slot: ::std::os::raw::c_uint) -> *const ::std::os::raw::c_char,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ClusterCanAccessKeysInSlot: ::std::option::Option<
        unsafe extern "C" fn(slot: ::std::os::raw::c_int) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ClusterPropagateForSlotMigration: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            cmdname: *const ::std::os::raw::c_char,
            fmt: *const ::std::os::raw::c_char,
            ...
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ClusterGetLocalSlotRanges: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> *mut RedisModuleSlotRangeArray,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ClusterFreeSlotRanges: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, slots: *mut RedisModuleSlotRangeArray),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ExportSharedAPI: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            apiname: *const ::std::os::raw::c_char,
            func: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetSharedAPI: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            apiname: *const ::std::os::raw::c_char,
        ) -> *mut ::std::os::raw::c_void,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_RegisterCommandFilter: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            cb: RedisModuleCommandFilterFunc,
            flags: ::std::os::raw::c_int,
        ) -> *mut RedisModuleCommandFilter,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_UnregisterCommandFilter: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            filter: *mut RedisModuleCommandFilter,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CommandFilterArgsCount: ::std::option::Option<
        unsafe extern "C" fn(fctx: *mut RedisModuleCommandFilterCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CommandFilterArgGet: ::std::option::Option<
        unsafe extern "C" fn(
            fctx: *mut RedisModuleCommandFilterCtx,
            pos: ::std::os::raw::c_int,
        ) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CommandFilterArgInsert: ::std::option::Option<
        unsafe extern "C" fn(
            fctx: *mut RedisModuleCommandFilterCtx,
            pos: ::std::os::raw::c_int,
            arg: *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CommandFilterArgReplace: ::std::option::Option<
        unsafe extern "C" fn(
            fctx: *mut RedisModuleCommandFilterCtx,
            pos: ::std::os::raw::c_int,
            arg: *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CommandFilterArgDelete: ::std::option::Option<
        unsafe extern "C" fn(
            fctx: *mut RedisModuleCommandFilterCtx,
            pos: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CommandFilterGetClientId: ::std::option::Option<
        unsafe extern "C" fn(fctx: *mut RedisModuleCommandFilterCtx) -> ::std::os::raw::c_ulonglong,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_Fork: ::std::option::Option<
        unsafe extern "C" fn(
            cb: RedisModuleForkDoneHandler,
            user_data: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_SendChildHeartbeat:
        ::std::option::Option<unsafe extern "C" fn(progress: f64)>;
}
unsafe extern "C" {
    pub static mut RedisModule_ExitFromChild: ::std::option::Option<
        unsafe extern "C" fn(retcode: ::std::os::raw::c_int) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_KillForkChild: ::std::option::Option<
        unsafe extern "C" fn(child_pid: ::std::os::raw::c_int) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetUsedMemoryRatio:
        ::std::option::Option<unsafe extern "C" fn() -> f32>;
}
unsafe extern "C" {
    pub static mut RedisModule_MallocSize:
        ::std::option::Option<unsafe extern "C" fn(ptr: *mut ::std::os::raw::c_void) -> usize>;
}
unsafe extern "C" {
    pub static mut RedisModule_MallocUsableSize:
        ::std::option::Option<unsafe extern "C" fn(ptr: *mut ::std::os::raw::c_void) -> usize>;
}
unsafe extern "C" {
    pub static mut RedisModule_MallocSizeString:
        ::std::option::Option<unsafe extern "C" fn(str_: *mut RedisModuleString) -> usize>;
}
unsafe extern "C" {
    pub static mut RedisModule_MallocSizeDict:
        ::std::option::Option<unsafe extern "C" fn(dict: *mut RedisModuleDict) -> usize>;
}
unsafe extern "C" {
    pub static mut RedisModule_CreateModuleUser: ::std::option::Option<
        unsafe extern "C" fn(name: *const ::std::os::raw::c_char) -> *mut RedisModuleUser,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_FreeModuleUser:
        ::std::option::Option<unsafe extern "C" fn(user: *mut RedisModuleUser)>;
}
unsafe extern "C" {
    pub static mut RedisModule_SetContextUser: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, user: *const RedisModuleUser),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_SetModuleUserACL: ::std::option::Option<
        unsafe extern "C" fn(
            user: *mut RedisModuleUser,
            acl: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_SetModuleUserACLString: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            user: *mut RedisModuleUser,
            acl: *const ::std::os::raw::c_char,
            error: *mut *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetModuleUserACLString: ::std::option::Option<
        unsafe extern "C" fn(user: *mut RedisModuleUser) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetCurrentUserName: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetModuleUserFromUserName: ::std::option::Option<
        unsafe extern "C" fn(name: *mut RedisModuleString) -> *mut RedisModuleUser,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ACLCheckCommandPermissions: ::std::option::Option<
        unsafe extern "C" fn(
            user: *mut RedisModuleUser,
            argv: *mut *mut RedisModuleString,
            argc: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ACLCheckKeyPermissions: ::std::option::Option<
        unsafe extern "C" fn(
            user: *mut RedisModuleUser,
            key: *mut RedisModuleString,
            flags: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ACLCheckKeyPrefixPermissions: ::std::option::Option<
        unsafe extern "C" fn(
            user: *mut RedisModuleUser,
            prefix: *mut RedisModuleString,
            flags: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ACLCheckChannelPermissions: ::std::option::Option<
        unsafe extern "C" fn(
            user: *mut RedisModuleUser,
            ch: *mut RedisModuleString,
            literal: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ACLAddLogEntry: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            user: *mut RedisModuleUser,
            object: *mut RedisModuleString,
            reason: RedisModuleACLLogEntryReason,
        ),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ACLAddLogEntryByUserName: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            user: *mut RedisModuleString,
            object: *mut RedisModuleString,
            reason: RedisModuleACLLogEntryReason,
        ),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_AuthenticateClientWithACLUser: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            name: *const ::std::os::raw::c_char,
            len: usize,
            callback: RedisModuleUserChangedFunc,
            privdata: *mut ::std::os::raw::c_void,
            client_id: *mut u64,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_AuthenticateClientWithUser: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            user: *mut RedisModuleUser,
            callback: RedisModuleUserChangedFunc,
            privdata: *mut ::std::os::raw::c_void,
            client_id: *mut u64,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DeauthenticateAndCloseClient: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, client_id: u64) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_RedactClientCommandArgument: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            pos: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetClientCertificate: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, id: u64) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetCommandKeys: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            argv: *mut *mut RedisModuleString,
            argc: ::std::os::raw::c_int,
            num_keys: *mut ::std::os::raw::c_int,
        ) -> *mut ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetCommandKeysWithFlags: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            argv: *mut *mut RedisModuleString,
            argc: ::std::os::raw::c_int,
            num_keys: *mut ::std::os::raw::c_int,
            out_flags: *mut *mut ::std::os::raw::c_int,
        ) -> *mut ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetCurrentCommandName: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> *const ::std::os::raw::c_char,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_RegisterDefragFunc: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            func: RedisModuleDefragFunc,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_RegisterDefragFunc2: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            func: RedisModuleDefragFunc2,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_RegisterDefragCallbacks: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            start: RedisModuleDefragFunc,
            end: RedisModuleDefragFunc,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DefragAlloc: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleDefragCtx,
            ptr: *mut ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DefragAllocRaw: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleDefragCtx,
            size: usize,
        ) -> *mut ::std::os::raw::c_void,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DefragFreeRaw: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleDefragCtx, ptr: *mut ::std::os::raw::c_void),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DefragRedisModuleString: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleDefragCtx,
            str_: *mut RedisModuleString,
        ) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DefragRedisModuleDict: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleDefragCtx,
            dict: *mut RedisModuleDict,
            valueCB: RedisModuleDefragDictValueCallback,
            seekTo: *mut *mut RedisModuleString,
        ) -> *mut RedisModuleDict,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DefragShouldStop: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleDefragCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DefragCursorSet: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleDefragCtx,
            cursor: ::std::os::raw::c_ulong,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DefragCursorGet: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleDefragCtx,
            cursor: *mut ::std::os::raw::c_ulong,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetDbIdFromDefragCtx: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleDefragCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetKeyNameFromDefragCtx: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleDefragCtx) -> *const RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_EventLoopAdd: ::std::option::Option<
        unsafe extern "C" fn(
            fd: ::std::os::raw::c_int,
            mask: ::std::os::raw::c_int,
            func: RedisModuleEventLoopFunc,
            user_data: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_EventLoopDel: ::std::option::Option<
        unsafe extern "C" fn(
            fd: ::std::os::raw::c_int,
            mask: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_EventLoopAddOneShot: ::std::option::Option<
        unsafe extern "C" fn(
            func: RedisModuleEventLoopOneShotFunc,
            user_data: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_RegisterBoolConfig: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            name: *const ::std::os::raw::c_char,
            default_val: ::std::os::raw::c_int,
            flags: ::std::os::raw::c_uint,
            getfn: RedisModuleConfigGetBoolFunc,
            setfn: RedisModuleConfigSetBoolFunc,
            applyfn: RedisModuleConfigApplyFunc,
            privdata: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_RegisterNumericConfig: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            name: *const ::std::os::raw::c_char,
            default_val: ::std::os::raw::c_longlong,
            flags: ::std::os::raw::c_uint,
            min: ::std::os::raw::c_longlong,
            max: ::std::os::raw::c_longlong,
            getfn: RedisModuleConfigGetNumericFunc,
            setfn: RedisModuleConfigSetNumericFunc,
            applyfn: RedisModuleConfigApplyFunc,
            privdata: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_RegisterStringConfig: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            name: *const ::std::os::raw::c_char,
            default_val: *const ::std::os::raw::c_char,
            flags: ::std::os::raw::c_uint,
            getfn: RedisModuleConfigGetStringFunc,
            setfn: RedisModuleConfigSetStringFunc,
            applyfn: RedisModuleConfigApplyFunc,
            privdata: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_RegisterEnumConfig: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            name: *const ::std::os::raw::c_char,
            default_val: ::std::os::raw::c_int,
            flags: ::std::os::raw::c_uint,
            enum_values: *mut *const ::std::os::raw::c_char,
            int_values: *const ::std::os::raw::c_int,
            num_enum_vals: ::std::os::raw::c_int,
            getfn: RedisModuleConfigGetEnumFunc,
            setfn: RedisModuleConfigSetEnumFunc,
            applyfn: RedisModuleConfigApplyFunc,
            privdata: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_LoadConfigs: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_LoadDefaultConfigs: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_RdbStreamCreateFromFile: ::std::option::Option<
        unsafe extern "C" fn(filename: *const ::std::os::raw::c_char) -> *mut RedisModuleRdbStream,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_RdbStreamFree:
        ::std::option::Option<unsafe extern "C" fn(stream: *mut RedisModuleRdbStream)>;
}
unsafe extern "C" {
    pub static mut RedisModule_RdbLoad: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            stream: *mut RedisModuleRdbStream,
            flags: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_RdbSave: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            stream: *mut RedisModuleRdbStream,
            flags: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetInternalSecret: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            len: *mut usize,
        ) -> *const ::std::os::raw::c_char,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ConfigIteratorCreate: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            pattern: *const ::std::os::raw::c_char,
        ) -> *mut RedisModuleConfigIterator,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ConfigIteratorRelease: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, iter: *mut RedisModuleConfigIterator),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ConfigIteratorNext: ::std::option::Option<
        unsafe extern "C" fn(iter: *mut RedisModuleConfigIterator) -> *const ::std::os::raw::c_char,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ConfigGetType: ::std::option::Option<
        unsafe extern "C" fn(
            name: *const ::std::os::raw::c_char,
            res: *mut RedisModuleConfigType,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ConfigGet: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            name: *const ::std::os::raw::c_char,
            res: *mut *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ConfigGetBool: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            name: *const ::std::os::raw::c_char,
            res: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ConfigGetEnum: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            name: *const ::std::os::raw::c_char,
            res: *mut *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ConfigGetNumeric: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            name: *const ::std::os::raw::c_char,
            res: *mut ::std::os::raw::c_longlong,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ConfigSet: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            name: *const ::std::os::raw::c_char,
            value: *mut RedisModuleString,
            err: *mut *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ConfigSetBool: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            name: *const ::std::os::raw::c_char,
            value: ::std::os::raw::c_int,
            err: *mut *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ConfigSetEnum: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            name: *const ::std::os::raw::c_char,
            value: *mut RedisModuleString,
            err: *mut *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ConfigSetNumeric: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            name: *const ::std::os::raw::c_char,
            value: ::std::os::raw::c_longlong,
            err: *mut *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CreateKeyMetaClass: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            metaname: *const ::std::os::raw::c_char,
            metaver: ::std::os::raw::c_int,
            conf: *mut RedisModuleKeyMetaClassConfig,
        ) -> RedisModuleKeyMetaClassId,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReleaseKeyMetaClass: ::std::option::Option<
        unsafe extern "C" fn(id: RedisModuleKeyMetaClassId) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_SetKeyMeta: ::std::option::Option<
        unsafe extern "C" fn(
            id: RedisModuleKeyMetaClassId,
            key: *mut RedisModuleKey,
            metadata: u64,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetKeyMeta: ::std::option::Option<
        unsafe extern "C" fn(
            id: RedisModuleKeyMetaClassId,
            key: *mut RedisModuleKey,
            metadata: *mut u64,
        ) -> ::std::os::raw::c_int,
    >;
}
pub type RedisModuleTypeKeyAddedToDbDictFunc = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        key: *mut RedisModuleString,
        value: *mut ::std::os::raw::c_void,
        not_on_swap: ::std::os::raw::c_int,
    ),
>;
pub type RedisModuleTypeRemovingKeyFromDbDictFunc = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        key: *mut RedisModuleString,
        value: *mut ::std::os::raw::c_void,
        not_on_swap: ::std::os::raw::c_int,
        writing_to_swap: ::std::os::raw::c_int,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModuleTypeExtMethods {
    pub version: u64,
    pub key_added_to_db_dict: RedisModuleTypeKeyAddedToDbDictFunc,
    pub removing_key_from_db_dict: RedisModuleTypeRemovingKeyFromDbDictFunc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModuleTypeExtMethods"]
        [::std::mem::size_of::<RedisModuleTypeExtMethods>() - 24usize];
    ["Alignment of RedisModuleTypeExtMethods"]
        [::std::mem::align_of::<RedisModuleTypeExtMethods>() - 8usize];
    ["Offset of field: RedisModuleTypeExtMethods::version"]
        [::std::mem::offset_of!(RedisModuleTypeExtMethods, version) - 0usize];
    ["Offset of field: RedisModuleTypeExtMethods::key_added_to_db_dict"]
        [::std::mem::offset_of!(RedisModuleTypeExtMethods, key_added_to_db_dict) - 8usize];
    ["Offset of field: RedisModuleTypeExtMethods::removing_key_from_db_dict"]
        [::std::mem::offset_of!(RedisModuleTypeExtMethods, removing_key_from_db_dict) - 16usize];
};
unsafe extern "C" {
    pub static mut RedisModule_SetDataTypeExtensions: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            mt: *mut RedisModuleType,
            typemethods: *mut RedisModuleTypeExtMethods,
        ) -> ::std::os::raw::c_int,
    >;
}
pub type RedisModuleSwapPrefetchCB = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RedisModuleCtx,
        key: *mut RedisModuleString,
        user_data: *mut ::std::os::raw::c_void,
    ),
>;
unsafe extern "C" {
    pub static mut RedisModule_SwapPrefetchKey: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            keyname: *mut RedisModuleString,
            fn_: RedisModuleSwapPrefetchCB,
            user_data: *mut ::std::os::raw::c_void,
            flags: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_IsKeyInRam: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            key: *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_BigModuleRegister: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            callbacks: *mut RedisModuleBigCallbacksV1,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_BigWriteBufferBudgetInit: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx, percentage: ::std::os::raw::c_int) -> isize,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_BigWriteBufferBudgetRelease:
        ::std::option::Option<unsafe extern "C" fn(ctx: *mut RedisModuleCtx)>;
}
unsafe extern "C" {
    pub static mut RedisModule_BigGetDbPath: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            index_name: *const ::std::os::raw::c_char,
        ) -> *mut ::std::os::raw::c_char,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_BigRegisterDb: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            db_handle: *mut ::std::os::raw::c_void,
            cf_handles: *mut *mut ::std::os::raw::c_void,
            num_cf_handles: usize,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_BigRegisterDbAddCf: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            db_handle: *mut ::std::os::raw::c_void,
            cf_handle: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_BigUnregisterDb: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            db_handle: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_RegisterHook: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            hook_type: ::std::os::raw::c_int,
            hook_func: RedisModuleHookFunc,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_SaveAuxField: ::std::option::Option<
        unsafe extern "C" fn(
            io: *mut RedisModuleIO,
            key: *const ::std::os::raw::c_char,
            value: *const ::std::os::raw::c_char,
        ),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_Deserialize: ::std::option::Option<
        unsafe extern "C" fn(
            str_: *const RedisModuleString,
            mt: *const RedisModuleType,
            deserialize_func: RedisModuleTypeLoadFunc,
            encver: ::std::os::raw::c_int,
        ) -> *mut ::std::os::raw::c_void,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_Serialize: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            data: *mut ::std::os::raw::c_void,
            mt: *const RedisModuleType,
            serialize_func: RedisModuleTypeSaveFunc,
        ) -> *mut RedisModuleString,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_Panic: ::std::option::Option<
        unsafe extern "C" fn(
            file: *const ::std::os::raw::c_char,
            line: ::std::os::raw::c_int,
            fmt: *const ::std::os::raw::c_char,
            ...
        ),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CallArgv: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            cmdname: *const ::std::os::raw::c_char,
            argv: *mut *mut RedisModuleString,
            argc: ::std::os::raw::c_int,
        ) -> *mut RedisModuleCallReply,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CallOriginalArgv: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            cmdname: *const ::std::os::raw::c_char,
            argv: *mut *mut RedisModuleString,
            argc: ::std::os::raw::c_int,
        ) -> *mut RedisModuleCallReply,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CallOriginal: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            cmdname: *const ::std::os::raw::c_char,
            fmt: *const ::std::os::raw::c_char,
            ...
        ) -> *mut RedisModuleCallReply,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_Multi: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_Exec: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_SignalDirtyKey: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            keyname: *mut RedisModuleString,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplicateEx: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            flags: ::std::os::raw::c_int,
            cmdname: *const ::std::os::raw::c_char,
            fmt: *const ::std::os::raw::c_char,
            ...
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ReplicateVerbatimEx: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            flags: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_AppendOnlyPolicy:
        ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
}
unsafe extern "C" {
    pub static mut RedisModule_RegisterAOFSyncCallback: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            numlocal: ::std::os::raw::c_int,
            numreplicas: ::std::os::raw::c_int,
            callback: RedisModuleAppendOnlySyncCallback,
            privdata: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_UnregisterAOFSyncCallbacks: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetContextFromModuleKey: ::std::option::Option<
        unsafe extern "C" fn(key: *mut RedisModuleKey) -> *mut RedisModuleCtx,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_GetKeyMode: ::std::option::Option<
        unsafe extern "C" fn(key: *mut RedisModuleKey) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_NotifyKeyspaceEventEx: ::std::option::Option<
        unsafe extern "C" fn(
            type_: ::std::os::raw::c_int,
            event: *const ::std::os::raw::c_char,
            key: *mut RedisModuleString,
            dbid: ::std::os::raw::c_int,
            flags: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_AutoMemoryAdd: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            type_: ::std::os::raw::c_int,
            ptr: *mut ::std::os::raw::c_void,
        ),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_AutoMemoryFreed: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            type_: ::std::os::raw::c_int,
            ptr: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_CreateContextFromContext: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RedisModuleCtx,
            keepflags: ::std::os::raw::c_int,
        ) -> *mut RedisModuleCtx,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_DestroyContext:
        ::std::option::Option<unsafe extern "C" fn(ctx: *mut RedisModuleCtx)>;
}
unsafe extern "C" {
    pub static mut RedisModule_ScanCursorSetCursor: ::std::option::Option<
        unsafe extern "C" fn(cursor: *mut RedisModuleScanCursor, c: ::std::os::raw::c_ulonglong),
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ScanCursorGetCursor: ::std::option::Option<
        unsafe extern "C" fn(cursor: *mut RedisModuleScanCursor) -> ::std::os::raw::c_ulonglong,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_KeyTypeName: ::std::option::Option<
        unsafe extern "C" fn(kp: *mut RedisModuleKey) -> *const ::std::os::raw::c_char,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ShardingGetKeySlot: ::std::option::Option<
        unsafe extern "C" fn(keyname: *mut RedisModuleString) -> ::std::os::raw::c_int,
    >;
}
unsafe extern "C" {
    pub static mut RedisModule_ShardingGetSlotRange: ::std::option::Option<
        unsafe extern "C" fn(
            first_slot: *mut ::std::os::raw::c_int,
            last_slot: *mut ::std::os::raw::c_int,
        ),
    >;
}
pub type sds = *mut ::std::os::raw::c_char;
#[repr(C, packed)]
pub struct sdshdr5 {
    pub flags: ::std::os::raw::c_uchar,
    pub buf: __IncompleteArrayField<::std::os::raw::c_char>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdshdr5"][::std::mem::size_of::<sdshdr5>() - 1usize];
    ["Alignment of sdshdr5"][::std::mem::align_of::<sdshdr5>() - 1usize];
    ["Offset of field: sdshdr5::flags"][::std::mem::offset_of!(sdshdr5, flags) - 0usize];
    ["Offset of field: sdshdr5::buf"][::std::mem::offset_of!(sdshdr5, buf) - 1usize];
};
#[repr(C, packed)]
pub struct sdshdr8 {
    pub len: u8,
    pub alloc: u8,
    pub flags: ::std::os::raw::c_uchar,
    pub buf: __IncompleteArrayField<::std::os::raw::c_char>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdshdr8"][::std::mem::size_of::<sdshdr8>() - 3usize];
    ["Alignment of sdshdr8"][::std::mem::align_of::<sdshdr8>() - 1usize];
    ["Offset of field: sdshdr8::len"][::std::mem::offset_of!(sdshdr8, len) - 0usize];
    ["Offset of field: sdshdr8::alloc"][::std::mem::offset_of!(sdshdr8, alloc) - 1usize];
    ["Offset of field: sdshdr8::flags"][::std::mem::offset_of!(sdshdr8, flags) - 2usize];
    ["Offset of field: sdshdr8::buf"][::std::mem::offset_of!(sdshdr8, buf) - 3usize];
};
#[repr(C, packed)]
pub struct sdshdr16 {
    pub len: u16,
    pub alloc: u16,
    pub flags: ::std::os::raw::c_uchar,
    pub buf: __IncompleteArrayField<::std::os::raw::c_char>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdshdr16"][::std::mem::size_of::<sdshdr16>() - 5usize];
    ["Alignment of sdshdr16"][::std::mem::align_of::<sdshdr16>() - 1usize];
    ["Offset of field: sdshdr16::len"][::std::mem::offset_of!(sdshdr16, len) - 0usize];
    ["Offset of field: sdshdr16::alloc"][::std::mem::offset_of!(sdshdr16, alloc) - 2usize];
    ["Offset of field: sdshdr16::flags"][::std::mem::offset_of!(sdshdr16, flags) - 4usize];
    ["Offset of field: sdshdr16::buf"][::std::mem::offset_of!(sdshdr16, buf) - 5usize];
};
#[repr(C, packed)]
pub struct sdshdr32 {
    pub len: u32,
    pub alloc: u32,
    pub flags: ::std::os::raw::c_uchar,
    pub buf: __IncompleteArrayField<::std::os::raw::c_char>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdshdr32"][::std::mem::size_of::<sdshdr32>() - 9usize];
    ["Alignment of sdshdr32"][::std::mem::align_of::<sdshdr32>() - 1usize];
    ["Offset of field: sdshdr32::len"][::std::mem::offset_of!(sdshdr32, len) - 0usize];
    ["Offset of field: sdshdr32::alloc"][::std::mem::offset_of!(sdshdr32, alloc) - 4usize];
    ["Offset of field: sdshdr32::flags"][::std::mem::offset_of!(sdshdr32, flags) - 8usize];
    ["Offset of field: sdshdr32::buf"][::std::mem::offset_of!(sdshdr32, buf) - 9usize];
};
#[repr(C, packed)]
pub struct sdshdr64 {
    pub len: u64,
    pub alloc: u64,
    pub flags: ::std::os::raw::c_uchar,
    pub buf: __IncompleteArrayField<::std::os::raw::c_char>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdshdr64"][::std::mem::size_of::<sdshdr64>() - 17usize];
    ["Alignment of sdshdr64"][::std::mem::align_of::<sdshdr64>() - 1usize];
    ["Offset of field: sdshdr64::len"][::std::mem::offset_of!(sdshdr64, len) - 0usize];
    ["Offset of field: sdshdr64::alloc"][::std::mem::offset_of!(sdshdr64, alloc) - 8usize];
    ["Offset of field: sdshdr64::flags"][::std::mem::offset_of!(sdshdr64, flags) - 16usize];
    ["Offset of field: sdshdr64::buf"][::std::mem::offset_of!(sdshdr64, buf) - 17usize];
};
unsafe extern "C" {
    pub fn sdsnewlen(init: *const ::std::os::raw::c_void, initlen: usize) -> sds;
}
unsafe extern "C" {
    pub fn sdsnew(init: *const ::std::os::raw::c_char) -> sds;
}
unsafe extern "C" {
    pub fn sdsempty() -> sds;
}
unsafe extern "C" {
    pub fn sdsdup(s: sds) -> sds;
}
unsafe extern "C" {
    pub fn sdsfree(s: sds);
}
unsafe extern "C" {
    pub fn sdsgrowzero(s: sds, len: usize) -> sds;
}
unsafe extern "C" {
    pub fn sdscatlen(s: sds, t: *const ::std::os::raw::c_void, len: usize) -> sds;
}
unsafe extern "C" {
    pub fn sdscat(s: sds, t: *const ::std::os::raw::c_char) -> sds;
}
unsafe extern "C" {
    pub fn sdscatsds(s: sds, t: sds) -> sds;
}
unsafe extern "C" {
    pub fn sdscpylen(s: sds, t: *const ::std::os::raw::c_char, len: usize) -> sds;
}
unsafe extern "C" {
    pub fn sdscpy(s: sds, t: *const ::std::os::raw::c_char) -> sds;
}
unsafe extern "C" {
    pub fn sdscatvprintf(s: sds, fmt: *const ::std::os::raw::c_char, ap: va_list) -> sds;
}
unsafe extern "C" {
    pub fn sdscatprintf(s: sds, fmt: *const ::std::os::raw::c_char, ...) -> sds;
}
unsafe extern "C" {
    pub fn sdscatfmt(s: sds, fmt: *const ::std::os::raw::c_char, ...) -> sds;
}
unsafe extern "C" {
    pub fn sdstrim(s: sds, cset: *const ::std::os::raw::c_char) -> sds;
}
unsafe extern "C" {
    pub fn sdsrange(s: sds, start: isize, end: isize) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sdsupdatelen(s: sds);
}
unsafe extern "C" {
    pub fn sdsclear(s: sds);
}
unsafe extern "C" {
    pub fn sdscmp(s1: sds, s2: sds) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sdssplitlen(
        s: *const ::std::os::raw::c_char,
        len: ::std::os::raw::c_int,
        sep: *const ::std::os::raw::c_char,
        seplen: ::std::os::raw::c_int,
        count: *mut ::std::os::raw::c_int,
    ) -> *mut sds;
}
unsafe extern "C" {
    pub fn sdsfreesplitres(tokens: *mut sds, count: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn sdstolower(s: sds);
}
unsafe extern "C" {
    pub fn sdstoupper(s: sds);
}
unsafe extern "C" {
    pub fn sdsfromlonglong(value: ::std::os::raw::c_longlong) -> sds;
}
unsafe extern "C" {
    pub fn sdscatrepr(s: sds, p: *const ::std::os::raw::c_char, len: usize) -> sds;
}
unsafe extern "C" {
    pub fn sdssplitargs(
        line: *const ::std::os::raw::c_char,
        argc: *mut ::std::os::raw::c_int,
    ) -> *mut sds;
}
unsafe extern "C" {
    pub fn sdsmapchars(
        s: sds,
        from: *const ::std::os::raw::c_char,
        to: *const ::std::os::raw::c_char,
        setlen: usize,
    ) -> sds;
}
unsafe extern "C" {
    pub fn sdsjoin(
        argv: *mut *mut ::std::os::raw::c_char,
        argc: ::std::os::raw::c_int,
        sep: *mut ::std::os::raw::c_char,
    ) -> sds;
}
unsafe extern "C" {
    pub fn sdsjoinsds(
        argv: *mut sds,
        argc: ::std::os::raw::c_int,
        sep: *const ::std::os::raw::c_char,
        seplen: usize,
    ) -> sds;
}
unsafe extern "C" {
    pub fn sdsMakeRoomFor(s: sds, addlen: usize) -> sds;
}
unsafe extern "C" {
    pub fn sdsIncrLen(s: sds, incr: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn sdsRemoveFreeSpace(s: sds) -> sds;
}
unsafe extern "C" {
    pub fn sdsAllocSize(s: sds) -> usize;
}
unsafe extern "C" {
    pub fn sdsAllocPtr(s: sds) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn sds_malloc(size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn sds_realloc(
        ptr: *mut ::std::os::raw::c_void,
        size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn sds_free(ptr: *mut ::std::os::raw::c_void);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Vector {
    pub data: *mut ::std::os::raw::c_char,
    pub elemSize: usize,
    pub cap: usize,
    pub top: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Vector"][::std::mem::size_of::<Vector>() - 32usize];
    ["Alignment of Vector"][::std::mem::align_of::<Vector>() - 8usize];
    ["Offset of field: Vector::data"][::std::mem::offset_of!(Vector, data) - 0usize];
    ["Offset of field: Vector::elemSize"][::std::mem::offset_of!(Vector, elemSize) - 8usize];
    ["Offset of field: Vector::cap"][::std::mem::offset_of!(Vector, cap) - 16usize];
    ["Offset of field: Vector::top"][::std::mem::offset_of!(Vector, top) - 24usize];
};
unsafe extern "C" {
    pub fn __newVectorSize(elemSize: usize, cap: usize) -> *mut Vector;
}
unsafe extern "C" {
    pub fn __vector_PutPtr(
        v: *mut Vector,
        pos: usize,
        elem: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn Vector_Get(
        v: *mut Vector,
        pos: usize,
        ptr: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn Vector_Pop(v: *mut Vector, ptr: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __vector_PushPtr(
        v: *mut Vector,
        elem: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn Vector_Resize(v: *mut Vector, newcap: usize) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn Vector_Size(v: *mut Vector) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn Vector_Cap(v: *mut Vector) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn Vector_Free(v: *mut Vector);
}
unsafe extern "C" {
    pub fn Vector_FreeEx(
        v: *mut Vector,
        freeCB: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    );
}
unsafe extern "C" {
    pub fn __vecotr_PutPtr(
        v: *mut Vector,
        pos: usize,
        elem: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
#[doc = " Simple wrapper over any kind of string"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RString {
    pub s: *const ::std::os::raw::c_char,
    pub n: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RString"][::std::mem::size_of::<RString>() - 16usize];
    ["Alignment of RString"][::std::mem::align_of::<RString>() - 8usize];
    ["Offset of field: RString::s"][::std::mem::offset_of!(RString, s) - 0usize];
    ["Offset of field: RString::n"][::std::mem::offset_of!(RString, n) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Buffer {
    pub data: *mut ::std::os::raw::c_char,
    pub cap: usize,
    pub offset: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Buffer"][::std::mem::size_of::<Buffer>() - 24usize];
    ["Alignment of Buffer"][::std::mem::align_of::<Buffer>() - 8usize];
    ["Offset of field: Buffer::data"][::std::mem::offset_of!(Buffer, data) - 0usize];
    ["Offset of field: Buffer::cap"][::std::mem::offset_of!(Buffer, cap) - 8usize];
    ["Offset of field: Buffer::offset"][::std::mem::offset_of!(Buffer, offset) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BufferReader {
    pub buf: *mut Buffer,
    pub pos: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BufferReader"][::std::mem::size_of::<BufferReader>() - 16usize];
    ["Alignment of BufferReader"][::std::mem::align_of::<BufferReader>() - 8usize];
    ["Offset of field: BufferReader::buf"][::std::mem::offset_of!(BufferReader, buf) - 0usize];
    ["Offset of field: BufferReader::pos"][::std::mem::offset_of!(BufferReader, pos) - 8usize];
};
unsafe extern "C" {
    pub fn Buffer_Init(b: *mut Buffer, cap: usize);
}
unsafe extern "C" {
    pub fn Buffer_ReadByte(b: *mut BufferReader, c: *mut ::std::os::raw::c_char) -> usize;
}
unsafe extern "C" {
    pub fn Buffer_Seek(b: *mut BufferReader, offset: usize) -> usize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BufferWriter {
    pub buf: *mut Buffer,
    pub pos: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BufferWriter"][::std::mem::size_of::<BufferWriter>() - 16usize];
    ["Alignment of BufferWriter"][::std::mem::align_of::<BufferWriter>() - 8usize];
    ["Offset of field: BufferWriter::buf"][::std::mem::offset_of!(BufferWriter, buf) - 0usize];
    ["Offset of field: BufferWriter::pos"][::std::mem::offset_of!(BufferWriter, pos) - 8usize];
};
unsafe extern "C" {
    pub fn Buffer_Truncate(b: *mut Buffer, newlen: usize) -> usize;
}
unsafe extern "C" {
    pub fn Buffer_Grow(b: *mut Buffer, extraLen: usize) -> usize;
}
unsafe extern "C" {
    pub fn NewBufferWriter(b: *mut Buffer) -> BufferWriter;
}
unsafe extern "C" {
    pub fn NewBufferReader(b: *mut Buffer) -> BufferReader;
}
unsafe extern "C" {
    pub fn BufferWriter_Seek(b: *mut BufferWriter, offset: usize) -> usize;
}
unsafe extern "C" {
    pub fn Buffer_WriteAt(
        b: *mut BufferWriter,
        offset: usize,
        data: *mut ::std::os::raw::c_void,
        len: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn Buffer_Wrap(data: *mut ::std::os::raw::c_char, len: usize) -> *mut Buffer;
}
unsafe extern "C" {
    pub fn Buffer_Free(buf: *mut Buffer) -> usize;
}
#[doc = " The cursor model simply reads through the current argument list, advancing\n the 'offset' position as required. No tricky declarative syntax, and allows\n for finer grained error handling."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ArgsCursor {
    pub objs: *mut *mut ::std::os::raw::c_void,
    pub type_: ::std::os::raw::c_int,
    pub argc: usize,
    pub offset: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ArgsCursor"][::std::mem::size_of::<ArgsCursor>() - 32usize];
    ["Alignment of ArgsCursor"][::std::mem::align_of::<ArgsCursor>() - 8usize];
    ["Offset of field: ArgsCursor::objs"][::std::mem::offset_of!(ArgsCursor, objs) - 0usize];
    ["Offset of field: ArgsCursor::type_"][::std::mem::offset_of!(ArgsCursor, type_) - 8usize];
    ["Offset of field: ArgsCursor::argc"][::std::mem::offset_of!(ArgsCursor, argc) - 16usize];
    ["Offset of field: ArgsCursor::offset"][::std::mem::offset_of!(ArgsCursor, offset) - 24usize];
};
#[doc = " A type with size `N`."]
pub type Size_38 = [u8; 38usize];
#[doc = " An opaque query error which can be passed by value to C.\n\n The size and alignment of this struct must match the Rust `QueryError`\n structure exactly."]
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct QueryError {
    pub _0: Size_38,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of QueryError"][::std::mem::size_of::<QueryError>() - 40usize];
    ["Alignment of QueryError"][::std::mem::align_of::<QueryError>() - 8usize];
    ["Offset of field: QueryError::_0"][::std::mem::offset_of!(QueryError, _0) - 0usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct array_hdr_t {
    pub len: u32,
    pub remain_cap: u16,
    pub elem_sz: u16,
    pub buf: __IncompleteArrayField<::std::os::raw::c_char>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of array_hdr_t"][::std::mem::size_of::<array_hdr_t>() - 8usize];
    ["Alignment of array_hdr_t"][::std::mem::align_of::<array_hdr_t>() - 4usize];
    ["Offset of field: array_hdr_t::len"][::std::mem::offset_of!(array_hdr_t, len) - 0usize];
    ["Offset of field: array_hdr_t::remain_cap"]
        [::std::mem::offset_of!(array_hdr_t, remain_cap) - 4usize];
    ["Offset of field: array_hdr_t::elem_sz"]
        [::std::mem::offset_of!(array_hdr_t, elem_sz) - 6usize];
    ["Offset of field: array_hdr_t::buf"][::std::mem::offset_of!(array_hdr_t, buf) - 8usize];
};
pub type array_t = *mut ::std::os::raw::c_void;
unsafe extern "C" {
    pub fn array_len_func(arr: array_t) -> u32;
}
unsafe extern "C" {
    pub fn array_new_sz(elem_sz: u16, remain_cap: u16, len: u32) -> array_t;
}
unsafe extern "C" {
    pub fn array_free(arr: array_t);
}
unsafe extern "C" {
    pub fn array_ensure_append_n_func(arr: array_t, src: array_t, n: u16, elem_sz: u16) -> array_t;
}
unsafe extern "C" {
    pub fn array_clear_func(arr: array_t, elem_sz: u16) -> array_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RSValue {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModule_Reply_StackEntry {
    pub count: ::std::os::raw::c_int,
    pub type_: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModule_Reply_StackEntry"]
        [::std::mem::size_of::<RedisModule_Reply_StackEntry>() - 8usize];
    ["Alignment of RedisModule_Reply_StackEntry"]
        [::std::mem::align_of::<RedisModule_Reply_StackEntry>() - 4usize];
    ["Offset of field: RedisModule_Reply_StackEntry::count"]
        [::std::mem::offset_of!(RedisModule_Reply_StackEntry, count) - 0usize];
    ["Offset of field: RedisModule_Reply_StackEntry::type_"]
        [::std::mem::offset_of!(RedisModule_Reply_StackEntry, type_) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RedisModule_Reply {
    pub ctx: *mut RedisModuleCtx,
    pub resp3: bool,
    pub count: ::std::os::raw::c_int,
    pub stack: *mut RedisModule_Reply_StackEntry,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RedisModule_Reply"][::std::mem::size_of::<RedisModule_Reply>() - 24usize];
    ["Alignment of RedisModule_Reply"][::std::mem::align_of::<RedisModule_Reply>() - 8usize];
    ["Offset of field: RedisModule_Reply::ctx"]
        [::std::mem::offset_of!(RedisModule_Reply, ctx) - 0usize];
    ["Offset of field: RedisModule_Reply::resp3"]
        [::std::mem::offset_of!(RedisModule_Reply, resp3) - 8usize];
    ["Offset of field: RedisModule_Reply::count"]
        [::std::mem::offset_of!(RedisModule_Reply, count) - 12usize];
    ["Offset of field: RedisModule_Reply::stack"]
        [::std::mem::offset_of!(RedisModule_Reply, stack) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __darwin_time_t,
    pub tv_nsec: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub const RSLanguage_RS_LANG_ENGLISH: RSLanguage = 0;
pub const RSLanguage_RS_LANG_ARABIC: RSLanguage = 1;
pub const RSLanguage_RS_LANG_BASQUE: RSLanguage = 2;
pub const RSLanguage_RS_LANG_CATALAN: RSLanguage = 3;
pub const RSLanguage_RS_LANG_CHINESE: RSLanguage = 4;
pub const RSLanguage_RS_LANG_DANISH: RSLanguage = 5;
pub const RSLanguage_RS_LANG_DUTCH: RSLanguage = 6;
pub const RSLanguage_RS_LANG_FINNISH: RSLanguage = 7;
pub const RSLanguage_RS_LANG_FRENCH: RSLanguage = 8;
pub const RSLanguage_RS_LANG_GERMAN: RSLanguage = 9;
pub const RSLanguage_RS_LANG_GREEK: RSLanguage = 10;
pub const RSLanguage_RS_LANG_HINDI: RSLanguage = 11;
pub const RSLanguage_RS_LANG_HUNGARIAN: RSLanguage = 12;
pub const RSLanguage_RS_LANG_ITALIAN: RSLanguage = 13;
pub const RSLanguage_RS_LANG_INDONESIAN: RSLanguage = 14;
pub const RSLanguage_RS_LANG_IRISH: RSLanguage = 15;
pub const RSLanguage_RS_LANG_LITHUANIAN: RSLanguage = 16;
pub const RSLanguage_RS_LANG_NEPALI: RSLanguage = 17;
pub const RSLanguage_RS_LANG_NORWEGIAN: RSLanguage = 18;
pub const RSLanguage_RS_LANG_PORTUGUESE: RSLanguage = 19;
pub const RSLanguage_RS_LANG_ROMANIAN: RSLanguage = 20;
pub const RSLanguage_RS_LANG_RUSSIAN: RSLanguage = 21;
pub const RSLanguage_RS_LANG_SPANISH: RSLanguage = 22;
pub const RSLanguage_RS_LANG_SWEDISH: RSLanguage = 23;
pub const RSLanguage_RS_LANG_TAMIL: RSLanguage = 24;
pub const RSLanguage_RS_LANG_TURKISH: RSLanguage = 25;
pub const RSLanguage_RS_LANG_ARMENIAN: RSLanguage = 26;
pub const RSLanguage_RS_LANG_SERBIAN: RSLanguage = 27;
pub const RSLanguage_RS_LANG_YIDDISH: RSLanguage = 28;
pub const RSLanguage_RS_LANG_UNSUPPORTED: RSLanguage = 29;
pub const RSLanguage_RS_LANG_UNSET: RSLanguage = 30;
pub type RSLanguage = ::std::os::raw::c_uint;
pub const StemmerType_SnowballStemmer: StemmerType = 0;
pub type StemmerType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stemmer {
    pub ctx: *mut ::std::os::raw::c_void,
    pub Stem: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut ::std::os::raw::c_void,
            word: *const ::std::os::raw::c_char,
            len: usize,
            outlen: *mut usize,
        ) -> *const ::std::os::raw::c_char,
    >,
    pub Free: ::std::option::Option<unsafe extern "C" fn(arg1: *mut stemmer)>,
    pub Reset: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut stemmer,
            type_: StemmerType,
            language: RSLanguage,
        ) -> ::std::os::raw::c_int,
    >,
    pub language: RSLanguage,
    pub type_: StemmerType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of stemmer"][::std::mem::size_of::<stemmer>() - 40usize];
    ["Alignment of stemmer"][::std::mem::align_of::<stemmer>() - 8usize];
    ["Offset of field: stemmer::ctx"][::std::mem::offset_of!(stemmer, ctx) - 0usize];
    ["Offset of field: stemmer::Stem"][::std::mem::offset_of!(stemmer, Stem) - 8usize];
    ["Offset of field: stemmer::Free"][::std::mem::offset_of!(stemmer, Free) - 16usize];
    ["Offset of field: stemmer::Reset"][::std::mem::offset_of!(stemmer, Reset) - 24usize];
    ["Offset of field: stemmer::language"][::std::mem::offset_of!(stemmer, language) - 32usize];
    ["Offset of field: stemmer::type_"][::std::mem::offset_of!(stemmer, type_) - 36usize];
};
pub type Stemmer = stemmer;
#[doc = " The header of a [`ThinVec`](crate::ThinVec)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Header_u16 {
    pub len: u16,
    pub cap: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Header_u16"][::std::mem::size_of::<Header_u16>() - 4usize];
    ["Alignment of Header_u16"][::std::mem::align_of::<Header_u16>() - 2usize];
    ["Offset of field: Header_u16::len"][::std::mem::offset_of!(Header_u16, len) - 0usize];
    ["Offset of field: Header_u16::cap"][::std::mem::offset_of!(Header_u16, cap) - 2usize];
};
#[doc = " Forward declarations which will be defined in `redisearch.h`"]
pub type RSDocumentMetadata = RSDocumentMetadata_s;
pub type t_docId = u64;
pub type t_fieldIndex = u16;
pub type t_fieldMask = __uint128_t;
#[doc = " one of the fields need to be valid."]
pub const FieldExpirationPredicate_FIELD_EXPIRATION_PREDICATE_DEFAULT: FieldExpirationPredicate = 0;
#[doc = " one of the fields need to be expired for the entry to be considered missing."]
pub const FieldExpirationPredicate_FIELD_EXPIRATION_PREDICATE_MISSING: FieldExpirationPredicate = 1;
#[doc = " Field expiration predicate used when checking fields."]
pub type FieldExpirationPredicate = ::std::os::raw::c_uint;
#[doc = " Filter details to apply to numeric values"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NumericFilter {
    #[doc = " The field specification which this filter is acting on"]
    pub fieldSpec: *const FieldSpec,
    #[doc = " Beginning of the range"]
    pub min: f64,
    #[doc = " End of the range"]
    pub max: f64,
    #[doc = " Geo filter, if any"]
    pub geoFilter: *const ::std::os::raw::c_void,
    #[doc = " Range includes the min value"]
    pub minInclusive: bool,
    #[doc = " Range includes the max value"]
    pub maxInclusive: bool,
    #[doc = " Order of SORTBY (ascending/descending)"]
    pub ascending: bool,
    #[doc = " Minimum number of results needed"]
    pub limit: usize,
    #[doc = " Number of results to skip"]
    pub offset: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of NumericFilter"][::std::mem::size_of::<NumericFilter>() - 56usize];
    ["Alignment of NumericFilter"][::std::mem::align_of::<NumericFilter>() - 8usize];
    ["Offset of field: NumericFilter::fieldSpec"]
        [::std::mem::offset_of!(NumericFilter, fieldSpec) - 0usize];
    ["Offset of field: NumericFilter::min"][::std::mem::offset_of!(NumericFilter, min) - 8usize];
    ["Offset of field: NumericFilter::max"][::std::mem::offset_of!(NumericFilter, max) - 16usize];
    ["Offset of field: NumericFilter::geoFilter"]
        [::std::mem::offset_of!(NumericFilter, geoFilter) - 24usize];
    ["Offset of field: NumericFilter::minInclusive"]
        [::std::mem::offset_of!(NumericFilter, minInclusive) - 32usize];
    ["Offset of field: NumericFilter::maxInclusive"]
        [::std::mem::offset_of!(NumericFilter, maxInclusive) - 33usize];
    ["Offset of field: NumericFilter::ascending"]
        [::std::mem::offset_of!(NumericFilter, ascending) - 34usize];
    ["Offset of field: NumericFilter::limit"]
        [::std::mem::offset_of!(NumericFilter, limit) - 40usize];
    ["Offset of field: NumericFilter::offset"]
        [::std::mem::offset_of!(NumericFilter, offset) - 48usize];
};
#[doc = " See the crate's top level documentation for a description of this type."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ThinVec______RSIndexResult__u16 {
    pub ptr: *mut Header_u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ThinVec______RSIndexResult__u16"]
        [::std::mem::size_of::<ThinVec______RSIndexResult__u16>() - 8usize];
    ["Alignment of ThinVec______RSIndexResult__u16"]
        [::std::mem::align_of::<ThinVec______RSIndexResult__u16>() - 8usize];
    ["Offset of field: ThinVec______RSIndexResult__u16::ptr"]
        [::std::mem::offset_of!(ThinVec______RSIndexResult__u16, ptr) - 0usize];
};
#[doc = " A [`ThinVec`] with `u16` capacity, supporting up to 65,535 elements.\n\n This is useful when you know the vector will never exceed 65,535 elements\n and want to minimize header overhead (4 bytes instead of 16)."]
pub type SmallThinVecRSIndexResult = ThinVec______RSIndexResult__u16;
#[doc = " Represents a set of flags of some type `T`.\n `T` must have the `#[bitflags]` attribute applied.\n\n A `BitFlags<T>` is as large as the `T` itself,\n and stores one flag per bit.\n\n ## Comparison operators, [`PartialOrd`] and [`Ord`]\n\n To make it possible to use `BitFlags` as the key of a\n [`BTreeMap`][std::collections::BTreeMap], `BitFlags` implements\n [`Ord`]. There is no meaningful total order for bitflags,\n so the implementation simply compares the integer values of the bits.\n\n Unfortunately, this means that comparing `BitFlags` with an operator\n like `<=` will compile, and return values that are probably useless\n and not what you expect. In particular, `<=` does *not* check whether\n one value is a subset of the other. Use [`BitFlags::contains`] for that.\n\n ## Customizing `Default`\n\n By default, creating an instance of `BitFlags<T>` with `Default` will result\n in an empty set. If that's undesirable, you may customize this:\n\n ```\n # use enumflags2::{BitFlags, bitflags};\n #[bitflags(default = B | C)]\n #[repr(u8)]\n #[derive(Copy, Clone, Debug, PartialEq)]\n enum MyFlag {\n     A = 0b0001,\n     B = 0b0010,\n     C = 0b0100,\n     D = 0b1000,\n }\n\n assert_eq!(BitFlags::default(), MyFlag::B | MyFlag::C);\n ```\n\n ## Memory layout\n\n `BitFlags<T>` is marked with the `#[repr(transparent)]` trait, meaning\n it can be safely transmuted into the corresponding numeric type.\n\n Usually, the same can be achieved by using [`BitFlags::bits`] in one\n direction, and [`BitFlags::from_bits`], [`BitFlags::from_bits_truncate`],\n or [`BitFlags::from_bits_unchecked`] in the other direction. However,\n transmuting might still be useful if, for example, you're dealing with\n an entire array of `BitFlags`.\n\n When transmuting *into* a `BitFlags`, make sure that each set bit\n corresponds to an existing flag\n (cf. [`from_bits_unchecked`][BitFlags::from_bits_unchecked]).\n\n For example:\n\n ```\n # use enumflags2::{BitFlags, bitflags};\n #[bitflags]\n #[repr(u8)] // <-- the repr determines the numeric type\n #[derive(Copy, Clone)]\n enum TransmuteMe {\n     One = 1 << 0,\n     Two = 1 << 1,\n }\n\n # use std::slice;\n // NOTE: we use a small, self-contained function to handle the slice\n // conversion to make sure the lifetimes are right.\n fn transmute_slice<'a>(input: &'a [BitFlags<TransmuteMe>]) -> &'a [u8] {\n     unsafe {\n         slice::from_raw_parts(input.as_ptr() as *const u8, input.len())\n     }\n }\n\n let many_flags = &[\n     TransmuteMe::One.into(),\n     TransmuteMe::One | TransmuteMe::Two,\n ];\n\n let as_nums = transmute_slice(many_flags);\n assert_eq!(as_nums, &[0b01, 0b11]);\n ```\n\n ## Implementation notes\n\n You might expect this struct to be defined as\n\n ```ignore\n struct BitFlags<T: BitFlag> {\n     value: T::Numeric\n }\n ```\n\n Ideally, that would be the case. However, because `const fn`s cannot\n have trait bounds in current Rust, this would prevent us from providing\n most `const fn` APIs. As a workaround, we define `BitFlags` with two\n type parameters, with a default for the second one:\n\n ```ignore\n struct BitFlags<T, N = <T as BitFlag>::Numeric> {\n     value: N,\n     marker: PhantomData<T>,\n }\n ```\n\n Manually providing a type for the `N` type parameter shouldn't ever\n be necessary.\n\n The types substituted for `T` and `N` must always match, creating a\n `BitFlags` value where that isn't the case is only possible with\n incorrect unsafe code."]
pub type BitFlags_RSResultKind__u8 = u8;
pub type RSResultKindMask = BitFlags_RSResultKind__u8;
#[doc = " See the crate's top level documentation for a description of this type."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ThinVec_____RSIndexResult__u16 {
    pub ptr: *mut Header_u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ThinVec_____RSIndexResult__u16"]
        [::std::mem::size_of::<ThinVec_____RSIndexResult__u16>() - 8usize];
    ["Alignment of ThinVec_____RSIndexResult__u16"]
        [::std::mem::align_of::<ThinVec_____RSIndexResult__u16>() - 8usize];
    ["Offset of field: ThinVec_____RSIndexResult__u16::ptr"]
        [::std::mem::offset_of!(ThinVec_____RSIndexResult__u16, ptr) - 0usize];
};
#[doc = " A [`ThinVec`] with `u16` capacity, supporting up to 65,535 elements.\n\n This is useful when you know the vector will never exceed 65,535 elements\n and want to minimize header overhead (4 bytes instead of 16)."]
pub type SmallThinVecRSIndexResultOwned = ThinVec_____RSIndexResult__u16;
pub const RSAggregateResult_Tag_RSAggregateResult_Borrowed: RSAggregateResult_Tag = 0;
pub const RSAggregateResult_Tag_RSAggregateResult_Owned: RSAggregateResult_Tag = 1;
pub type RSAggregateResult_Tag = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RSAggregateResult_Borrowed_Body {
    pub tag: RSAggregateResult_Tag,
    #[doc = " The records making up this aggregate result\n\n The `RSAggregateResult` is part of a union in [`super::result_data::RSResultData`], so it needs to have a\n known size. The std `Vec` won't have this since it is not `#[repr(C)]`, so we use our\n own `ThinVec` type which is `#[repr(C)]` and has a known size instead.\n\n This requires `'index` on the reference because adding a new lifetime will cause the\n type to be `ThinVec<&'refs RSIndexResult<'index, 'refs>>` which will require\n `'index: 'refs` else it would mean the `'index` can be cleaned up while some reference\n will still try to access it (ie a dangling pointer). Now the decoders will never return\n any aggregate results so `'refs == 'static` when decoding. Because of the requirement\n above, this means `'index: 'static` which is just incorrect since the index data will\n never be `'static` when decoding."]
    pub records: SmallThinVecRSIndexResult,
    #[doc = " A map of the aggregate kind of the underlying records"]
    pub kind_mask: RSResultKindMask,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSAggregateResult_Borrowed_Body"]
        [::std::mem::size_of::<RSAggregateResult_Borrowed_Body>() - 24usize];
    ["Alignment of RSAggregateResult_Borrowed_Body"]
        [::std::mem::align_of::<RSAggregateResult_Borrowed_Body>() - 8usize];
    ["Offset of field: RSAggregateResult_Borrowed_Body::tag"]
        [::std::mem::offset_of!(RSAggregateResult_Borrowed_Body, tag) - 0usize];
    ["Offset of field: RSAggregateResult_Borrowed_Body::records"]
        [::std::mem::offset_of!(RSAggregateResult_Borrowed_Body, records) - 8usize];
    ["Offset of field: RSAggregateResult_Borrowed_Body::kind_mask"]
        [::std::mem::offset_of!(RSAggregateResult_Borrowed_Body, kind_mask) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RSAggregateResult_Owned_Body {
    pub tag: RSAggregateResult_Tag,
    #[doc = " The records making up this aggregate result\n\n The `RSAggregateResult` is part of a union in [`super::result_data::RSResultData`], so it needs to have a\n known size. The std `Vec` won't have this since it is not `#[repr(C)]`, so we use our\n own `ThinVec` type which is `#[repr(C)]` and has a known size instead."]
    pub records: SmallThinVecRSIndexResultOwned,
    #[doc = " A map of the aggregate kind of the underlying records"]
    pub kind_mask: RSResultKindMask,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSAggregateResult_Owned_Body"]
        [::std::mem::size_of::<RSAggregateResult_Owned_Body>() - 24usize];
    ["Alignment of RSAggregateResult_Owned_Body"]
        [::std::mem::align_of::<RSAggregateResult_Owned_Body>() - 8usize];
    ["Offset of field: RSAggregateResult_Owned_Body::tag"]
        [::std::mem::offset_of!(RSAggregateResult_Owned_Body, tag) - 0usize];
    ["Offset of field: RSAggregateResult_Owned_Body::records"]
        [::std::mem::offset_of!(RSAggregateResult_Owned_Body, records) - 8usize];
    ["Offset of field: RSAggregateResult_Owned_Body::kind_mask"]
        [::std::mem::offset_of!(RSAggregateResult_Owned_Body, kind_mask) - 16usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union RSAggregateResult {
    pub tag: RSAggregateResult_Tag,
    pub borrowed: RSAggregateResult_Borrowed_Body,
    pub owned: RSAggregateResult_Owned_Body,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSAggregateResult"][::std::mem::size_of::<RSAggregateResult>() - 24usize];
    ["Alignment of RSAggregateResult"][::std::mem::align_of::<RSAggregateResult>() - 8usize];
    ["Offset of field: RSAggregateResult::tag"]
        [::std::mem::offset_of!(RSAggregateResult, tag) - 0usize];
    ["Offset of field: RSAggregateResult::borrowed"]
        [::std::mem::offset_of!(RSAggregateResult, borrowed) - 0usize];
    ["Offset of field: RSAggregateResult::owned"]
        [::std::mem::offset_of!(RSAggregateResult, owned) - 0usize];
};
#[doc = " Borrowed view of the encoded offsets of a term in a document. You can read the offsets by\n iterating over it with RSIndexResult_IterateOffsets.\n\n This is a borrowed, `Copy` type — it does not own the data and will not free it on drop.\n Use [`RSOffsetVector`] for owned offset data."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RSOffsetVector {
    #[doc = " Pointer to the borrowed offset data."]
    pub data: *const u8,
    pub len: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSOffsetVector"][::std::mem::size_of::<RSOffsetVector>() - 16usize];
    ["Alignment of RSOffsetVector"][::std::mem::align_of::<RSOffsetVector>() - 8usize];
    ["Offset of field: RSOffsetVector::data"]
        [::std::mem::offset_of!(RSOffsetVector, data) - 0usize];
    ["Offset of field: RSOffsetVector::len"][::std::mem::offset_of!(RSOffsetVector, len) - 8usize];
};
pub const RSTermRecord_Tag_RSTermRecord_Borrowed: RSTermRecord_Tag = 0;
pub const RSTermRecord_Tag_RSTermRecord_Owned: RSTermRecord_Tag = 1;
pub type RSTermRecord_Tag = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RSTermRecord_Borrowed_Body {
    pub tag: RSTermRecord_Tag,
    #[doc = " The term that brought up this record.\n\n The term is owned by the record. The name of the variant, `Borrowed`,\n refers to the `offsets` field.\n\n The term is wrapped in a `Box` to ensure that both `Owned` and `Borrowed`\n variants have the same memory layout."]
    pub term: *mut RSQueryTerm,
    #[doc = " The encoded offsets in which the term appeared in the document\n\n A decoder can choose to borrow this data from the index block, hence the `'index` lifetime."]
    pub offsets: RSOffsetVector,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSTermRecord_Borrowed_Body"]
        [::std::mem::size_of::<RSTermRecord_Borrowed_Body>() - 32usize];
    ["Alignment of RSTermRecord_Borrowed_Body"]
        [::std::mem::align_of::<RSTermRecord_Borrowed_Body>() - 8usize];
    ["Offset of field: RSTermRecord_Borrowed_Body::tag"]
        [::std::mem::offset_of!(RSTermRecord_Borrowed_Body, tag) - 0usize];
    ["Offset of field: RSTermRecord_Borrowed_Body::term"]
        [::std::mem::offset_of!(RSTermRecord_Borrowed_Body, term) - 8usize];
    ["Offset of field: RSTermRecord_Borrowed_Body::offsets"]
        [::std::mem::offset_of!(RSTermRecord_Borrowed_Body, offsets) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RSTermRecord_Owned_Body {
    pub tag: RSTermRecord_Tag,
    #[doc = " The term that brought up this record.\n\n It borrows the term from another record.\n The name of the variant, `Owned`, refers to the `offsets` field."]
    pub term: *const RSQueryTerm,
    #[doc = " The encoded offsets in which the term appeared in the document\n\n The owned version owns a copy of the offsets data, which is freed on drop."]
    pub offsets: RSOffsetVector,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSTermRecord_Owned_Body"][::std::mem::size_of::<RSTermRecord_Owned_Body>() - 32usize];
    ["Alignment of RSTermRecord_Owned_Body"]
        [::std::mem::align_of::<RSTermRecord_Owned_Body>() - 8usize];
    ["Offset of field: RSTermRecord_Owned_Body::tag"]
        [::std::mem::offset_of!(RSTermRecord_Owned_Body, tag) - 0usize];
    ["Offset of field: RSTermRecord_Owned_Body::term"]
        [::std::mem::offset_of!(RSTermRecord_Owned_Body, term) - 8usize];
    ["Offset of field: RSTermRecord_Owned_Body::offsets"]
        [::std::mem::offset_of!(RSTermRecord_Owned_Body, offsets) - 16usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union RSTermRecord {
    pub tag: RSTermRecord_Tag,
    pub borrowed: RSTermRecord_Borrowed_Body,
    pub owned: RSTermRecord_Owned_Body,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSTermRecord"][::std::mem::size_of::<RSTermRecord>() - 32usize];
    ["Alignment of RSTermRecord"][::std::mem::align_of::<RSTermRecord>() - 8usize];
    ["Offset of field: RSTermRecord::tag"][::std::mem::offset_of!(RSTermRecord, tag) - 0usize];
    ["Offset of field: RSTermRecord::borrowed"]
        [::std::mem::offset_of!(RSTermRecord, borrowed) - 0usize];
    ["Offset of field: RSTermRecord::owned"][::std::mem::offset_of!(RSTermRecord, owned) - 0usize];
};
pub const RSResultData_Tag_RSResultData_Union: RSResultData_Tag = 1;
pub const RSResultData_Tag_RSResultData_Intersection: RSResultData_Tag = 2;
pub const RSResultData_Tag_RSResultData_Term: RSResultData_Tag = 4;
pub const RSResultData_Tag_RSResultData_Virtual: RSResultData_Tag = 8;
pub const RSResultData_Tag_RSResultData_Numeric: RSResultData_Tag = 16;
pub const RSResultData_Tag_RSResultData_Metric: RSResultData_Tag = 32;
pub const RSResultData_Tag_RSResultData_HybridMetric: RSResultData_Tag = 64;
pub type RSResultData_Tag = u8;
#[repr(C)]
#[derive(Copy, Clone)]
pub union RSResultData {
    pub tag: RSResultData_Tag,
    pub __bindgen_anon_1: RSResultData__bindgen_ty_1,
    pub __bindgen_anon_2: RSResultData__bindgen_ty_2,
    pub __bindgen_anon_3: RSResultData__bindgen_ty_3,
    pub __bindgen_anon_4: RSResultData__bindgen_ty_4,
    pub __bindgen_anon_5: RSResultData__bindgen_ty_5,
    pub __bindgen_anon_6: RSResultData__bindgen_ty_6,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct RSResultData__bindgen_ty_1 {
    pub union_tag: RSResultData_Tag,
    pub union_: RSAggregateResult,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSResultData__bindgen_ty_1"]
        [::std::mem::size_of::<RSResultData__bindgen_ty_1>() - 32usize];
    ["Alignment of RSResultData__bindgen_ty_1"]
        [::std::mem::align_of::<RSResultData__bindgen_ty_1>() - 8usize];
    ["Offset of field: RSResultData__bindgen_ty_1::union_tag"]
        [::std::mem::offset_of!(RSResultData__bindgen_ty_1, union_tag) - 0usize];
    ["Offset of field: RSResultData__bindgen_ty_1::union_"]
        [::std::mem::offset_of!(RSResultData__bindgen_ty_1, union_) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct RSResultData__bindgen_ty_2 {
    pub intersection_tag: RSResultData_Tag,
    pub intersection: RSAggregateResult,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSResultData__bindgen_ty_2"]
        [::std::mem::size_of::<RSResultData__bindgen_ty_2>() - 32usize];
    ["Alignment of RSResultData__bindgen_ty_2"]
        [::std::mem::align_of::<RSResultData__bindgen_ty_2>() - 8usize];
    ["Offset of field: RSResultData__bindgen_ty_2::intersection_tag"]
        [::std::mem::offset_of!(RSResultData__bindgen_ty_2, intersection_tag) - 0usize];
    ["Offset of field: RSResultData__bindgen_ty_2::intersection"]
        [::std::mem::offset_of!(RSResultData__bindgen_ty_2, intersection) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct RSResultData__bindgen_ty_3 {
    pub term_tag: RSResultData_Tag,
    pub term: RSTermRecord,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSResultData__bindgen_ty_3"]
        [::std::mem::size_of::<RSResultData__bindgen_ty_3>() - 40usize];
    ["Alignment of RSResultData__bindgen_ty_3"]
        [::std::mem::align_of::<RSResultData__bindgen_ty_3>() - 8usize];
    ["Offset of field: RSResultData__bindgen_ty_3::term_tag"]
        [::std::mem::offset_of!(RSResultData__bindgen_ty_3, term_tag) - 0usize];
    ["Offset of field: RSResultData__bindgen_ty_3::term"]
        [::std::mem::offset_of!(RSResultData__bindgen_ty_3, term) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RSResultData__bindgen_ty_4 {
    pub numeric_tag: RSResultData_Tag,
    pub numeric: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSResultData__bindgen_ty_4"]
        [::std::mem::size_of::<RSResultData__bindgen_ty_4>() - 16usize];
    ["Alignment of RSResultData__bindgen_ty_4"]
        [::std::mem::align_of::<RSResultData__bindgen_ty_4>() - 8usize];
    ["Offset of field: RSResultData__bindgen_ty_4::numeric_tag"]
        [::std::mem::offset_of!(RSResultData__bindgen_ty_4, numeric_tag) - 0usize];
    ["Offset of field: RSResultData__bindgen_ty_4::numeric"]
        [::std::mem::offset_of!(RSResultData__bindgen_ty_4, numeric) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RSResultData__bindgen_ty_5 {
    pub metric_tag: RSResultData_Tag,
    pub metric: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSResultData__bindgen_ty_5"]
        [::std::mem::size_of::<RSResultData__bindgen_ty_5>() - 16usize];
    ["Alignment of RSResultData__bindgen_ty_5"]
        [::std::mem::align_of::<RSResultData__bindgen_ty_5>() - 8usize];
    ["Offset of field: RSResultData__bindgen_ty_5::metric_tag"]
        [::std::mem::offset_of!(RSResultData__bindgen_ty_5, metric_tag) - 0usize];
    ["Offset of field: RSResultData__bindgen_ty_5::metric"]
        [::std::mem::offset_of!(RSResultData__bindgen_ty_5, metric) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct RSResultData__bindgen_ty_6 {
    pub hybrid_metric_tag: RSResultData_Tag,
    pub hybrid_metric: RSAggregateResult,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSResultData__bindgen_ty_6"]
        [::std::mem::size_of::<RSResultData__bindgen_ty_6>() - 32usize];
    ["Alignment of RSResultData__bindgen_ty_6"]
        [::std::mem::align_of::<RSResultData__bindgen_ty_6>() - 8usize];
    ["Offset of field: RSResultData__bindgen_ty_6::hybrid_metric_tag"]
        [::std::mem::offset_of!(RSResultData__bindgen_ty_6, hybrid_metric_tag) - 0usize];
    ["Offset of field: RSResultData__bindgen_ty_6::hybrid_metric"]
        [::std::mem::offset_of!(RSResultData__bindgen_ty_6, hybrid_metric) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSResultData"][::std::mem::size_of::<RSResultData>() - 40usize];
    ["Alignment of RSResultData"][::std::mem::align_of::<RSResultData>() - 8usize];
    ["Offset of field: RSResultData::tag"][::std::mem::offset_of!(RSResultData, tag) - 0usize];
};
#[doc = " The result of an inverted index"]
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct RSIndexResult {
    #[doc = " The document ID of the result"]
    pub docId: t_docId,
    #[doc = " Some metadata about the result document"]
    pub dmd: *const RSDocumentMetadata,
    #[doc = " The aggregate field mask of all the records in this result"]
    pub fieldMask: t_fieldMask,
    #[doc = " The total frequency of all the records in this result"]
    pub freq: u32,
    #[doc = " The actual data of the result"]
    pub data: RSResultData,
    #[doc = " Holds an array of metrics yielded by the different iterators in the AST"]
    pub metrics: *mut RSYieldableMetric,
    #[doc = " Relative weight for scoring calculations. This is derived from the result's iterator weight"]
    pub weight: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSIndexResult"][::std::mem::size_of::<RSIndexResult>() - 96usize];
    ["Alignment of RSIndexResult"][::std::mem::align_of::<RSIndexResult>() - 16usize];
    ["Offset of field: RSIndexResult::docId"]
        [::std::mem::offset_of!(RSIndexResult, docId) - 0usize];
    ["Offset of field: RSIndexResult::dmd"][::std::mem::offset_of!(RSIndexResult, dmd) - 8usize];
    ["Offset of field: RSIndexResult::fieldMask"]
        [::std::mem::offset_of!(RSIndexResult, fieldMask) - 16usize];
    ["Offset of field: RSIndexResult::freq"][::std::mem::offset_of!(RSIndexResult, freq) - 32usize];
    ["Offset of field: RSIndexResult::data"][::std::mem::offset_of!(RSIndexResult, data) - 40usize];
    ["Offset of field: RSIndexResult::metrics"]
        [::std::mem::offset_of!(RSIndexResult, metrics) - 80usize];
    ["Offset of field: RSIndexResult::weight"]
        [::std::mem::offset_of!(RSIndexResult, weight) - 88usize];
};
#[doc = " A view over the records stored inside an [`RSAggregateResult`].\n\n It is designed to minimize the overhead of iterating over the records on\n the C side, by providing a direct pointer to the records and avoiding unnecessary\n C->Rust FFI calls."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AggregateRecordsSlice {
    pub ptr: *const *const RSIndexResult,
    pub len: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AggregateRecordsSlice"][::std::mem::size_of::<AggregateRecordsSlice>() - 16usize];
    ["Alignment of AggregateRecordsSlice"]
        [::std::mem::align_of::<AggregateRecordsSlice>() - 8usize];
    ["Offset of field: AggregateRecordsSlice::ptr"]
        [::std::mem::offset_of!(AggregateRecordsSlice, ptr) - 0usize];
    ["Offset of field: AggregateRecordsSlice::len"]
        [::std::mem::offset_of!(AggregateRecordsSlice, len) - 8usize];
};
#[doc = " Summary information about the key metrics of a block in an inverted index"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IIBlockSummary {
    pub first_doc_id: t_docId,
    pub last_doc_id: t_docId,
    pub number_of_entries: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IIBlockSummary"][::std::mem::size_of::<IIBlockSummary>() - 24usize];
    ["Alignment of IIBlockSummary"][::std::mem::align_of::<IIBlockSummary>() - 8usize];
    ["Offset of field: IIBlockSummary::first_doc_id"]
        [::std::mem::offset_of!(IIBlockSummary, first_doc_id) - 0usize];
    ["Offset of field: IIBlockSummary::last_doc_id"]
        [::std::mem::offset_of!(IIBlockSummary, last_doc_id) - 8usize];
    ["Offset of field: IIBlockSummary::number_of_entries"]
        [::std::mem::offset_of!(IIBlockSummary, number_of_entries) - 16usize];
};
#[doc = " Summary information about an inverted index containing all key metrics"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IISummary {
    pub number_of_docs: u32,
    pub number_of_entries: usize,
    pub last_doc_id: t_docId,
    pub flags: u64,
    pub number_of_blocks: usize,
    pub block_efficiency: f64,
    pub has_efficiency: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IISummary"][::std::mem::size_of::<IISummary>() - 56usize];
    ["Alignment of IISummary"][::std::mem::align_of::<IISummary>() - 8usize];
    ["Offset of field: IISummary::number_of_docs"]
        [::std::mem::offset_of!(IISummary, number_of_docs) - 0usize];
    ["Offset of field: IISummary::number_of_entries"]
        [::std::mem::offset_of!(IISummary, number_of_entries) - 8usize];
    ["Offset of field: IISummary::last_doc_id"]
        [::std::mem::offset_of!(IISummary, last_doc_id) - 16usize];
    ["Offset of field: IISummary::flags"][::std::mem::offset_of!(IISummary, flags) - 24usize];
    ["Offset of field: IISummary::number_of_blocks"]
        [::std::mem::offset_of!(IISummary, number_of_blocks) - 32usize];
    ["Offset of field: IISummary::block_efficiency"]
        [::std::mem::offset_of!(IISummary, block_efficiency) - 40usize];
    ["Offset of field: IISummary::has_efficiency"]
        [::std::mem::offset_of!(IISummary, has_efficiency) - 48usize];
};
#[doc = " No filter, all entries are accepted"]
pub const IndexDecoderCtx_Tag_IndexDecoderCtx_None: IndexDecoderCtx_Tag = 0;
#[doc = " Accepts entries matching this field mask"]
pub const IndexDecoderCtx_Tag_IndexDecoderCtx_FieldMask: IndexDecoderCtx_Tag = 1;
#[doc = " Accepts entries matching this numeric filter"]
pub const IndexDecoderCtx_Tag_IndexDecoderCtx_Numeric: IndexDecoderCtx_Tag = 2;
pub type IndexDecoderCtx_Tag = u8;
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union IndexDecoderCtx {
    pub tag: IndexDecoderCtx_Tag,
    pub __bindgen_anon_1: IndexDecoderCtx__bindgen_ty_1,
    pub __bindgen_anon_2: IndexDecoderCtx__bindgen_ty_2,
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct IndexDecoderCtx__bindgen_ty_1 {
    pub field_mask_tag: IndexDecoderCtx_Tag,
    pub __bindgen_padding_0: u64,
    pub field_mask: t_fieldMask,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IndexDecoderCtx__bindgen_ty_1"]
        [::std::mem::size_of::<IndexDecoderCtx__bindgen_ty_1>() - 32usize];
    ["Alignment of IndexDecoderCtx__bindgen_ty_1"]
        [::std::mem::align_of::<IndexDecoderCtx__bindgen_ty_1>() - 16usize];
    ["Offset of field: IndexDecoderCtx__bindgen_ty_1::field_mask_tag"]
        [::std::mem::offset_of!(IndexDecoderCtx__bindgen_ty_1, field_mask_tag) - 0usize];
    ["Offset of field: IndexDecoderCtx__bindgen_ty_1::field_mask"]
        [::std::mem::offset_of!(IndexDecoderCtx__bindgen_ty_1, field_mask) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IndexDecoderCtx__bindgen_ty_2 {
    pub numeric_tag: IndexDecoderCtx_Tag,
    pub numeric: *const NumericFilter,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IndexDecoderCtx__bindgen_ty_2"]
        [::std::mem::size_of::<IndexDecoderCtx__bindgen_ty_2>() - 16usize];
    ["Alignment of IndexDecoderCtx__bindgen_ty_2"]
        [::std::mem::align_of::<IndexDecoderCtx__bindgen_ty_2>() - 8usize];
    ["Offset of field: IndexDecoderCtx__bindgen_ty_2::numeric_tag"]
        [::std::mem::offset_of!(IndexDecoderCtx__bindgen_ty_2, numeric_tag) - 0usize];
    ["Offset of field: IndexDecoderCtx__bindgen_ty_2::numeric"]
        [::std::mem::offset_of!(IndexDecoderCtx__bindgen_ty_2, numeric) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IndexDecoderCtx"][::std::mem::size_of::<IndexDecoderCtx>() - 32usize];
    ["Alignment of IndexDecoderCtx"][::std::mem::align_of::<IndexDecoderCtx>() - 16usize];
    ["Offset of field: IndexDecoderCtx::tag"]
        [::std::mem::offset_of!(IndexDecoderCtx, tag) - 0usize];
};
#[doc = " For textual fields, allows to host multiple field indices at once."]
pub const FieldMaskOrIndex_Tag_FieldMaskOrIndex_Index: FieldMaskOrIndex_Tag = 0;
#[doc = " For the other fields, allows a single field to be referenced."]
pub const FieldMaskOrIndex_Tag_FieldMaskOrIndex_Mask: FieldMaskOrIndex_Tag = 1;
pub type FieldMaskOrIndex_Tag = u8;
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union FieldMaskOrIndex {
    pub tag: FieldMaskOrIndex_Tag,
    pub __bindgen_anon_1: FieldMaskOrIndex__bindgen_ty_1,
    pub __bindgen_anon_2: FieldMaskOrIndex__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FieldMaskOrIndex__bindgen_ty_1 {
    pub index_tag: FieldMaskOrIndex_Tag,
    pub index: t_fieldIndex,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FieldMaskOrIndex__bindgen_ty_1"]
        [::std::mem::size_of::<FieldMaskOrIndex__bindgen_ty_1>() - 4usize];
    ["Alignment of FieldMaskOrIndex__bindgen_ty_1"]
        [::std::mem::align_of::<FieldMaskOrIndex__bindgen_ty_1>() - 2usize];
    ["Offset of field: FieldMaskOrIndex__bindgen_ty_1::index_tag"]
        [::std::mem::offset_of!(FieldMaskOrIndex__bindgen_ty_1, index_tag) - 0usize];
    ["Offset of field: FieldMaskOrIndex__bindgen_ty_1::index"]
        [::std::mem::offset_of!(FieldMaskOrIndex__bindgen_ty_1, index) - 2usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct FieldMaskOrIndex__bindgen_ty_2 {
    pub mask_tag: FieldMaskOrIndex_Tag,
    pub __bindgen_padding_0: u64,
    pub mask: t_fieldMask,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FieldMaskOrIndex__bindgen_ty_2"]
        [::std::mem::size_of::<FieldMaskOrIndex__bindgen_ty_2>() - 32usize];
    ["Alignment of FieldMaskOrIndex__bindgen_ty_2"]
        [::std::mem::align_of::<FieldMaskOrIndex__bindgen_ty_2>() - 16usize];
    ["Offset of field: FieldMaskOrIndex__bindgen_ty_2::mask_tag"]
        [::std::mem::offset_of!(FieldMaskOrIndex__bindgen_ty_2, mask_tag) - 0usize];
    ["Offset of field: FieldMaskOrIndex__bindgen_ty_2::mask"]
        [::std::mem::offset_of!(FieldMaskOrIndex__bindgen_ty_2, mask) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FieldMaskOrIndex"][::std::mem::size_of::<FieldMaskOrIndex>() - 32usize];
    ["Alignment of FieldMaskOrIndex"][::std::mem::align_of::<FieldMaskOrIndex>() - 16usize];
    ["Offset of field: FieldMaskOrIndex::tag"]
        [::std::mem::offset_of!(FieldMaskOrIndex, tag) - 0usize];
};
#[doc = " Field filter context used when querying fields."]
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct FieldFilterContext {
    #[doc = " the field mask or index to filter on."]
    pub field: FieldMaskOrIndex,
    #[doc = " our field expiration predicate."]
    pub predicate: FieldExpirationPredicate,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FieldFilterContext"][::std::mem::size_of::<FieldFilterContext>() - 48usize];
    ["Alignment of FieldFilterContext"][::std::mem::align_of::<FieldFilterContext>() - 16usize];
    ["Offset of field: FieldFilterContext::field"]
        [::std::mem::offset_of!(FieldFilterContext, field) - 0usize];
    ["Offset of field: FieldFilterContext::predicate"]
        [::std::mem::offset_of!(FieldFilterContext, predicate) - 32usize];
};
unsafe extern "C" {
    #[doc = " Check if this is a numeric filter and not a geo filter\n\n # Safety\n\n The following invariant must be upheld when calling this function:\n - `filter` must point to a valid `NumericFilter` and cannot be NULL."]
    pub fn NumericFilter_IsNumeric(filter: *const NumericFilter) -> bool;
}
unsafe extern "C" {
    #[doc = " Check if the given value matches the numeric filter.\n\n # Safety\n\n The following invariant must be upheld when calling this function:\n - `filter` must point to a valid `NumericFilter` and cannot be NULL."]
    pub fn NumericFilter_Match(filter: *const NumericFilter, value: f64) -> bool;
}
unsafe extern "C" {
    #[doc = " Allocate a new intersect result with a given capacity and weight. This result should be freed\n using [`IndexResult_Free`]."]
    pub fn NewIntersectResult(cap: usize, weight: f64) -> *mut RSIndexResult;
}
unsafe extern "C" {
    #[doc = " Allocate a new union result with a given capacity and weight. This result should be freed using\n [`IndexResult_Free`]."]
    pub fn NewUnionResult(cap: usize, weight: f64) -> *mut RSIndexResult;
}
unsafe extern "C" {
    #[doc = " Allocate a new virtual result with a given weight and field mask. This result should be freed\n using [`IndexResult_Free`]."]
    pub fn NewVirtualResult(weight: f64, field_mask: t_fieldMask) -> *mut RSIndexResult;
}
unsafe extern "C" {
    #[doc = " Allocate a new numeric result. This result should be freed using [`IndexResult_Free`]."]
    pub fn NewNumericResult() -> *mut RSIndexResult;
}
unsafe extern "C" {
    #[doc = " Allocate a new metric result. This result should be freed using [`IndexResult_Free`]."]
    pub fn NewMetricResult() -> *mut RSIndexResult;
}
unsafe extern "C" {
    #[doc = " Allocate a new hybrid result. This result should be freed using [`IndexResult_Free`].\n\n This constructor is only used by the hydrid reader which will pushed owned copies to it.\n Therefore, this also returns an owned `RSIndexResult`."]
    pub fn NewHybridResult() -> *mut RSIndexResult;
}
unsafe extern "C" {
    #[doc = " Allocate a new token record with a given term and weight. This result should be freed using\n [`IndexResult_Free`].\n\n # Safety\n\n `term` must be a heap-allocated `RSQueryTerm` (e.g. created by `NewQueryTerm`) and the\n caller transfers ownership — it must not be freed separately."]
    pub fn NewTokenRecord(term: *mut RSQueryTerm, weight: f64) -> *mut RSIndexResult;
}
unsafe extern "C" {
    #[doc = " Free an index result's internal allocations and also free the result itself.\n\n # Safety\n The following invariants must be upheld when calling this function:\n - `result` must point to a valid `RSIndexResult` and cannot be NULL.\n - `result` must have been created using one of these:\n   - [`NewIntersectResult`]\n   - [`NewUnionResult`]\n   - [`NewVirtualResult`]\n   - [`NewNumericResult`]\n   - [`NewMetricResult`]\n   - [`NewHybridResult`]\n   - [`NewTokenRecord`]\n   - [`IndexResult_DeepCopy`]"]
    pub fn IndexResult_Free(result: *mut RSIndexResult);
}
unsafe extern "C" {
    #[doc = " Create a deep copy of the results that is totally thread safe. This is very slow so use it with\n caution.\n\n The created copy should be freed using [`IndexResult_Free`].\n\n # Safety\n The following invariant must be upheld when calling this function:\n - `result` must point to a valid `RSIndexResult` and cannot be NULL."]
    pub fn IndexResult_DeepCopy(source: *const RSIndexResult) -> *mut RSIndexResult;
}
unsafe extern "C" {
    #[doc = " Check if the result is an aggregate result.\n\n # Safety\n\n The following invariants must be upheld when calling this function:\n - `result` must point to a valid `RSIndexResult` and cannot be NULL."]
    pub fn IndexResult_IsAggregate(result: *const RSIndexResult) -> bool;
}
unsafe extern "C" {
    #[doc = " Get the numeric value of the result if it is a numeric result. If the result is not numeric,\n this function will return `0.0`.\n\n # Safety\n\n The following invariant must be upheld when calling this function:\n - `result` must point to a valid `RSIndexResult` and cannot be NULL."]
    pub fn IndexResult_NumValue(result: *const RSIndexResult) -> f64;
}
unsafe extern "C" {
    #[doc = " Set the numeric value of the result if it is a numeric result. If the result is not numeric,\n this function will do nothing.\n\n # Safety\n\n The following invariant must be upheld when calling this function:\n - `result` must point to a valid `RSIndexResult` and cannot be NULL."]
    pub fn IndexResult_SetNumValue(result: *mut RSIndexResult, value: f64);
}
unsafe extern "C" {
    #[doc = " Get the query term from a result if it is a term result. If the result is not a term, then\n this function will return a `NULL` pointer.\n\n # Safety\n\n The following invariant must be upheld when calling this function:\n - `result` must point to a valid `RSIndexResult` and cannot be NULL."]
    pub fn IndexResult_QueryTermRef(result: *const RSIndexResult) -> *mut RSQueryTerm;
}
unsafe extern "C" {
    #[doc = " Get the term offsets from a result if it is a term result. If the result is not a term, then\n this function will return a `NULL` pointer.\n\n # Safety\n\n The following invariant must be upheld when calling this function:\n - `result` must point to a valid `RSIndexResult` and cannot be NULL."]
    pub fn IndexResult_TermOffsetsRef(result: *const RSIndexResult) -> *const RSOffsetVector;
}
unsafe extern "C" {
    #[doc = " Get the aggregate result reference if the result is an aggregate result. If the result is\n not an aggregate, this function will return a `NULL` pointer.\n\n # Safety\n\n The following invariant must be upheld when calling this function:\n - `result` must point to a valid `RSIndexResult` and cannot be NULL."]
    pub fn IndexResult_AggregateRef(result: *const RSIndexResult) -> *const RSAggregateResult;
}
unsafe extern "C" {
    #[doc = " Get the aggregate result reference without performing a runtime check\n on the enum discriminant.\n\n Use this method if and only if you've already checked the enum\n discriminant in C code and you don't want to incur the (small)\n performance penalty of an additional redundant check.\n\n # Safety\n\n The following invariant must be upheld when calling this function:\n 1. `result` must point to a valid `RSIndexResult` and cannot be NULL.\n 2. `result`'s data payload must be of the aggregate kind"]
    pub fn IndexResult_AggregateRefUnchecked(
        result: *const RSIndexResult,
    ) -> *const RSAggregateResult;
}
unsafe extern "C" {
    #[doc = " Get a mutable aggregate result reference without performing a runtime check\n on the enum discriminant.\n\n Use this method if and only if you've already checked the enum\n discriminant in C code and you don't want to incur the (small)\n performance penalty of an additional redundant check.\n\n # Safety\n\n The following invariant must be upheld when calling this function:\n 1. `result` must point to a valid `RSIndexResult` and cannot be NULL.\n 2. `result`'s data payload must be of the aggregate kind"]
    pub fn IndexResult_AggregateRefMutUnchecked(
        result: *mut RSIndexResult,
    ) -> *mut RSAggregateResult;
}
unsafe extern "C" {
    #[doc = " Reset the result if it is an aggregate result. This will clear the children vector\n and reset the kind mask.\n\n # Safety\n\n The following invariant must be upheld when calling this function:\n - `result` must point to a valid `RSIndexResult` and cannot be NULL."]
    pub fn IndexResult_AggregateReset(result: *mut RSIndexResult);
}
unsafe extern "C" {
    #[doc = " Get the result at the specified index in the aggregate result. This will return a `NULL` pointer\n if the index is out of bounds.\n\n # Safety\n\n The following invariants must be upheld when calling this function:\n - `agg` must point to a valid `RSAggregateResult` and cannot be NULL."]
    pub fn AggregateResult_Get(agg: *const RSAggregateResult, index: usize)
    -> *const RSIndexResult;
}
unsafe extern "C" {
    #[doc = " Get the result at the specified index in the aggregate result, without checking bounds.\n\n # Safety\n\n The following invariants must be upheld when calling this function:\n 1. `agg` must point to a valid `RSAggregateResult` and cannot be NULL.\n 2. `index` must be lower than the length of the aggregate result children vector."]
    pub fn AggregateResult_GetUnchecked(
        agg: *const RSAggregateResult,
        index: usize,
    ) -> *const RSIndexResult;
}
unsafe extern "C" {
    #[doc = " Get a mutable result at the specified index in the aggregate result, without checking bounds.\n\n # Safety\n\n The following invariants must be upheld when calling this function:\n 1. `agg` must point to a valid `RSAggregateResult` and cannot be NULL.\n 2. `index` must be lower than the length of the aggregate result children vector.\n 3. `agg` must be of the `Owned` variant."]
    pub fn AggregateResult_GetMutUnchecked(
        agg: *mut RSAggregateResult,
        index: usize,
    ) -> *mut RSIndexResult;
}
unsafe extern "C" {
    #[doc = " Get the element count of the aggregate result.\n\n # Safety\n\n The following invariants must be upheld when calling this function:\n - `agg` must point to a valid `RSAggregateResult` and cannot be NULL."]
    pub fn AggregateResult_NumChildren(agg: *const RSAggregateResult) -> usize;
}
unsafe extern "C" {
    #[doc = " Get the capacity of the aggregate result.\n\n # Safety\n\n The following invariants must be upheld when calling this function:\n - `agg` must point to a valid `RSAggregateResult` and cannot be NULL."]
    pub fn AggregateResult_Capacity(agg: *const RSAggregateResult) -> usize;
}
unsafe extern "C" {
    #[doc = " Get the kind mask of the aggregate result.\n\n # Safety\n\n The following invariants must be upheld when calling this function:\n - `agg` must point to a valid `RSAggregateResult` and cannot be NULL."]
    pub fn AggregateResult_KindMask(agg: *const RSAggregateResult) -> u8;
}
unsafe extern "C" {
    #[doc = " Create a new aggregate result with the specified capacity. This function will make the result\n in Rust memory, but the ownership ends up being transferred to C's memory space. This ownership\n should return to Rust to free up any heap memory using [`AggregateResult_Free`]."]
    pub fn AggregateResult_New(cap: usize) -> RSAggregateResult;
}
unsafe extern "C" {
    #[doc = " Take ownership of a `RSAggregateResult` to free any heap memory it owns. This function will not\n free the individual children pointers, but rather the heap allocations owned by the aggregate\n result itself (such as the internal vector buffer). The caller is responsible for managing the\n memory of the children pointers before this call if needed.\n\n The `agg` parameter should have been created with [`AggregateResult_New`]."]
    pub fn AggregateResult_Free(agg: RSAggregateResult);
}
unsafe extern "C" {
    #[doc = " Add a child to a result if it is an aggregate result. Note, if `parent` only hold references\n to results, then it will not take ownership of the `child` and will therefore not free it.\n Instead, the caller is responsible for managing the memory of the `child` pointer *after* the\n `parent` has been freed.\n\n If the `parent` is not an aggregate kind, then this is a no-op.\n\n # Safety\n\n The following invariants must be upheld when calling this function:\n - `parent` must point to a valid `RSIndexResult` and cannot be NULL.\n - `child` must point to a valid `RSIndexResult` and cannot be NULL."]
    pub fn AggregateResult_AddChild(parent: *mut RSIndexResult, child: *mut RSIndexResult);
}
unsafe extern "C" {
    #[doc = " Get a view of the records stored inside the aggregate result.\n\n # Safety\n The following invariants must be upheld when calling this function:\n - `agg` must point to a valid `RSAggregateResult` and cannot be NULL."]
    pub fn AggregateResult_GetRecordsSlice(agg: *const RSAggregateResult) -> AggregateRecordsSlice;
}
unsafe extern "C" {
    #[doc = " Retrieve the offsets array from an offset vector.\n\n Set the array length into the `len` pointer.\n The returned array is borrowed and should not be modified.\n\n # Safety\n\n The following invariants must be upheld when calling this function:\n - `offsets` must point to a valid offset vector (either [`RSOffsetSlice`] or [`RSOffsetVector`])\n   and cannot be NULL.\n - `len` cannot be NULL and must point to an allocated memory big enough to hold an u32."]
    pub fn RSOffsetVector_GetData(
        offsets: *const RSOffsetVector,
        len: *mut u32,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " Set the offsets array on an offset vector.\n\n The vector will borrow the passed array so it's up to the caller to\n ensure it stays alive during its lifetime.\n\n # Safety\n\n The following invariants must be upheld when calling this function:\n - `offsets` must point to a valid offset vector (either [`RSOffsetSlice`] or [`RSOffsetVector`])\n   and cannot be NULL.\n - `data` must point to an array of `len` offsets.\n - if `data` is NULL then `len` should be 0."]
    pub fn RSOffsetVector_SetData(
        offsets: *mut RSOffsetVector,
        data: *const ::std::os::raw::c_char,
        len: u32,
    );
}
unsafe extern "C" {
    #[doc = " Free the data inside an offset vector.\n\n # Safety\n\n The following invariants must be upheld when calling this function:\n - `offsets` must point to a valid [`RSOffsetVector`] and cannot be NULL.\n - The data pointer of `offsets` had been allocated via the global allocator\n   and points to an array matching the length of `offsets`."]
    pub fn RSOffsetVector_FreeData(offsets: *mut RSOffsetVector);
}
unsafe extern "C" {
    #[doc = " Copy the data from one offset vector to another.\n\n Deep copies the data array from `src` to `dest`.\n It's up to the caller to free the copied array using [`RSOffsetVector_FreeData`].\n\n # Safety\n\n The following invariants must be upheld when calling this function:\n - `dest` must point to a valid [`RSOffsetVector`] and cannot be NULL.\n - `src` must point to a valid offset vector (either [`RSOffsetSlice`] or [`RSOffsetVector`])\n   and cannot be NULL.\n - `src` data should point to a valid array of `src.len` offsets."]
    pub fn RSOffsetVector_CopyData(dest: *mut RSOffsetVector, src: *const RSOffsetVector);
}
unsafe extern "C" {
    #[doc = " Retrieve the number of offsets in an offset vector.\n\n # Safety\n\n The following invariants must be upheld when calling this function:\n - `offsets` must point to a valid offset vector (either [`RSOffsetSlice`] or [`RSOffsetVector`])\n   and cannot be NULL."]
    pub fn RSOffsetVector_Len(offsets: *const RSOffsetVector) -> u32;
}
pub type t_offset = u64;
pub type t_fieldId = u16;
pub type t_expirationTimePoint = timespec;
pub type t_uniqueId = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RSSortingVector {
    pub header: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSSortingVector"][::std::mem::size_of::<RSSortingVector>() - 8usize];
    ["Alignment of RSSortingVector"][::std::mem::align_of::<RSSortingVector>() - 8usize];
    ["Offset of field: RSSortingVector::header"]
        [::std::mem::offset_of!(RSSortingVector, header) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RSPayload {
    pub data: *mut ::std::os::raw::c_char,
    pub len: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSPayload"][::std::mem::size_of::<RSPayload>() - 16usize];
    ["Alignment of RSPayload"][::std::mem::align_of::<RSPayload>() - 8usize];
    ["Offset of field: RSPayload::data"][::std::mem::offset_of!(RSPayload, data) - 0usize];
    ["Offset of field: RSPayload::len"][::std::mem::offset_of!(RSPayload, len) - 8usize];
};
pub const RSDocumentFlags_Document_DefaultFlags: RSDocumentFlags = 0;
pub const RSDocumentFlags_Document_Deleted: RSDocumentFlags = 1;
pub const RSDocumentFlags_Document_HasPayload: RSDocumentFlags = 2;
pub const RSDocumentFlags_Document_HasSortVector: RSDocumentFlags = 4;
pub const RSDocumentFlags_Document_HasOffsetVector: RSDocumentFlags = 8;
pub const RSDocumentFlags_Document_HasExpiration: RSDocumentFlags = 16;
pub const RSDocumentFlags_Document_FailedToOpen: RSDocumentFlags = 32;
pub type RSDocumentFlags = ::std::os::raw::c_uint;
#[repr(C)]
pub struct RSDocumentMetadata_s {
    pub id: t_docId,
    pub keyPtr: *mut ::std::os::raw::c_char,
    pub score: f32,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
    pub ref_count: u16,
    pub sortVector: RSSortingVector,
    pub byteOffsets: *mut RSByteOffsets,
    pub nextInChain: *mut RSDocumentMetadata_s,
    pub payload: *mut RSPayload,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSDocumentMetadata_s"][::std::mem::size_of::<RSDocumentMetadata_s>() - 64usize];
    ["Alignment of RSDocumentMetadata_s"][::std::mem::align_of::<RSDocumentMetadata_s>() - 8usize];
    ["Offset of field: RSDocumentMetadata_s::id"]
        [::std::mem::offset_of!(RSDocumentMetadata_s, id) - 0usize];
    ["Offset of field: RSDocumentMetadata_s::keyPtr"]
        [::std::mem::offset_of!(RSDocumentMetadata_s, keyPtr) - 8usize];
    ["Offset of field: RSDocumentMetadata_s::score"]
        [::std::mem::offset_of!(RSDocumentMetadata_s, score) - 16usize];
    ["Offset of field: RSDocumentMetadata_s::ref_count"]
        [::std::mem::offset_of!(RSDocumentMetadata_s, ref_count) - 28usize];
    ["Offset of field: RSDocumentMetadata_s::sortVector"]
        [::std::mem::offset_of!(RSDocumentMetadata_s, sortVector) - 32usize];
    ["Offset of field: RSDocumentMetadata_s::byteOffsets"]
        [::std::mem::offset_of!(RSDocumentMetadata_s, byteOffsets) - 40usize];
    ["Offset of field: RSDocumentMetadata_s::nextInChain"]
        [::std::mem::offset_of!(RSDocumentMetadata_s, nextInChain) - 48usize];
    ["Offset of field: RSDocumentMetadata_s::payload"]
        [::std::mem::offset_of!(RSDocumentMetadata_s, payload) - 56usize];
};
impl RSDocumentMetadata_s {
    #[inline]
    pub fn maxTermFreq(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 24u8) as u32) }
    }
    #[inline]
    pub fn set_maxTermFreq(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 24u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn maxTermFreq_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                24u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_maxTermFreq_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                24u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn flags(&self) -> RSDocumentFlags {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_flags(&mut self, val: RSDocumentFlags) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn flags_raw(this: *const Self) -> RSDocumentFlags {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                24usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_flags_raw(this: *mut Self, val: RSDocumentFlags) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                24usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn docLen(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 24u8) as u32) }
    }
    #[inline]
    pub fn set_docLen(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 24u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn docLen_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                32usize,
                24u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_docLen_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                32usize,
                24u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn type_(&self) -> DocumentType {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(56usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: DocumentType) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(56usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn type__raw(this: *const Self) -> DocumentType {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                56usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_type_raw(this: *mut Self, val: DocumentType) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                56usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        maxTermFreq: u32,
        flags: RSDocumentFlags,
        docLen: u32,
        type_: DocumentType,
    ) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 24u8, {
            let maxTermFreq: u32 = unsafe { ::std::mem::transmute(maxTermFreq) };
            maxTermFreq as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let flags: u32 = unsafe { ::std::mem::transmute(flags) };
            flags as u64
        });
        __bindgen_bitfield_unit.set(32usize, 24u8, {
            let docLen: u32 = unsafe { ::std::mem::transmute(docLen) };
            docLen as u64
        });
        __bindgen_bitfield_unit.set(56usize, 8u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
pub struct RSToken {
    pub str_: *mut ::std::os::raw::c_char,
    pub len: usize,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub __bindgen_padding_0: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSToken"][::std::mem::size_of::<RSToken>() - 24usize];
    ["Alignment of RSToken"][::std::mem::align_of::<RSToken>() - 8usize];
    ["Offset of field: RSToken::str_"][::std::mem::offset_of!(RSToken, str_) - 0usize];
    ["Offset of field: RSToken::len"][::std::mem::offset_of!(RSToken, len) - 8usize];
};
impl RSToken {
    #[inline]
    pub fn expanded(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_expanded(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn expanded_raw(this: *const Self) -> u8 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_expanded_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn flags(&self) -> RSTokenFlags {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_flags(&mut self, val: RSTokenFlags) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn flags_raw(this: *const Self) -> RSTokenFlags {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                31u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_flags_raw(this: *mut Self, val: RSTokenFlags) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                31u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        expanded: u8,
        flags: RSTokenFlags,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let expanded: u8 = unsafe { ::std::mem::transmute(expanded) };
            expanded as u64
        });
        __bindgen_bitfield_unit.set(1usize, 31u8, {
            let flags: u32 = unsafe { ::std::mem::transmute(flags) };
            flags as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RSQueryExpanderCtx {
    pub qast: *mut QueryAST,
    pub handle: *mut RedisSearchCtx,
    pub currentNode: *mut *mut RSQueryNode,
    pub status: *mut QueryError,
    pub privdata: *mut ::std::os::raw::c_void,
    pub language: RSLanguage,
    pub ExpandToken: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RSQueryExpanderCtx,
            str_: *const ::std::os::raw::c_char,
            len: usize,
            flags: RSTokenFlags,
        ),
    >,
    pub ExpandTokenWithPhrase: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut RSQueryExpanderCtx,
            toks: *mut *const ::std::os::raw::c_char,
            num: usize,
            flags: RSTokenFlags,
            replace: ::std::os::raw::c_int,
            exact: ::std::os::raw::c_int,
        ),
    >,
    pub SetPayload: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut RSQueryExpanderCtx, payload: RSPayload),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSQueryExpanderCtx"][::std::mem::size_of::<RSQueryExpanderCtx>() - 72usize];
    ["Alignment of RSQueryExpanderCtx"][::std::mem::align_of::<RSQueryExpanderCtx>() - 8usize];
    ["Offset of field: RSQueryExpanderCtx::qast"]
        [::std::mem::offset_of!(RSQueryExpanderCtx, qast) - 0usize];
    ["Offset of field: RSQueryExpanderCtx::handle"]
        [::std::mem::offset_of!(RSQueryExpanderCtx, handle) - 8usize];
    ["Offset of field: RSQueryExpanderCtx::currentNode"]
        [::std::mem::offset_of!(RSQueryExpanderCtx, currentNode) - 16usize];
    ["Offset of field: RSQueryExpanderCtx::status"]
        [::std::mem::offset_of!(RSQueryExpanderCtx, status) - 24usize];
    ["Offset of field: RSQueryExpanderCtx::privdata"]
        [::std::mem::offset_of!(RSQueryExpanderCtx, privdata) - 32usize];
    ["Offset of field: RSQueryExpanderCtx::language"]
        [::std::mem::offset_of!(RSQueryExpanderCtx, language) - 40usize];
    ["Offset of field: RSQueryExpanderCtx::ExpandToken"]
        [::std::mem::offset_of!(RSQueryExpanderCtx, ExpandToken) - 48usize];
    ["Offset of field: RSQueryExpanderCtx::ExpandTokenWithPhrase"]
        [::std::mem::offset_of!(RSQueryExpanderCtx, ExpandTokenWithPhrase) - 56usize];
    ["Offset of field: RSQueryExpanderCtx::SetPayload"]
        [::std::mem::offset_of!(RSQueryExpanderCtx, SetPayload) - 64usize];
};
pub type RSQueryTokenExpander = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut RSQueryExpanderCtx,
        token: *mut RSToken,
    ) -> ::std::os::raw::c_int,
>;
pub type RSFreeFunction =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RSOffsetIterator {
    pub ctx: *mut ::std::os::raw::c_void,
    pub Next: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void, term: *mut *mut RSQueryTerm) -> u32,
    >,
    pub Rewind: ::std::option::Option<unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void)>,
    pub Free: ::std::option::Option<unsafe extern "C" fn(ctx: *mut ::std::os::raw::c_void)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSOffsetIterator"][::std::mem::size_of::<RSOffsetIterator>() - 32usize];
    ["Alignment of RSOffsetIterator"][::std::mem::align_of::<RSOffsetIterator>() - 8usize];
    ["Offset of field: RSOffsetIterator::ctx"]
        [::std::mem::offset_of!(RSOffsetIterator, ctx) - 0usize];
    ["Offset of field: RSOffsetIterator::Next"]
        [::std::mem::offset_of!(RSOffsetIterator, Next) - 8usize];
    ["Offset of field: RSOffsetIterator::Rewind"]
        [::std::mem::offset_of!(RSOffsetIterator, Rewind) - 16usize];
    ["Offset of field: RSOffsetIterator::Free"]
        [::std::mem::offset_of!(RSOffsetIterator, Free) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RSVirtualRecord {
    pub dummy: ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSVirtualRecord"][::std::mem::size_of::<RSVirtualRecord>() - 1usize];
    ["Alignment of RSVirtualRecord"][::std::mem::align_of::<RSVirtualRecord>() - 1usize];
    ["Offset of field: RSVirtualRecord::dummy"]
        [::std::mem::offset_of!(RSVirtualRecord, dummy) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RSYieldableMetric {
    pub key: *mut RLookupKey,
    pub value: *mut RSValue,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSYieldableMetric"][::std::mem::size_of::<RSYieldableMetric>() - 16usize];
    ["Alignment of RSYieldableMetric"][::std::mem::align_of::<RSYieldableMetric>() - 8usize];
    ["Offset of field: RSYieldableMetric::key"]
        [::std::mem::offset_of!(RSYieldableMetric, key) - 0usize];
    ["Offset of field: RSYieldableMetric::value"]
        [::std::mem::offset_of!(RSYieldableMetric, value) - 8usize];
};
unsafe extern "C" {
    pub fn RSOffsetVector_Iterate(
        v: *const RSOffsetVector,
        t: *mut RSQueryTerm,
    ) -> RSOffsetIterator;
}
unsafe extern "C" {
    pub fn RSIndexResult_IterateOffsets(res: *const RSIndexResult) -> RSOffsetIterator;
}
unsafe extern "C" {
    pub fn RSIndexResult_HasOffsets(res: *const RSIndexResult) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RSIndexStats {
    pub numDocs: usize,
    pub numTerms: usize,
    pub avgDocLen: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSIndexStats"][::std::mem::size_of::<RSIndexStats>() - 24usize];
    ["Alignment of RSIndexStats"][::std::mem::align_of::<RSIndexStats>() - 8usize];
    ["Offset of field: RSIndexStats::numDocs"]
        [::std::mem::offset_of!(RSIndexStats, numDocs) - 0usize];
    ["Offset of field: RSIndexStats::numTerms"]
        [::std::mem::offset_of!(RSIndexStats, numTerms) - 8usize];
    ["Offset of field: RSIndexStats::avgDocLen"]
        [::std::mem::offset_of!(RSIndexStats, avgDocLen) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScoringFunctionArgs {
    pub extdata: *mut ::std::os::raw::c_void,
    pub qdata: *const ::std::os::raw::c_void,
    pub qdatalen: usize,
    pub indexStats: RSIndexStats,
    #[doc = " Flags controlling scoring function"]
    pub scrExp: *mut ::std::os::raw::c_void,
    pub GetSlop: ::std::option::Option<
        unsafe extern "C" fn(res: *const RSIndexResult) -> ::std::os::raw::c_int,
    >,
    pub tanhFactor: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScoringFunctionArgs"][::std::mem::size_of::<ScoringFunctionArgs>() - 72usize];
    ["Alignment of ScoringFunctionArgs"][::std::mem::align_of::<ScoringFunctionArgs>() - 8usize];
    ["Offset of field: ScoringFunctionArgs::extdata"]
        [::std::mem::offset_of!(ScoringFunctionArgs, extdata) - 0usize];
    ["Offset of field: ScoringFunctionArgs::qdata"]
        [::std::mem::offset_of!(ScoringFunctionArgs, qdata) - 8usize];
    ["Offset of field: ScoringFunctionArgs::qdatalen"]
        [::std::mem::offset_of!(ScoringFunctionArgs, qdatalen) - 16usize];
    ["Offset of field: ScoringFunctionArgs::indexStats"]
        [::std::mem::offset_of!(ScoringFunctionArgs, indexStats) - 24usize];
    ["Offset of field: ScoringFunctionArgs::scrExp"]
        [::std::mem::offset_of!(ScoringFunctionArgs, scrExp) - 48usize];
    ["Offset of field: ScoringFunctionArgs::GetSlop"]
        [::std::mem::offset_of!(ScoringFunctionArgs, GetSlop) - 56usize];
    ["Offset of field: ScoringFunctionArgs::tanhFactor"]
        [::std::mem::offset_of!(ScoringFunctionArgs, tanhFactor) - 64usize];
};
pub type RSScoringFunction = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *const ScoringFunctionArgs,
        res: *const RSIndexResult,
        dmd: *const RSDocumentMetadata,
        minScore: f64,
    ) -> f64,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RSExtensionCtx {
    pub RegisterScoringFunction: ::std::option::Option<
        unsafe extern "C" fn(
            alias: *const ::std::os::raw::c_char,
            func: RSScoringFunction,
            ff: RSFreeFunction,
            privdata: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub RegisterQueryExpander: ::std::option::Option<
        unsafe extern "C" fn(
            alias: *const ::std::os::raw::c_char,
            exp: RSQueryTokenExpander,
            ff: RSFreeFunction,
            privdata: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSExtensionCtx"][::std::mem::size_of::<RSExtensionCtx>() - 16usize];
    ["Alignment of RSExtensionCtx"][::std::mem::align_of::<RSExtensionCtx>() - 8usize];
    ["Offset of field: RSExtensionCtx::RegisterScoringFunction"]
        [::std::mem::offset_of!(RSExtensionCtx, RegisterScoringFunction) - 0usize];
    ["Offset of field: RSExtensionCtx::RegisterQueryExpander"]
        [::std::mem::offset_of!(RSExtensionCtx, RegisterQueryExpander) - 8usize];
};
pub type RSExtensionInitFunc =
    ::std::option::Option<unsafe extern "C" fn(ctx: *mut RSExtensionCtx) -> ::std::os::raw::c_int>;
pub const RSTimeoutPolicy_TimeoutPolicy_Return: RSTimeoutPolicy = 0;
pub const RSTimeoutPolicy_TimeoutPolicy_Fail: RSTimeoutPolicy = 1;
pub const RSTimeoutPolicy_TimeoutPolicy_ReturnStrict: RSTimeoutPolicy = 2;
pub const RSTimeoutPolicy_TimeoutPolicy_Invalid: RSTimeoutPolicy = 3;
pub type RSTimeoutPolicy = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub static on_timeout_enums: [::std::os::raw::c_int; 3usize];
}
unsafe extern "C" {
    pub static mut on_timeout_vals: [*const ::std::os::raw::c_char; 3usize];
}
pub const RSOomPolicy_OomPolicy_Return: RSOomPolicy = 0;
pub const RSOomPolicy_OomPolicy_Fail: RSOomPolicy = 1;
pub const RSOomPolicy_OomPolicy_Ignore: RSOomPolicy = 2;
pub const RSOomPolicy_OomPolicy_Invalid: RSOomPolicy = 3;
pub type RSOomPolicy = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub static on_oom_enums: [::std::os::raw::c_int; 3usize];
}
unsafe extern "C" {
    pub static mut on_oom_vals: [*const ::std::os::raw::c_char; 3usize];
}
pub const GCPolicy_GCPolicy_Fork: GCPolicy = 0;
pub const GCPolicy_GCPolicy_Disk: GCPolicy = 1;
pub type GCPolicy = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn TimeoutPolicy_ToString(arg1: RSTimeoutPolicy) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn OomPolicy_ToString(arg1: RSOomPolicy) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " Returns TimeoutPolicy_Invalid if the string could not be parsed"]
    pub fn TimeoutPolicy_Parse(s: *const ::std::os::raw::c_char, n: usize) -> RSTimeoutPolicy;
}
unsafe extern "C" {
    pub fn OomPolicy_Parse(s: *const ::std::os::raw::c_char, n: usize) -> RSOomPolicy;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GCSettings {
    pub forkGcRunIntervalSec: usize,
    pub forkGcCleanThreshold: usize,
    pub forkGcRetryInterval: usize,
    pub forkGcSleepBeforeExit: usize,
    pub forkGCCleanNumericEmptyNodes: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GCSettings"][::std::mem::size_of::<GCSettings>() - 40usize];
    ["Alignment of GCSettings"][::std::mem::align_of::<GCSettings>() - 8usize];
    ["Offset of field: GCSettings::forkGcRunIntervalSec"]
        [::std::mem::offset_of!(GCSettings, forkGcRunIntervalSec) - 0usize];
    ["Offset of field: GCSettings::forkGcCleanThreshold"]
        [::std::mem::offset_of!(GCSettings, forkGcCleanThreshold) - 8usize];
    ["Offset of field: GCSettings::forkGcRetryInterval"]
        [::std::mem::offset_of!(GCSettings, forkGcRetryInterval) - 16usize];
    ["Offset of field: GCSettings::forkGcSleepBeforeExit"]
        [::std::mem::offset_of!(GCSettings, forkGcSleepBeforeExit) - 24usize];
    ["Offset of field: GCSettings::forkGCCleanNumericEmptyNodes"]
        [::std::mem::offset_of!(GCSettings, forkGCCleanNumericEmptyNodes) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GCConfig {
    pub enableGC: bool,
    pub gcScanSize: usize,
    pub gcPolicy: GCPolicy,
    pub gcSettings: GCSettings,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GCConfig"][::std::mem::size_of::<GCConfig>() - 64usize];
    ["Alignment of GCConfig"][::std::mem::align_of::<GCConfig>() - 8usize];
    ["Offset of field: GCConfig::enableGC"][::std::mem::offset_of!(GCConfig, enableGC) - 0usize];
    ["Offset of field: GCConfig::gcScanSize"]
        [::std::mem::offset_of!(GCConfig, gcScanSize) - 8usize];
    ["Offset of field: GCConfig::gcPolicy"][::std::mem::offset_of!(GCConfig, gcPolicy) - 16usize];
    ["Offset of field: GCConfig::gcSettings"]
        [::std::mem::offset_of!(GCConfig, gcSettings) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RequestConfig {
    pub dialectVersion: ::std::os::raw::c_uint,
    pub queryTimeoutMS: ::std::os::raw::c_longlong,
    pub timeoutPolicy: RSTimeoutPolicy,
    pub printProfileClock: bool,
    pub BM25STD_TanhFactor: ::std::os::raw::c_uint,
    pub oomPolicy: RSOomPolicy,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RequestConfig"][::std::mem::size_of::<RequestConfig>() - 32usize];
    ["Alignment of RequestConfig"][::std::mem::align_of::<RequestConfig>() - 8usize];
    ["Offset of field: RequestConfig::dialectVersion"]
        [::std::mem::offset_of!(RequestConfig, dialectVersion) - 0usize];
    ["Offset of field: RequestConfig::queryTimeoutMS"]
        [::std::mem::offset_of!(RequestConfig, queryTimeoutMS) - 8usize];
    ["Offset of field: RequestConfig::timeoutPolicy"]
        [::std::mem::offset_of!(RequestConfig, timeoutPolicy) - 16usize];
    ["Offset of field: RequestConfig::printProfileClock"]
        [::std::mem::offset_of!(RequestConfig, printProfileClock) - 20usize];
    ["Offset of field: RequestConfig::BM25STD_TanhFactor"]
        [::std::mem::offset_of!(RequestConfig, BM25STD_TanhFactor) - 24usize];
    ["Offset of field: RequestConfig::oomPolicy"]
        [::std::mem::offset_of!(RequestConfig, oomPolicy) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IteratorsConfig {
    pub maxPrefixExpansions: ::std::os::raw::c_longlong,
    pub minTermPrefix: ::std::os::raw::c_longlong,
    pub minStemLength: ::std::os::raw::c_uint,
    pub minUnionIterHeap: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IteratorsConfig"][::std::mem::size_of::<IteratorsConfig>() - 32usize];
    ["Alignment of IteratorsConfig"][::std::mem::align_of::<IteratorsConfig>() - 8usize];
    ["Offset of field: IteratorsConfig::maxPrefixExpansions"]
        [::std::mem::offset_of!(IteratorsConfig, maxPrefixExpansions) - 0usize];
    ["Offset of field: IteratorsConfig::minTermPrefix"]
        [::std::mem::offset_of!(IteratorsConfig, minTermPrefix) - 8usize];
    ["Offset of field: IteratorsConfig::minStemLength"]
        [::std::mem::offset_of!(IteratorsConfig, minStemLength) - 16usize];
    ["Offset of field: IteratorsConfig::minUnionIterHeap"]
        [::std::mem::offset_of!(IteratorsConfig, minUnionIterHeap) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RSConfig {
    pub serverVersion: ::std::os::raw::c_int,
    pub extLoad: *const ::std::os::raw::c_char,
    pub frisoIni: *const ::std::os::raw::c_char,
    pub defaultScorer: *const ::std::os::raw::c_char,
    pub iteratorsConfigParams: IteratorsConfig,
    pub requestConfigParams: RequestConfig,
    pub cursorReadSize: ::std::os::raw::c_longlong,
    pub cursorMaxIdle: ::std::os::raw::c_longlong,
    pub maxDocTableSize: usize,
    pub maxSearchResults: usize,
    pub maxAggregateResults: usize,
    pub numWorkerThreads: usize,
    pub minOperationWorkers: usize,
    pub tieredVecSimIndexBufferLimit: usize,
    pub highPriorityBiasNum: usize,
    pub minPhoneticTermLen: usize,
    pub gcConfigParams: GCConfig,
    pub chainedConfig: *mut ::std::os::raw::c_void,
    pub noMemPool: bool,
    pub filterCommands: bool,
    pub freeResourcesThread: bool,
    pub numericCompress: bool,
    pub numericTreeMaxDepthRange: usize,
    pub invertedIndexRawDocidEncoding: bool,
    pub vssMaxResize: ::std::os::raw::c_uint,
    pub multiTextOffsetDelta: ::std::os::raw::c_uint,
    pub numBGIndexingIterationsBeforeSleep: ::std::os::raw::c_uint,
    pub prioritizeIntersectUnionChildren: bool,
    pub indexerYieldEveryOpsWhileLoading: ::std::os::raw::c_uint,
    pub bgIndexingSleepDurationMicroseconds: u32,
    pub indexCursorLimit: ::std::os::raw::c_longlong,
    pub indexingMemoryLimit: u8,
    pub enableUnstableFeatures: bool,
    pub hideUserDataFromLog: bool,
    pub bgIndexingOomPauseTimeBeforeRetry: u32,
    pub minTrimDelayMS: u32,
    pub maxTrimDelayMS: u32,
    pub trimmingStateCheckDelayMS: u32,
    pub infoEmitOnZeroIndexes: bool,
    pub simulateInFlex: bool,
    pub monitorExpiration: bool,
    pub diskBufferPercentage: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSConfig"][::std::mem::size_of::<RSConfig>() - 328usize];
    ["Alignment of RSConfig"][::std::mem::align_of::<RSConfig>() - 8usize];
    ["Offset of field: RSConfig::serverVersion"]
        [::std::mem::offset_of!(RSConfig, serverVersion) - 0usize];
    ["Offset of field: RSConfig::extLoad"][::std::mem::offset_of!(RSConfig, extLoad) - 8usize];
    ["Offset of field: RSConfig::frisoIni"][::std::mem::offset_of!(RSConfig, frisoIni) - 16usize];
    ["Offset of field: RSConfig::defaultScorer"]
        [::std::mem::offset_of!(RSConfig, defaultScorer) - 24usize];
    ["Offset of field: RSConfig::iteratorsConfigParams"]
        [::std::mem::offset_of!(RSConfig, iteratorsConfigParams) - 32usize];
    ["Offset of field: RSConfig::requestConfigParams"]
        [::std::mem::offset_of!(RSConfig, requestConfigParams) - 64usize];
    ["Offset of field: RSConfig::cursorReadSize"]
        [::std::mem::offset_of!(RSConfig, cursorReadSize) - 96usize];
    ["Offset of field: RSConfig::cursorMaxIdle"]
        [::std::mem::offset_of!(RSConfig, cursorMaxIdle) - 104usize];
    ["Offset of field: RSConfig::maxDocTableSize"]
        [::std::mem::offset_of!(RSConfig, maxDocTableSize) - 112usize];
    ["Offset of field: RSConfig::maxSearchResults"]
        [::std::mem::offset_of!(RSConfig, maxSearchResults) - 120usize];
    ["Offset of field: RSConfig::maxAggregateResults"]
        [::std::mem::offset_of!(RSConfig, maxAggregateResults) - 128usize];
    ["Offset of field: RSConfig::numWorkerThreads"]
        [::std::mem::offset_of!(RSConfig, numWorkerThreads) - 136usize];
    ["Offset of field: RSConfig::minOperationWorkers"]
        [::std::mem::offset_of!(RSConfig, minOperationWorkers) - 144usize];
    ["Offset of field: RSConfig::tieredVecSimIndexBufferLimit"]
        [::std::mem::offset_of!(RSConfig, tieredVecSimIndexBufferLimit) - 152usize];
    ["Offset of field: RSConfig::highPriorityBiasNum"]
        [::std::mem::offset_of!(RSConfig, highPriorityBiasNum) - 160usize];
    ["Offset of field: RSConfig::minPhoneticTermLen"]
        [::std::mem::offset_of!(RSConfig, minPhoneticTermLen) - 168usize];
    ["Offset of field: RSConfig::gcConfigParams"]
        [::std::mem::offset_of!(RSConfig, gcConfigParams) - 176usize];
    ["Offset of field: RSConfig::chainedConfig"]
        [::std::mem::offset_of!(RSConfig, chainedConfig) - 240usize];
    ["Offset of field: RSConfig::noMemPool"]
        [::std::mem::offset_of!(RSConfig, noMemPool) - 248usize];
    ["Offset of field: RSConfig::filterCommands"]
        [::std::mem::offset_of!(RSConfig, filterCommands) - 249usize];
    ["Offset of field: RSConfig::freeResourcesThread"]
        [::std::mem::offset_of!(RSConfig, freeResourcesThread) - 250usize];
    ["Offset of field: RSConfig::numericCompress"]
        [::std::mem::offset_of!(RSConfig, numericCompress) - 251usize];
    ["Offset of field: RSConfig::numericTreeMaxDepthRange"]
        [::std::mem::offset_of!(RSConfig, numericTreeMaxDepthRange) - 256usize];
    ["Offset of field: RSConfig::invertedIndexRawDocidEncoding"]
        [::std::mem::offset_of!(RSConfig, invertedIndexRawDocidEncoding) - 264usize];
    ["Offset of field: RSConfig::vssMaxResize"]
        [::std::mem::offset_of!(RSConfig, vssMaxResize) - 268usize];
    ["Offset of field: RSConfig::multiTextOffsetDelta"]
        [::std::mem::offset_of!(RSConfig, multiTextOffsetDelta) - 272usize];
    ["Offset of field: RSConfig::numBGIndexingIterationsBeforeSleep"]
        [::std::mem::offset_of!(RSConfig, numBGIndexingIterationsBeforeSleep) - 276usize];
    ["Offset of field: RSConfig::prioritizeIntersectUnionChildren"]
        [::std::mem::offset_of!(RSConfig, prioritizeIntersectUnionChildren) - 280usize];
    ["Offset of field: RSConfig::indexerYieldEveryOpsWhileLoading"]
        [::std::mem::offset_of!(RSConfig, indexerYieldEveryOpsWhileLoading) - 284usize];
    ["Offset of field: RSConfig::bgIndexingSleepDurationMicroseconds"]
        [::std::mem::offset_of!(RSConfig, bgIndexingSleepDurationMicroseconds) - 288usize];
    ["Offset of field: RSConfig::indexCursorLimit"]
        [::std::mem::offset_of!(RSConfig, indexCursorLimit) - 296usize];
    ["Offset of field: RSConfig::indexingMemoryLimit"]
        [::std::mem::offset_of!(RSConfig, indexingMemoryLimit) - 304usize];
    ["Offset of field: RSConfig::enableUnstableFeatures"]
        [::std::mem::offset_of!(RSConfig, enableUnstableFeatures) - 305usize];
    ["Offset of field: RSConfig::hideUserDataFromLog"]
        [::std::mem::offset_of!(RSConfig, hideUserDataFromLog) - 306usize];
    ["Offset of field: RSConfig::bgIndexingOomPauseTimeBeforeRetry"]
        [::std::mem::offset_of!(RSConfig, bgIndexingOomPauseTimeBeforeRetry) - 308usize];
    ["Offset of field: RSConfig::minTrimDelayMS"]
        [::std::mem::offset_of!(RSConfig, minTrimDelayMS) - 312usize];
    ["Offset of field: RSConfig::maxTrimDelayMS"]
        [::std::mem::offset_of!(RSConfig, maxTrimDelayMS) - 316usize];
    ["Offset of field: RSConfig::trimmingStateCheckDelayMS"]
        [::std::mem::offset_of!(RSConfig, trimmingStateCheckDelayMS) - 320usize];
    ["Offset of field: RSConfig::infoEmitOnZeroIndexes"]
        [::std::mem::offset_of!(RSConfig, infoEmitOnZeroIndexes) - 324usize];
    ["Offset of field: RSConfig::simulateInFlex"]
        [::std::mem::offset_of!(RSConfig, simulateInFlex) - 325usize];
    ["Offset of field: RSConfig::monitorExpiration"]
        [::std::mem::offset_of!(RSConfig, monitorExpiration) - 326usize];
    ["Offset of field: RSConfig::diskBufferPercentage"]
        [::std::mem::offset_of!(RSConfig, diskBufferPercentage) - 327usize];
};
pub const RSConfigVarFlags_RSCONFIGVAR_F_IMMUTABLE: RSConfigVarFlags = 1;
pub const RSConfigVarFlags_RSCONFIGVAR_F_MODIFIED: RSConfigVarFlags = 2;
pub const RSConfigVarFlags_RSCONFIGVAR_F_FLAG: RSConfigVarFlags = 4;
pub type RSConfigVarFlags = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RSConfigVar {
    pub name: *const ::std::os::raw::c_char,
    pub helpText: *const ::std::os::raw::c_char,
    pub flags: u32,
    pub triggerId: u32,
    pub setValue: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut RSConfig,
            arg2: *mut ArgsCursor,
            arg3: u32,
            arg4: *mut QueryError,
        ) -> ::std::os::raw::c_int,
    >,
    pub getValue: ::std::option::Option<unsafe extern "C" fn(arg1: *const RSConfig) -> sds>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSConfigVar"][::std::mem::size_of::<RSConfigVar>() - 40usize];
    ["Alignment of RSConfigVar"][::std::mem::align_of::<RSConfigVar>() - 8usize];
    ["Offset of field: RSConfigVar::name"][::std::mem::offset_of!(RSConfigVar, name) - 0usize];
    ["Offset of field: RSConfigVar::helpText"]
        [::std::mem::offset_of!(RSConfigVar, helpText) - 8usize];
    ["Offset of field: RSConfigVar::flags"][::std::mem::offset_of!(RSConfigVar, flags) - 16usize];
    ["Offset of field: RSConfigVar::triggerId"]
        [::std::mem::offset_of!(RSConfigVar, triggerId) - 20usize];
    ["Offset of field: RSConfigVar::setValue"]
        [::std::mem::offset_of!(RSConfigVar, setValue) - 24usize];
    ["Offset of field: RSConfigVar::getValue"]
        [::std::mem::offset_of!(RSConfigVar, getValue) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RSConfigOptions {
    pub vars: [RSConfigVar; 255usize],
    pub next: *mut RSConfigOptions,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSConfigOptions"][::std::mem::size_of::<RSConfigOptions>() - 10208usize];
    ["Alignment of RSConfigOptions"][::std::mem::align_of::<RSConfigOptions>() - 8usize];
    ["Offset of field: RSConfigOptions::vars"]
        [::std::mem::offset_of!(RSConfigOptions, vars) - 0usize];
    ["Offset of field: RSConfigOptions::next"]
        [::std::mem::offset_of!(RSConfigOptions, next) - 10200usize];
};
pub type RSConfigExternalTrigger =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut RSConfig) -> ::std::os::raw::c_int>;
unsafe extern "C" {
    pub static mut RSGlobalConfig: RSConfig;
}
unsafe extern "C" {
    pub static mut RSGlobalConfigOptions: RSConfigOptions;
}
unsafe extern "C" {
    pub static mut config_ext_load: *mut RedisModuleString;
}
unsafe extern "C" {
    pub static mut config_friso_ini: *mut RedisModuleString;
}
unsafe extern "C" {
    pub static mut config_default_scorer: *mut RedisModuleString;
}
unsafe extern "C" {
    #[doc = " Add new configuration options to the chain of already recognized options"]
    pub fn RSConfigOptions_AddConfigs(src: *mut RSConfigOptions, dst: *mut RSConfigOptions);
}
unsafe extern "C" {
    #[doc = " Register a new external trigger for configuration changes.\n This function should be called on the module load time, before we start reading\n any configuration.\n @param trigger the trigger function\n @param configs an array of configuration names that trigger the function.\n                The array must be NULL-terminated."]
    pub fn RSConfigExternalTrigger_Register(
        trigger: RSConfigExternalTrigger,
        configs: *mut *const ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn ReadConfig(
        argv: *mut *mut RedisModuleString,
        argc: ::std::os::raw::c_int,
        err: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn GetDefaultWorkerThreads() -> usize;
}
unsafe extern "C" {
    pub fn RegisterModuleConfig_Local(ctx: *mut RedisModuleCtx) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " Writes the retrieval of the configuration value to the network.\n isHelp will use a more dict-like pattern, which should be a bit friendlier\n on the eyes"]
    pub fn RSConfig_DumpProto(
        cfg: *const RSConfig,
        options: *const RSConfigOptions,
        name: *const ::std::os::raw::c_char,
        reply: *mut RedisModule_Reply,
        isHelp: bool,
    );
}
unsafe extern "C" {
    #[doc = " Sets a configuration variable. The argv, argc, and offset variables should\n point to the global argv array. You can also make argv point at the specific\n (after-the-option-name) arguments and set offset to 0, and argc to the number\n of remaining arguments. offset is advanced to the next unread argument (which\n can be == argc)"]
    pub fn RSConfig_SetOption(
        config: *mut RSConfig,
        options: *mut RSConfigOptions,
        name: *const ::std::os::raw::c_char,
        argv: *mut *mut RedisModuleString,
        argc: ::std::os::raw::c_int,
        offset: *mut usize,
        status: *mut QueryError,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn RSConfig_GetInfoString(config: *const RSConfig) -> sds;
}
unsafe extern "C" {
    pub fn UpgradeDeprecatedMTConfigs();
}
unsafe extern "C" {
    pub fn getRedisConfigValue(
        ctx: *mut RedisModuleCtx,
        confName: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn iteratorsConfig_init(config: *mut IteratorsConfig);
}
unsafe extern "C" {
    pub fn LogWarningDeprecatedFTConfig(
        ctx: *mut RedisModuleCtx,
        action: *const ::std::os::raw::c_char,
        name: *const ::std::os::raw::c_char,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TrieMap {
    _unused: [u8; 0],
}
unsafe extern "C" {
